
local 战斗准备类 = class()
function 战斗准备类:初始化()
  self.战斗盒子={}
end
function 战斗准备类:创建玩家战斗(玩家id, 序号, 任务id, 地图)
  if 玩家数据[任务id]==nil or (玩家数据[任务id]~=nil and 玩家数据[任务id].角色.数据.战斗开关) then
    常规提示(玩家id,"#Y/对方正在战斗中......")
    return
  end
  if 玩家id==任务id then
    常规提示(玩家id,"#Y/自己打自己?你是不是打傻了?......")
    return
  end
  if (玩家数据[玩家id].队伍 ~= 0 and 玩家数据[玩家id].队长==false) or (玩家数据[任务id].队伍 ~= 0 and 玩家数据[任务id].队长==false) then
    常规提示(玩家id,"#Y/只有队长才能触发战斗!......")
    return
  end
  if 序号==200006 and 玩家数据[玩家id].角色.数据.帮派数据.编号==玩家数据[任务id].角色.数据.帮派数据.编号 then
    常规提示(玩家id,"#Y/同一帮派的玩家之间无法触发战斗！")
    return
  end
  self.临时id = 玩家id .. os.time() .. 取随机数(1, 999999)
  self.临时id = self.临时id + 0
  if 玩家数据[玩家id].队伍==0 then
    玩家数据[玩家id].战斗 = self.临时id
  else
    for n=1,#队伍数据[玩家数据[玩家id].队伍].成员数据 do
      if 队伍处理类:取是否助战(玩家数据[玩家id].队伍,n) == 0 then
        玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].战斗=self.临时id
      end
    end
  end
  --接受方所有人设置战斗标识
  if 玩家数据[任务id].队伍==0 then
    玩家数据[任务id].战斗 = self.临时id
  else
    for n=1,#队伍数据[玩家数据[任务id].队伍].成员数据 do
      if 队伍处理类:取是否助战(玩家数据[任务id].队伍,n) == 0 then
        玩家数据[队伍数据[玩家数据[任务id].队伍].成员数据[n]].战斗=self.临时id
      end
    end
  end
  地图处理类:设置战斗开关(玩家id,true)
  if 序号 == 200001 or 序号 == 200002 or 序号 == 200003 or 序号 == 200004 or 序号 == 200005 or 序号 == 200006 or 序号 == 200007 or 序号 == 200008 then
    地图处理类:设置战斗开关(任务id,true)
    if 序号 == 200003 or 序号==200004 or 序号==200005 or 序号==200006 then
      常规提示(任务id,"#Y你进入了由#R" .. 玩家数据[玩家id].角色.数据.名称 .. "#Y发起的战斗中")
    elseif 序号 == 200007 then
      常规提示(任务id,"#Y你进入了由#R" .. 玩家数据[玩家id].角色.数据.名称 .. "#Y发起的战斗中,战斗失败将会受到失败死亡惩罚！")
    elseif 序号 == 200008 then
      常规提示(任务id,"#Y你进入了由#R" .. 玩家数据[玩家id].角色.数据.名称 .. "#Y发起的战斗中,战斗失败将会受到三倍失败死亡惩罚！")
    end
  end
  self.战斗盒子[self.临时id] = 战斗处理类.创建()
  self.战斗盒子[self.临时id]:进入战斗(玩家id, 序号, 任务id, 地图)
end
function 战斗准备类:创建战斗(玩家id,序号,任务id,地图)
  local 临时id=取随机数(999999,9999999).."_"..玩家id.."_"..os.time().."_"..取随机数(1,999999)
   临时id=临时id
   玩家数据[玩家id].战斗=临时id
  if 玩家数据[玩家id].队伍==0 then
    玩家数据[玩家id].角色.数据.战斗开关=true
    地图处理类:设置战斗开关(玩家id,true)
  else
    for n=1,#队伍数据[玩家数据[玩家id].队伍].成员数据 do
      if 玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].队伍==玩家数据[玩家id].队伍 then
        if 队伍处理类:取是否助战(玩家数据[玩家id].队伍,n) == 0 then
          玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].战斗=临时id
          玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].角色.数据.战斗开关=true
          地图处理类:设置战斗开关(队伍数据[玩家数据[玩家id].队伍].成员数据[n],true)
        end
      end
    end
  end
  self.战斗盒子[临时id]=战斗处理类.创建()
  if 序号==100001 or 序号==100007 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,地图)
  elseif 序号==100002 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取宝图强盗信息(任务id,玩家id))
  elseif 序号==100003 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取宝图遇怪信息(任务id,玩家id))
  elseif 序号==100004 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取封妖任务信息(任务id,玩家id))
  elseif 序号==100005 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取幼儿园信息(任务id,玩家id))
  elseif 序号==100006 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取科举闯关信息(任务id,玩家id))
  elseif 序号==100008 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取捉鬼任务信息(任务id,玩家id))
  elseif 序号==100009 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取星宿任务信息(任务id,玩家id))
  elseif 序号==100010 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取妖魔鬼怪信息(任务id,玩家id))
  elseif 序号==100011 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取门派闯关信息(任务id,玩家id))
  elseif 序号==100012 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取游泳水妖信息(任务id,玩家id))
  elseif 序号==100013 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取官职流氓信息(任务id,玩家id))
  elseif 序号==100014 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取官职巡逻信息(任务id,玩家id))
  elseif 序号==100015 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取门派巡逻信息(任务id,玩家id))
  elseif 序号==100016 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取门派示威信息(任务id,玩家id))
  elseif 序号==100017 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取门派支援信息(任务id,玩家id))
  elseif 序号==100018 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取门派乾坤袋信息(任务id,玩家id))
  elseif 序号==100019 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取迷宫小怪信息(任务id,玩家id))
  elseif 序号==100020 then
    if 任务数据[任务id].模型=="炎魔神" then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取妖王炎魔神(任务id,玩家id))
    elseif 任务数据[任务id].模型=="鬼将" then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取妖王鬼将(任务id,玩家id))
    elseif 任务数据[任务id].模型=="净瓶女娲" then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取妖王净瓶女娲(任务id,玩家id))
    end
  elseif 序号==100021 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取江湖大盗信息(任务id,玩家id))
  elseif 序号==100022 then
    if 任务数据[任务id].分类==1 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取毛贼信息(任务id,玩家id))
    elseif 任务数据[任务id].分类==2 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取销赃贼信息(任务id,玩家id))
    elseif 任务数据[任务id].分类==3 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取宝贼信息(任务id,玩家id))
    elseif 任务数据[任务id].分类==4 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取盗贼首领信息(任务id,玩家id))
    end
  elseif 序号==100023 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取皇宫贼王信息(任务id,玩家id))
  elseif 序号==100024 then
    if 任务数据[任务id].等级==60 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取60级世界BOSS信息(任务id,玩家id))
    elseif 任务数据[任务id].等级==100 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取100级世界BOSS信息(任务id,玩家id))
    elseif 任务数据[任务id].等级==150 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取150级世界BOSS信息(任务id,玩家id))
    end
  elseif 序号==100025 then
    local 随机序列=取随机数(1,#任务数据[任务id].完成)
    local 战斗序列=任务数据[任务id].完成[随机序列]
    任务数据[任务id].战斗序列=随机序列
    if 战斗序列==1 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取镖王信息1(任务id,玩家id))
    elseif 战斗序列==2 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取镖王信息2(任务id,玩家id))
    elseif 战斗序列==3 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取镖王信息3(任务id,玩家id))
    elseif 战斗序列==4 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取镖王信息4(任务id,玩家id))
    elseif 战斗序列==5 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取镖王信息5(任务id,玩家id))
    elseif 战斗序列==6 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取镖王信息6(任务id,玩家id))
    end
  elseif 序号==100026 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取三界悬赏令信息(任务id,玩家id))
  elseif 序号==100027 then
    if 释怀定制 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取知了王信息1(任务id,玩家id))
    else
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取知了王信息(任务id,玩家id))
    end
  elseif 序号==100028 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取副本芭蕉妖怪信息(任务id,玩家id))
  elseif 序号==100029 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取副本三妖信息(任务id,玩家id))
  elseif 序号==100030 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取副本鬼祟小怪信息(任务id,玩家id))
  elseif 序号==100031 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取副本国王信息(任务id,玩家id))
  elseif 序号==100032 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:天庭叛逆(任务id,玩家id))
  elseif 序号==100033 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:捣乱的水果(任务id,玩家id))
  elseif 序号==100034 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取青龙巡逻信息(任务id,玩家id))
  elseif 序号==100035 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取玄武巡逻信息(任务id,玩家id))
  elseif 序号==100036 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取冠状病毒(任务id,玩家id))
  elseif 序号==100037 then
    if 释怀定制 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取地煞信息1(任务id,玩家id))
    else
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取地煞信息(任务id,玩家id))
    end
  elseif 序号==100038 then
    if 释怀定制 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取知了先锋信息1(任务id,玩家id))
    else
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取知了先锋信息(任务id,玩家id))
    end
  elseif 序号==100039 then
    if 释怀定制 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取小知了王信息1(任务id,玩家id))
    else
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取小知了王信息(任务id,玩家id))
    end
  elseif 序号==100040 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取大力神灵信息(任务id,玩家id))
  elseif 序号==100041 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取妖魔亲信信息(任务id,玩家id))
  elseif 序号==100042 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取蜃妖元神信息(任务id,玩家id))
  elseif 序号==100043 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取周猎户信息(任务id,玩家id))
  elseif 序号==100044 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取法宝战斗信息(任务id,玩家id))
  elseif 序号==100045 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取法宝内丹战斗信息(任务id,玩家id))
  elseif 序号==100046 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取横行霸道的土匪战斗信息(任务id,玩家id))
  elseif 序号==100047 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取飞升心魔战斗信息(任务id,玩家id))
  elseif 序号==100048 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取飞升小妖战斗信息(任务id,玩家id))
  elseif 序号==100049 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取飞升小宝箱战斗信息(任务id,玩家id))
  elseif 序号==100050 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取飞升阵法1战斗信息(任务id,玩家id))
  elseif 序号==100051 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取飞升阵法2战斗信息(任务id,玩家id))
  elseif 序号==100052 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取飞升阵法3战斗信息(任务id,玩家id))
  elseif 序号==100053 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取飞升阵法4战斗信息(任务id,玩家id))
  elseif 序号==100054 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取飞升阵法5战斗信息(任务id,玩家id))
  elseif 序号==100055 then
    if 生死劫数据[玩家id]==1 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取生死劫信息1(任务id,玩家id))
    elseif 生死劫数据[玩家id]==2 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取生死劫信息2(任务id,玩家id))
    elseif 生死劫数据[玩家id]==3 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取生死劫信息3(任务id,玩家id))
    elseif 生死劫数据[玩家id]==4 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取生死劫信息4(任务id,玩家id))
    elseif 生死劫数据[玩家id]==5 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取生死劫信息5(任务id,玩家id))
    elseif 生死劫数据[玩家id]==6 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取生死劫信息6(任务id,玩家id))
    elseif 生死劫数据[玩家id]==7 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取生死劫信息7(任务id,玩家id))
    elseif 生死劫数据[玩家id]==8 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取生死劫信息8(任务id,玩家id))
    elseif 生死劫数据[玩家id]==9 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取生死劫信息9(任务id,玩家id))
    end
  elseif 序号==100056 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取天罡星信息(任务id,玩家id))
  elseif 序号==100057 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取天蝎座信息(任务id,玩家id))
  elseif 序号==100058 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取射手座信息(任务id,玩家id))
  elseif 序号==100059 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取摩羯座信息(任务id,玩家id))
  elseif 序号==100060 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取新服福利BOSS信息(任务id,玩家id))
  elseif 序号==100061 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取帮派侍卫信息(任务id,玩家id))
  elseif 序号==100062 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取帮派护法信息(任务id,玩家id))
  elseif 序号==100063 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取水瓶座信息(任务id,玩家id))
  elseif 序号==100064 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取白羊座信息(任务id,玩家id))
  elseif 序号==100065 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取金牛座信息(任务id,玩家id))
  elseif 序号==100066 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取车迟斗法贡品信息(任务id,玩家id))
  elseif 序号==100067 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取车迟斗法三清信息(任务id,玩家id))
  elseif 序号==100068 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取车迟斗法求雨信息(任务id,玩家id))
  elseif 序号==100069 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取车迟斗法不动信息(任务id,玩家id))
  elseif 序号==100070 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取车迟斗法妖怪信息(任务id,玩家id))
  elseif 序号==100071 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取倔强青铜信息(任务id,玩家id))
  elseif 序号==100072 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取秩序白银信息(任务id,玩家id))
  elseif 序号==100073 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取荣耀黄金信息(任务id,玩家id))
  elseif 序号==100074 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取永恒钻石信息(任务id,玩家id))
  elseif 序号==100075 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取至尊星耀信息(任务id,玩家id))
  elseif 序号==100076 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取最强王者信息(任务id,玩家id))
  elseif 序号==100077 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取梦幻粉信息(任务id,玩家id))
  elseif 序号==100078 then
    if 任务数据[任务id].等级==60 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取60级蚩尤元神信息(任务id,玩家id))
    elseif 任务数据[任务id].等级==100 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取100级蚩尤元神信息(任务id,玩家id))
    elseif 任务数据[任务id].等级==150 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取150级蚩尤元神信息(任务id,玩家id))
    end
  elseif 序号==100079 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取子鼠信息(任务id,玩家id))
  elseif 序号==100080 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取狮子座信息(任务id,玩家id))
  elseif 序号==100081 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取处女座信息(任务id,玩家id))
  elseif 序号==100082 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取天秤座信息(任务id,玩家id))
  elseif 序号==100083 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取丑牛信息(任务id,玩家id))
  elseif 序号==100084 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取散财童子信息(任务id,玩家id))
  elseif 序号==100085 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取神秘妖怪信息(任务id,玩家id))
  elseif 序号==100086 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取妄空曰天冷信息(任务id,玩家id))
  elseif 序号==100087 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取妄空曰天冷信息2(任务id,玩家id))
  elseif 序号==100088 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取渡劫师傅信息(任务id,玩家id))
  elseif 序号==100089 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取妄空曰天冷信息2(任务id,玩家id))
  elseif 序号==100090 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取蚩尤幻影信息(任务id,玩家id))
  elseif 序号==100091 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取神秘钥匙怪信息(任务id,玩家id))
  elseif 序号==100092 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取寅虎信息(任务id,玩家id))
  elseif 序号==100093 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取怒天魇信息(任务id,玩家id))
  elseif 序号==100094 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取叛军信息(任务id,玩家id))
  elseif 序号==100095 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取变强就点我(任务id,玩家id))
  elseif 序号==100096 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取不屈将魂信息(任务id,玩家id))
  elseif 序号==100097 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取马超信息(任务id,玩家id))
  elseif 序号==100098 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取黄忠信息(任务id,玩家id))
  elseif 序号==100099 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取张飞信息(任务id,玩家id))
  elseif 序号==100100 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取关羽信息(任务id,玩家id))
  elseif 序号==100101 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取赵云信息(任务id,玩家id))
  elseif 序号==100102 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取魔化沙僧信息(任务id,玩家id))
  elseif 序号==100103 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取魔化取经信息(任务id,玩家id))
  elseif 序号==100104 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取七十二地煞星信息(任务id,玩家id))
  elseif 序号==100105 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取福利宝箱怪(任务id,玩家id))
  elseif 序号==100106 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取倾国倾城信息(任务id,玩家id))
  elseif 序号==100107 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取美食专家信息(任务id,玩家id))
  elseif 序号==100108 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天塔信息(任务id,玩家id))
  elseif 序号==100109 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取贼王的线索信息(任务id,玩家id))
  elseif 序号==100110 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取貔貅的羁绊信息(任务id,玩家id))
  elseif 序号==100111 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取卯兔信息(任务id,玩家id))
  elseif 序号==100112 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取水陆桃木虫信息(任务id,玩家id))
  elseif 序号==100113 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取水陆泼猴信息(任务id,玩家id))
  elseif 序号==100114 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取水陆翼虎必死信息(任务id,玩家id))
  elseif 序号==100115 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取水陆蝰蛇必死信息(任务id,玩家id))
  elseif 序号==100116 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取水陆翼虎信息(任务id,玩家id))
  elseif 序号==100117 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取水陆蝰蛇信息(任务id,玩家id))
  elseif 序号==100118 then
    if 任务数据[任务id].名称=="巡山小妖" then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取水陆巡山小妖信息(任务id,玩家id))
    elseif 任务数据[任务id].名称=="上古妖兽头领" then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取水陆上古妖兽头领信息(任务id,玩家id))
    elseif 任务数据[任务id].名称=="妖将军" then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取水陆妖将军信息(任务id,玩家id))
    else
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取水陆魑魅魍魉信息(任务id,玩家id))
    end
  elseif 序号==100119 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取水陆毒虫信息(任务id,玩家id))
  elseif 序号==100120 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取宝图强盗信息(任务id,玩家id))
  elseif 序号==100121 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取魔域魔兵信息(任务id,玩家id))
  elseif 序号==100122 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取捣乱的年兽信息(任务id,玩家id))
  elseif 序号==100123 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取年兽王信息(任务id,玩家id))
  elseif 序号==100124 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取怨灵幻影信息(任务id,玩家id))
  elseif 序号==100125 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取灵感分身信息(任务id,玩家id))
  elseif 序号==100126 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天河妖信息(任务id,玩家id))
  elseif 序号==100127 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天散财童子信息(任务id,玩家id))
  elseif 序号==100128 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天黑熊精信息(任务id,玩家id))
  elseif 序号==100129 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天五色竹条信息(任务id,玩家id))
  elseif 序号==100130 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天金鱼将军1信息(任务id,玩家id))
  elseif 序号==100131 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天金鱼将军2信息(任务id,玩家id))
  elseif 序号==100132 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天金鱼将军3信息(任务id,玩家id))
  elseif 序号==100133 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天金鱼将军4信息(任务id,玩家id))
  elseif 序号==100134 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天金鱼将军5信息(任务id,玩家id))
  elseif 序号==100135 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天灵感大王信息(任务id,玩家id))
  elseif 序号==100136 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取魔族先锋信息(任务id,玩家id))
  elseif 序号==100137 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取魔族头目信息(任务id,玩家id))
  elseif 序号==100138 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取魔族将军信息(任务id,玩家id))
  elseif 序号==100139 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取魔族BOSS信息(任务id,玩家id))
  elseif 序号==100140 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取商人的鬼魂信息(任务id,玩家id))
  elseif 序号==100141 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取妖风信息(任务id,玩家id))
  elseif 序号==100142 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取僵尸虎子信息(任务id,玩家id))
  elseif 序号==100143 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取白鹿精信息(任务id,玩家id))
  elseif 序号==100144 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取玉面狐狸信息(任务id,玩家id))
  elseif 序号==100145 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取酒肉和尚1信息(任务id,玩家id))
  elseif 序号==100146 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取守门天将信息(任务id,玩家id))
  elseif 序号==100147 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取白琉璃信息(任务id,玩家id))
  elseif 序号==100148 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取酒肉和尚信息(任务id,玩家id))
  elseif 序号==100149 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取幽冥鬼信息(任务id,玩家id))
  elseif 序号==100150 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取衙门守卫信息(任务id,玩家id))
  elseif 序号==100151 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取虾兵信息(任务id,玩家id))
  elseif 序号==100152 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取山神信息(任务id,玩家id))
  elseif 序号==100153 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取蟹将军信息(任务id,玩家id))
  elseif 序号==100154 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取假刘洪信息(任务id,玩家id))
  elseif 序号==100155 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取假李彪信息(任务id,玩家id))
  elseif 序号==100156 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取李彪信息(任务id,玩家id))
  elseif 序号==100157 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取天兵飞剑信息(任务id,玩家id))
  elseif 序号==100158 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取卷帘大将心魔信息(任务id,玩家id))
  elseif 序号==100159 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取卷帘大将心魔必败信息(任务id,玩家id))
  elseif 序号==100160 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取路人甲信息(任务id,玩家id))
  elseif 序号==100161 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取哪吒信息(任务id,玩家id))
  elseif 序号==100162 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取心魔守门天将信息(任务id,玩家id))
  elseif 序号==100163 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取龙孙信息(任务id,玩家id))
  elseif 序号==100164 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取龙女信息(任务id,玩家id))
  elseif 序号==100165 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取卷帘大将真心魔信息(任务id,玩家id))
  elseif 序号==100166 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取女妖信息(任务id,玩家id))
  elseif 序号==100167 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取金琉璃信息(任务id,玩家id))
  elseif 序号==100168 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取翻天怪信息(任务id,玩家id))
  elseif 序号==100169 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取姚太尉信息(任务id,玩家id))
  elseif 序号==100170 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取王母凤凰信息(任务id,玩家id))
  elseif 序号==100171 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取小白龙信息(任务id,玩家id))
  elseif 序号==100172 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取梦之魅信息(任务id,玩家id))
  elseif 序号==100173 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取血之魅信息(任务id,玩家id))
  elseif 序号==100174 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取森之魅信息(任务id,玩家id))
  elseif 序号==100175 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取奔波儿灞信息(任务id,玩家id))
  elseif 序号==100176 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取蟹将军1信息(任务id,玩家id))
  elseif 序号==100177 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取虾将军信息(任务id,玩家id))
  elseif 序号==100178 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取龙须草战斗信息(任务id,玩家id))
  elseif 序号==100179 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取万圣公主信息(任务id,玩家id))
  elseif 序号==100180 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取牛魔王亲卫信息(任务id,玩家id))
  elseif 序号==100181 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取九头精怪信息(任务id,玩家id))
  elseif 序号==100182 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取玉帝亲兵信息(任务id,玩家id))
  elseif 序号==100183 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取千年怨鬼信息(任务id,玩家id))
  elseif 序号==100184 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取春十三娘信息(任务id,玩家id))
  elseif 序号==100185 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取康太尉信息(任务id,玩家id))
  elseif 序号==100186 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取高小姐信息(任务id,玩家id))
  elseif 序号==100187 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取冤魂信息(任务id,玩家id))
  elseif 序号==100188 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取杨戬信息(任务id,玩家id))
  elseif 序号==100189 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取龙神信息(任务id,玩家id))
  elseif 序号==100190 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取吊死鬼信息(任务id,玩家id))
  elseif 序号==100191 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取青玄仙子信息(任务id,玩家id))
  end
end

function 战斗准备类:更新(dt)
  for n, v in pairs(self.战斗盒子) do
    if self.战斗盒子[n]~=nil then self.战斗盒子[n]:更新(n) end
    if self.战斗盒子[n].结束条件 then self.战斗盒子[n]=nil end
  end
end
function 战斗准备类:数据处理(玩家id,序号,内容,参数)
  if 玩家数据[玩家id].战斗==0 or self.战斗盒子[玩家数据[玩家id].战斗]==nil then
   return 0
  else
    self.战斗盒子[玩家数据[玩家id].战斗]:数据处理(玩家id,序号,内容,参数)
  end
end

function 战斗准备类:取赵云信息(任务id,玩家id)
  local 等级=玩家数据[玩家id].角色.数据.等级
  local 模型="龙太子"
  local 武器造型={武器="弑皇",级别=160}
  local 战斗单位={}
  local 难度系数 = 0.75
  战斗单位[1]={
    名称="赵云",
    模型=模型,
    角色=true,
    染色方案=3,
    染色组={[1]=3,[2]=6,[3]=6,序号=3710},
    武器=取武器数据(武器造型.武器,武器造型.级别),
    武器染色组={[1]=1,[2]=0},
    武器染色方案=20113,
    变异=false,
    显示饰品=false,
    伤害=等级*10+1000*难度系数,
    气血=等级*400*难度系数,
    灵力=等级*10+500*难度系数,
    速度=5.3*难度系数,
    防御=等级*6*难度系数,
    法防=等级*6*难度系数,
    躲闪=等级*5*难度系数,
    魔法=2000,
    等级=等级,
    技能={"魔之心","法术连击"},
    主动技能=取随机法术(5)
  }
  local 模型名称范围={"亲兵"}
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    local 模型=Q_随机模型[取随机数(1,10)]
    武器造型=取天罡星武器造型(模型)
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={
      名称="上将亲兵",
      模型=模型,
      角色=true,
      武器=取武器数据(武器造型.武器,武器造型.级别),
      伤害=等级*8+500*难度系数,
      气血=等级*300*难度系数,
      灵力=等级*8+300*难度系数,
      速度=等级*2.3*难度系数,
      防御=等级*6*难度系数,
      法防=等级*6*难度系数,
      躲闪=等级*5*难度系数,
      魔法=2000,
      等级=等级,
      技能={},
      主动技能=技能随机
    }
  end
  return 战斗单位
end

function 战斗准备类:取关羽信息(任务id,玩家id)
  local 等级=玩家数据[玩家id].角色.数据.等级
  local 模型="巨魔王"
  local 武器造型={武器="裂天",级别=160}
  local 战斗单位={}
  local 难度系数 = 0.75
  战斗单位[1]={
    名称="关羽",
    模型=模型,
    角色=true,
    染色方案=5,
    染色组={[1]=5,[2]=5,[3]=5,序号=3710},
    武器=取武器数据(武器造型.武器,武器造型.级别),
    武器染色组={[1]=1,[2]=0},
    武器染色方案=20113,
    变异=false,
    显示饰品=false,
    伤害=等级*10+1000*难度系数,
    气血=等级*400*难度系数,
    灵力=等级*10+500*难度系数,
    速度=5.3*难度系数,
    防御=等级*6*难度系数,
    法防=等级*6*难度系数,
    躲闪=等级*5*难度系数,
    魔法=2000,
    等级=等级,
    技能={"魔之心","法术连击"},
    主动技能=取随机法术(5)
  }
  local 模型名称范围={"亲兵"}
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    local 模型=Q_随机模型[取随机数(1,10)]
    武器造型=取天罡星武器造型(模型)
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={
      名称="上将亲兵",
      模型=模型,
      角色=true,
      武器=取武器数据(武器造型.武器,武器造型.级别),
      伤害=等级*8+500*难度系数,
      气血=等级*300*难度系数,
      灵力=等级*8+300*难度系数,
      速度=等级*2.3*难度系数,
      防御=等级*6*难度系数,
      法防=等级*6*难度系数,
      躲闪=等级*5*难度系数,
      魔法=2000,
      等级=等级,
      技能={},
      主动技能=技能随机
    }
  end
  return 战斗单位
end

function 战斗准备类:取张飞信息(任务id,玩家id)
  local 等级=玩家数据[玩家id].角色.数据.等级
  local 模型="龙太子"
  local 武器造型={武器="飞龙在天",级别=120}
  local 战斗单位={}
  local 难度系数 = 0.75
  战斗单位[1]={
    名称="张飞",
    模型=模型,
    角色=true,
    染色方案=3,
    染色组={[1]=3,[2]=6,[3]=6,序号=3710},
    武器=取武器数据(武器造型.武器,武器造型.级别),
    武器染色组={[1]=1,[2]=0},
    武器染色方案=20113,
    变异=false,
    显示饰品=false,
    伤害=等级*10+1000*难度系数,
    气血=等级*400*难度系数,
    灵力=等级*10+500*难度系数,
    速度=5.3*难度系数,
    防御=等级*6*难度系数,
    法防=等级*6*难度系数,
    躲闪=等级*5*难度系数,
    魔法=2000,
    等级=等级,
    技能={"魔之心","法术连击"},
    主动技能=取随机法术(5)
  }
  local 模型名称范围={"亲兵"}
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    local 模型=Q_随机模型[取随机数(1,10)]
    武器造型=取天罡星武器造型(模型)
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={
      名称="上将亲兵",
      模型=模型,
      角色=true,
      武器=取武器数据(武器造型.武器,武器造型.级别),
      伤害=等级*8+500*难度系数,
      气血=等级*300*难度系数,
      灵力=等级*8+300*难度系数,
      速度=等级*2.3*难度系数,
      防御=等级*6*难度系数,
      法防=等级*6*难度系数,
      躲闪=等级*5*难度系数,
      魔法=2000,
      等级=等级,
      技能={},
      主动技能=技能随机
    }
  end
  return 战斗单位
end

function 战斗准备类:取黄忠信息(任务id,玩家id)
  local 等级=玩家数据[玩家id].角色.数据.等级
  local 模型="羽灵神"
  local 武器造型={武器="若木",级别=160}
  local 战斗单位={}
  local 难度系数 = 0.75
  战斗单位[1]={
    名称="黄忠",
    模型=模型,
    角色=true,
    染色方案=1,
    染色组={[1]=2,[2]=5,[3]=5,序号=3710},
    武器=取武器数据(武器造型.武器,武器造型.级别),
    武器染色组={[1]=1,[2]=0},
    武器染色方案=20113,
    变异=false,
    显示饰品=false,
    伤害=等级*10+1000*难度系数,
    气血=等级*400*难度系数,
    灵力=等级*10+500*难度系数,
    速度=5.3*难度系数,
    防御=等级*6*难度系数,
    法防=等级*6*难度系数,
    躲闪=等级*5*难度系数,
    魔法=2000,
    等级=等级,
    技能={"魔之心","法术连击"},
    主动技能=取随机法术(5)
  }
  local 模型名称范围={"亲兵"}
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    local 模型=Q_随机模型[取随机数(1,10)]
    武器造型=取天罡星武器造型(模型)
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={
      名称="上将亲兵",
      模型=模型,
      角色=true,
      武器=取武器数据(武器造型.武器,武器造型.级别),
      伤害=等级*8+500*难度系数,
      气血=等级*300*难度系数,
      灵力=等级*8+300*难度系数,
      速度=等级*2.3*难度系数,
      防御=等级*6*难度系数,
      法防=等级*6*难度系数,
      躲闪=等级*5*难度系数,
      魔法=2000,
      等级=等级,
      技能={},
      主动技能=技能随机
    }
  end
  return 战斗单位
end

function 战斗准备类:取马超信息(任务id,玩家id)
  local 等级=玩家数据[玩家id].角色.数据.等级
  local 模型="逍遥生"
  local 武器造型={武器="擒龙",级别=160}
  local 战斗单位={}
  local 难度系数 = 0.7
  战斗单位[1]={
    名称="马超",
    模型=模型,
    角色=true,
    染色方案=1,
    染色组={[1]=5,[2]=3,[3]=5,序号=3710},
    武器=取武器数据(武器造型.武器,武器造型.级别),
    武器染色组={[1]=1,[2]=0},
    武器染色方案=20113,
    变异=false,
    显示饰品=false,
    伤害=等级*10+1000*难度系数,
    气血=等级*400*难度系数,
    灵力=等级*10+500*难度系数,
    速度=5.3*难度系数,
    防御=等级*6*难度系数,
    法防=等级*6*难度系数,
    躲闪=等级*5*难度系数,
    魔法=2000,
    等级=等级,
    技能={"魔之心","法术连击"},
    主动技能=取随机法术(5)
  }
  local 模型名称范围={"亲兵"}
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    local 模型=Q_随机模型[取随机数(1,10)]
    武器造型=取天罡星武器造型(模型)
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={
      名称="上将亲兵",
      模型=模型,
      角色=true,
      武器=取武器数据(武器造型.武器,武器造型.级别),
      伤害=等级*8+500*难度系数,
      气血=等级*300*难度系数,
      灵力=等级*8+300*难度系数,
      速度=等级*2.3*难度系数,
      防御=等级*6*难度系数,
      法防=等级*6*难度系数,
      躲闪=等级*5*难度系数,
      魔法=2000,
      等级=等级,
      技能={},
      主动技能=技能随机
    }
  end
  return 战斗单位
end

function 战斗准备类:取毛贼信息(任务id,玩家id)
  local 战斗单位={}
  local 模型范围={"蟹将","虾兵","大海龟","海毛虫","巨蛙","海星","章鱼","小龙女","蛟龙","龟丞相"}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  local 模型=模型范围[取随机数(1,#模型范围)]
  战斗单位[1]={名称="毛贼",模型="强盗",伤害=等级*8,气血=等级*等级,灵力=等级*4,速度=等级*1.5,防御=等级*3,法防=等级*0.7,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  local 模型=取随机怪(1,65)
  战斗单位[2]={名称="凶兽",模型="老虎",伤害=等级*8,气血=等级*等级*0.85,灵力=等级*2,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级必杀","高级连击"},主动技能={}}
  战斗单位[3]={名称="打手",模型="赌徒",伤害=等级*6,气血=等级*等级*0.65,灵力=等级*2,速度=等级*2.5,防御=等级*1,法防=等级*0.2,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[4]={名称="打手",模型="赌徒",伤害=等级*6,气血=等级*等级*0.65,灵力=等级*2,速度=等级*2.5,防御=等级*1,法防=等级*0.2,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[5]={名称="打手",模型="赌徒",伤害=等级*6,气血=等级*等级*0.65,灵力=等级*2,速度=等级*2.5,防御=等级*1,法防=等级*0.2,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[6]={名称="打手",模型="赌徒",伤害=等级*6,气血=等级*等级*0.65,灵力=等级*2,速度=等级*2.5,防御=等级*1,法防=等级*0.2,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[7]={名称="打手",模型="赌徒",伤害=等级*6,气血=等级*等级*0.65,灵力=等级*2,速度=等级*2.5,防御=等级*1,法防=等级*0.2,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[8]={名称="打手",模型="赌徒",伤害=等级*6,气血=等级*等级*0.65,灵力=等级*2,速度=等级*2.5,防御=等级*1,法防=等级*0.2,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能={}}
  return 战斗单位
end
function 战斗准备类:取销赃贼信息(任务id,玩家id)
  local 战斗单位={}
  local 模型范围={"蟹将","虾兵","大海龟","海毛虫","巨蛙","海星","章鱼","小龙女","蛟龙","龟丞相"}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  local 模型=模型范围[取随机数(1,#模型范围)]
  战斗单位[1]={名称="销赃贼",模型="吸血鬼",伤害=等级*9,气血=等级*等级*1.5,灵力=等级*5,速度=等级*2,防御=等级*4,法防=等级*1,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[2]={名称="飞贼喽啰",模型="山贼",伤害=等级*8,气血=等级*等级,灵力=等级*2,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[3]={名称="飞贼喽啰",模型="山贼",伤害=等级*8,气血=等级*等级,灵力=等级*2,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[4]={名称="凶鬼",模型="牛头",伤害=等级*5,气血=等级*等级,灵力=等级*6,速度=等级*2.5,防御=等级*1,法防=等级*0.2,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能={"水攻","烈火","落岩","雷击"}}
  战斗单位[5]={名称="凶兽",模型="老虎",变异=true,伤害=等级*10,气血=等级*等级,灵力=等级*2,速度=等级*2.5,防御=等级*3,法防=等级*0.2,躲闪=等级*2,魔法=200,等级=等级,技能={"高级连击","高级必杀"},主动技能={}}
  战斗单位[6]={名称="飞贼喽啰",模型="山贼",伤害=等级*8,气血=等级*等级,灵力=等级*2,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[7]={名称="飞贼喽啰",模型="山贼",伤害=等级*8,气血=等级*等级,灵力=等级*2,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[8]={名称="飞贼喽啰",模型="山贼",伤害=等级*8,气血=等级*等级,灵力=等级*2,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能={}}
  return 战斗单位
end
function 战斗准备类:取宝贼信息(任务id,玩家id)
  local 战斗单位={}
  local 模型范围={"蟹将","虾兵","大海龟","海毛虫","巨蛙","海星","章鱼","小龙女","蛟龙","龟丞相"}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  local 模型=模型范围[取随机数(1,#模型范围)]
  战斗单位[1]={名称="宝贼",模型="夜罗刹",伤害=等级*10,气血=等级*等级*2,灵力=等级*5,速度=等级*2,防御=等级*4,法防=等级*1,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[2]={名称="飞贼部将",模型="吸血鬼",伤害=等级*9,气血=等级*等级,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[3]={名称="凶兽",模型="噬天虎",伤害=等级*10,变异=true,气血=等级*等级*1.8,灵力=等级*6,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  战斗单位[4]={名称="飞贼部将",模型="地狱战神",伤害=等级*9,气血=等级*等级,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[5]={名称="飞贼部将",模型="吸血鬼",伤害=等级*9,气血=等级*等级,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[6]={名称="飞贼护卫",模型="天将",伤害=等级*8,气血=等级*等级,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[7]={名称="飞贼护卫",模型="天将",伤害=等级*8,气血=等级*等级,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[8]={名称="飞贼护卫",模型="天将",伤害=等级*8,气血=等级*等级,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[9]={名称="飞贼护卫",模型="天将",伤害=等级*8,气血=等级*等级,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[10]={名称="飞贼护卫",模型="天将",伤害=等级*8,气血=等级*等级,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  return 战斗单位
end
function 战斗准备类:取盗贼首领信息(任务id,玩家id)
  local 战斗单位={}
  local 模型范围={"蟹将","虾兵","大海龟","海毛虫","巨蛙","海星","章鱼","小龙女","蛟龙","龟丞相"}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  local 模型=模型范围[取随机数(1,#模型范围)]
  战斗单位[1]={名称="盗贼首领",模型="雨师",伤害=等级*11,气血=等级*等级*3,灵力=等级*5,速度=等级*2,防御=等级*4,法防=等级*1,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[2]={名称="飞贼骨干",模型="夜罗刹",伤害=等级*9,气血=等级*等级*1.5,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[3]={名称="飞贼骨干",模型="夜罗刹",伤害=等级*9,气血=等级*等级*1.5,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[4]={名称="飞贼骨干",模型="夜罗刹",伤害=等级*9,气血=等级*等级*1.5,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[5]={名称="神秘刺客",模型="夜罗刹",伤害=等级*11,气血=等级*等级*2.5,灵力=等级*6,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  战斗单位[6]={名称="异兽",模型="兔子怪",伤害=等级*9,气血=等级*等级*1.5,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[7]={名称="异兽",模型="蛟龙",伤害=等级*9,气血=等级*等级*1.5,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[8]={名称="异兽",模型="古代瑞兽",伤害=等级*9,气血=等级*等级*1.5,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[9]={名称="异兽",模型="凤凰",伤害=等级*9,气血=等级*等级*1.5,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[10]={名称="异兽",模型="古代瑞兽",伤害=等级*9,气血=等级*等级*1.5,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  return 战斗单位
end
function 战斗准备类:取皇宫贼王信息(任务id,玩家id)
  local 战斗单位={}
  local 模型范围={"蟹将","虾兵","大海龟","海毛虫","巨蛙","海星","章鱼","小龙女","蛟龙","龟丞相"}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+10
  local 模型=模型范围[取随机数(1,#模型范围)]
  战斗单位[1]={名称="贼王",模型="狂豹人形",伤害=等级*12,气血=等级*等级*5,灵力=等级*7,速度=等级*3,防御=等级*6,法防=等级*1,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[2]={名称="盗贼头领",模型="夜罗刹",伤害=等级*10,气血=等级*等级*2,灵力=等级*6,速度=等级*2,防御=等级*4,法防=等级*0.8,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[3]={名称="盗贼头领",模型="夜罗刹",伤害=等级*10,气血=等级*等级*2,灵力=等级*6,速度=等级*2,防御=等级*4,法防=等级*0.8,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[4]={名称="幽灵护卫",模型="幽灵",伤害=等级*9,气血=等级*等级*3,灵力=等级*5,速度=等级*2,防御=等级*2,法防=等级*0.2,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能={"阎罗令","尸腐毒","判官令"}}
  战斗单位[5]={名称="幽灵护卫",模型="幽灵",伤害=等级*9,气血=等级*等级*3,灵力=等级*5,速度=等级*2,防御=等级*2,法防=等级*0.2,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能={"阎罗令","尸腐毒","判官令"}}
  战斗单位[6]={名称="死士",模型="夜罗刹",伤害=等级*10,气血=等级*等级*2,灵力=等级*5,速度=等级*3,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[7]={名称="死士",模型="夜罗刹",伤害=等级*10,气血=等级*等级*2,灵力=等级*5,速度=等级*3,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[8]={名称="死士",模型="夜罗刹",伤害=等级*10,气血=等级*等级*2,灵力=等级*5,速度=等级*3,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[9]={名称="死士",模型="夜罗刹",伤害=等级*10,气血=等级*等级*2,灵力=等级*5,速度=等级*3,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[10]={名称="死士",模型="夜罗刹",伤害=等级*10,气血=等级*等级*2,灵力=等级*5,速度=等级*3,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  return 战斗单位
end
function 战斗准备类:取江湖大盗信息(任务id,玩家id)
  local 战斗单位={}
  local 模型范围={"蟹将","虾兵","大海龟","海毛虫","巨蛙","海星","章鱼","小龙女","蛟龙","龟丞相"}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  local 模型=模型范围[取随机数(1,#模型范围)]
  战斗单位[1]={名称="江湖骗子",模型=Q_随机模型[取随机数(1,#Q_随机模型)],伤害=等级*6,气血=等级*等级,灵力=等级*2,角色=true,速度=等级*1.5,防御=等级*1,法防=等级*0.2,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能={}}
  local 模型=取随机怪(1,65)
  战斗单位[2]={名称="恍然",模型=模型[2],伤害=等级*5,气血=等级*等级*0.65,灵力=等级*2,速度=等级*1,防御=等级*1,法防=等级*0.2,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能={}}
  local 模型=取随机怪(1,65)
  战斗单位[3]={名称="蛊惑",模型=模型[2],伤害=等级*6,气血=等级*等级*0.65,灵力=等级*2,速度=等级*2.5,防御=等级*1,法防=等级*0.2,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能={}}
  local 模型=取随机怪(1,65)
  战斗单位[4]={名称="色诱",模型=模型[2],伤害=等级*6,气血=等级*等级*0.65,灵力=等级*2,速度=等级*2.5,防御=等级*1,法防=等级*0.2,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能={"水攻","落岩","雷击","烈火"}}
  local 模型=取随机怪(1,65)
  战斗单位[5]={名称="难辨",模型=模型[2],伤害=等级*6,气血=等级*等级*0.65,灵力=等级*2,速度=等级*2.5,防御=等级*1,法防=等级*0.2,躲闪=等级*2,魔法=200,等级=等级,技能={"高级感知"},主动技能={}}
  return 战斗单位
end

function 战斗准备类:取门派乾坤袋信息(任务id,玩家id)
  --local 任务id1=玩家数据[玩家id].角色:取任务(111)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,伤害=等级*12,气血=qz(等级*等级),灵力=等级*5,速度=等级*3,防御=等级*6,法防=等级*1.2,躲闪=100,魔法=200,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  return 战斗单位
end

function 战斗准备类:取60级世界BOSS信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
    名称="万年老妖"
    ,模型=任务数据[任务id].模型
    ,伤害=1800
    ,气血=等级*等级*10+100000
    ,灵力=等级*20
    ,变异=true
    ,速度=等级*5
    ,防御=等级*10
    ,法防=等级*8
    ,躲闪=等级*5
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能=取随机法术(5)
  }
  战斗单位[2]={
    名称="千年老妖"
    ,模型="进阶黑山老妖"
    ,伤害=1500
    ,气血=等级*等级*10+50000
    ,灵力=等级*4
    ,变异=true
    ,速度=等级*2.5
    ,防御=等级*6
    ,法防=0
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"横扫千军","天雷斩","浪涌"}
  }
  战斗单位[3]={
    名称="千年老妖"
    ,模型="进阶黑山老妖"
    ,伤害=500
    ,变异=true
    ,气血=等级*等级*10+50000
    ,灵力=等级*20+200
    ,速度=等级*2.5
    ,防御=等级*3
    ,法防=等级*8
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"三昧真火","龙卷雨击","飞砂走石"}
  }
  战斗单位[4]={
    名称="老妖亲卫"
    ,模型="黑山老妖"
    ,伤害=等级*2
    ,变异=true
    ,气血=等级*等级*10+50000
    ,灵力=等级*4
    ,速度=等级*8
    ,防御=等级*2
    ,法防=0
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"失心符","定身符","反间之计"}
  }
  战斗单位[5]={
    名称="老妖亲卫"
    ,模型="黑山老妖"
    ,伤害=等级*2
    ,变异=true
    ,气血=等级*等级*10+50000
    ,灵力=等级*4
    ,速度=等级*8
    ,防御=等级*2
    ,法防=0
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"失心符","定身符","反间之计"}
  }
  战斗单位[6]={
    名称="老妖亲兵"
    ,模型="进阶锦毛貂精"
    ,伤害=等级*2
    ,变异=true
    ,气血=等级*等级*10+50000
    ,灵力=等级*20+200
    ,速度=300
    ,防御=等级*2
    ,法防=等级*8
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"三昧真火","龙卷雨击","飞砂走石"}
  }
  战斗单位[7]={
    名称="老妖亲兵"
    ,模型="进阶千年蛇魅"
    ,伤害=600
    ,变异=true
    ,气血=等级*等级*15+100000
    ,灵力=等级*4
    ,速度=等级*2.5
    ,防御=等级*15
    ,法防=等级*10
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级神佑复生"}
    ,主动技能={"推气过宫","晶清诀","罗汉金钟","圣灵之甲","四海升平"}
  }
  战斗单位[8]={
    名称="老妖亲兵"
    ,模型="进阶碧水夜叉"
    ,伤害=1500
    ,变异=true
    ,气血=等级*等级*10+50000
    ,灵力=等级*2
    ,速度=等级*4
    ,防御=等级*8
    ,法防=等级*0.5
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"横扫千军","天雷斩","浪涌"}
  }
  return 战斗单位
end

function 战斗准备类:取100级世界BOSS信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
    名称="万年鬼王"
    ,模型=任务数据[任务id].模型
    ,伤害=2500
    ,变异=true
    ,气血=等级*等级*20+100000
    ,灵力=等级*15+200
    ,速度=等级*7
    ,防御=等级*5
    ,法防=等级*5
    ,躲闪=等级*5
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能=取随机法术(5)}
  战斗单位[2]={
    名称="千年妖王"
    ,模型="鬼将"
    ,伤害=2200
    ,变异=true
    ,气血=等级*等级*15+50000
    ,灵力=等级*4
    ,速度=等级*3
    ,防御=等级*8
    ,法防=0
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级神佑复生"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  战斗单位[3]={
    名称="千年妖王"
    ,模型="鬼将"
    ,伤害=2200
    ,变异=true
    ,气血=等级*等级*15+50000
    ,灵力=等级*4
    ,速度=等级*3
    ,防御=等级*8
    ,法防=0
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级神佑复生"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  战斗单位[4]={
    名称="鬼王侍女"
    ,模型="进阶幽萤娃娃"
    ,伤害=等级*2
    ,变异=true
    ,气血=等级*等级*15+50000
    ,灵力=等级*20+200
    ,速度=等级*2
    ,防御=等级*2
    ,法防=等级*8
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[5]={
    名称="鬼王侍女"
    ,模型="进阶幽萤娃娃"
    ,变异=true
    ,伤害=等级*2
    ,气血=等级*等级*15+50000
    ,灵力=等级*20+200
    ,速度=等级*2
    ,防御=等级*2
    ,法防=等级*8
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[6]={
    名称="鬼族先锋"
    ,模型="进阶画魂"
    ,变异=true
    ,伤害=等级*2
    ,气血=等级*等级*15+50000
    ,灵力=等级*20+200
    ,速度=等级*2
    ,防御=等级*2
    ,法防=等级*8
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[7]={
    名称="鬼族先锋"
    ,模型="进阶阴阳伞"
    ,变异=true
    ,伤害=600
    ,气血=等级*等级*18+50000
    ,灵力=等级*4
    ,速度=等级*7
    ,防御=等级*3
    ,法防=等级*0.8
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级神佑复生"}
    ,主动技能={"失心符","定身符","反间之计","晶清诀","四海升平"}}
  战斗单位[8]={
    名称="鬼族先锋"
    ,模型="进阶阴阳伞"
    ,变异=true
    ,伤害=600
    ,气血=等级*等级*18+50000
    ,灵力=等级*4
    ,速度=等级*7
    ,防御=等级*3
    ,法防=等级*0.8
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"失心符","定身符","反间之计"}}
  战斗单位[9]={
    名称="鬼族圣贤"
    ,模型="进阶幽灵"
    ,变异=true
    ,伤害=600
    ,气血=等级*等级*25+100000
    ,灵力=等级*4
    ,速度=等级*2.5
    ,防御=等级*8
    ,法防=等级*8
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级神佑复生"}
    ,主动技能={"推气过宫","罗汉金钟","晶清诀"}}
  战斗单位[10]={
    名称="鬼族先锋"
    ,模型="进阶吸血鬼"
    ,变异=true
    ,伤害=2200
    ,气血=等级*等级*15+50000
    ,灵力=等级*2
    ,速度=等级*4
    ,防御=等级*5
    ,法防=等级*0.5
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级神佑复生"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  return 战斗单位
end

function 战斗准备类:取150级世界BOSS信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
    名称="罗刹王"
    ,模型=任务数据[任务id].模型
    ,变异=true
    ,伤害=3500
    ,气血=等级*等级*20+400000
    ,灵力=等级*8
    ,速度=等级*6
    ,防御=等级*6
    ,法防=等级*8
    ,躲闪=等级*8
    ,魔法=等级*10
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能=取随机法术(5)}
  战斗单位[2]={
    名称="大力神王"
    ,模型="进阶大力金刚"
    ,变异=true
    ,伤害=3300
    ,气血=等级*等级*15+200000
    ,灵力=等级*4
    ,速度=等级*3
    ,防御=等级*6
    ,法防=0
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级神佑复生","高级必杀","高级吸血"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  战斗单位[3]={
    名称="大力神王"
    ,模型="进阶大力金刚"
    ,变异=true
    ,伤害=3300
    ,气血=等级*等级*15+200000
    ,灵力=等级*4
    ,速度=等级*3
    ,防御=等级*6
    ,法防=0
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级神佑复生","高级必杀","高级吸血"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  战斗单位[4]={
    名称="狂暴法神"
    ,模型="进阶炎魔神"
    ,变异=true
    ,伤害=等级*2
    ,气血=等级*等级*15+200000
    ,灵力=等级*15+300
    ,速度=等级*2
    ,防御=等级*2
    ,法防=等级*6
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[5]={
    名称="狂暴法神"
    ,模型="进阶炎魔神"
    ,变异=true
    ,伤害=等级*2
    ,气血=等级*等级*15+200000
    ,灵力=等级*15+300
    ,速度=等级*2
    ,防御=等级*2
    ,法防=等级*6
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[6]={
    名称="玄法无边"
    ,模型="进阶混沌兽"
    ,变异=true
    ,伤害=等级*2
    ,气血=等级*等级*15+200000
    ,灵力=等级*15+300
    ,速度=等级*2
    ,防御=等级*2
    ,法防=等级*6
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[7]={
    名称="神封无量"
    ,模型="进阶琴仙"
    ,变异=true
    ,伤害=600
    ,气血=等级*等级*15+150000
    ,灵力=等级*4
    ,速度=800
    ,防御=等级*3
    ,法防=等级*0.8
    ,躲闪=等级*4
    ,愤怒=99999
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"失心符","定身符","反间之计"}}
  战斗单位[8]={
    名称="神封无量"
    ,模型="进阶琴仙"
    ,变异=true
    ,伤害=600
    ,气血=等级*等级*15+150000
    ,灵力=等级*4
    ,速度=800
    ,防御=等级*3
    ,法防=等级*0.8
    ,躲闪=等级*4
    ,愤怒=99999
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"失心符","定身符","反间之计"}}
  战斗单位[9]={
    名称="长生无界"
    ,模型="进阶龙龟"
    ,变异=true
    ,伤害=600
    ,气血=等级*等级*25+400000
    ,灵力=等级*4
    ,速度=等级*2.5
    ,防御=等级*6
    ,法防=等级*6
    ,躲闪=等级*4
    ,愤怒=99999
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"推气过宫","四海升平","罗汉金钟","晶清诀"}}
  战斗单位[10]={
    名称="力破乾坤"
    ,模型="进阶蜃气妖"
    ,变异=true
    ,伤害=2300
    ,气血=等级*等级*15+150000
    ,灵力=等级*2
    ,速度=等级*4
    ,防御=等级*5
    ,法防=等级*0.5
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级神佑复生","高级必杀","高级吸血"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  return 战斗单位
end

function 战斗准备类:取门派示威信息(任务id,玩家id)
  --local 任务id1=玩家数据[玩家id].角色:取任务(111)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  战斗单位[1]={
    名称=任务数据[任务id].名称
    ,模型=任务数据[任务id].模型
    ,武器=取武器数据(任务数据[任务id].武器,任务数据[任务id].武器等级)
    ,伤害=等级*10
    ,角色=true
    ,气血=qz(等级*50)
    ,灵力=等级*4
    ,速度=等级*3
    ,防御=等级*6
    ,法防=等级*1.2
    ,躲闪=100
    ,魔法=200
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术[任务数据[任务id].门派]
  }
  local 模型=取随机怪(30,等级)
  战斗单位[2]={
    名称="帮凶"
    ,模型=模型[2]
    ,伤害=等级*8
    ,角色=true
    ,气血=等级*30
    ,灵力=等级*3
    ,速度=等级*3
    ,防御=等级*5
    ,法防=等级*0.8
    ,躲闪=100
    ,魔法=200
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能=取随机法术(3)
  }
  return 战斗单位
end
function 战斗准备类:取门派支援信息(任务id,玩家id)
  --local 任务id1=玩家数据[玩家id].角色:取任务(111)
  local 战斗单位={}
  local 模型范围={"人","魔","仙"}
  if 玩家数据[玩家id].角色.数据.种族=="人" then
    模型范围={"魔","仙"}
  elseif 玩家数据[玩家id].角色.数据.种族=="魔" then
    模型范围={"人","仙"}
  elseif 玩家数据[玩家id].角色.数据.种族=="仙" then
    模型范围={"魔","人"}
  end
  模型范围=模型范围[取随机数(1,2)]
  local 模型=""
  if 模型范围=="人" then
    模型=Q_随机模型[取随机数(1,5)]
  elseif 模型范围=="仙" then
    模型=Q_随机模型[取随机数(6,10)]
  elseif 模型范围=="魔" then
    模型=Q_随机模型[取随机数(11,15)]
  end
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  战斗单位[1]={
    名称="敌人"
    ,模型=模型
    ,伤害=0
    ,角色=true
    ,气血=qz(等级*60)
    ,灵力=0
    ,速度=0
    ,防御=等级*4
    ,法防=等级*1.5
    ,躲闪=100
    ,魔法=200
    ,等级=等级
    ,技能={"高级感知"}
    ,不可封印=true
    ,主动技能={}
  }
  return 战斗单位
end
function 战斗准备类:取门派闯关信息(任务id,玩家id)
  local 任务id1=玩家数据[玩家id].角色:取任务(107)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+10
  战斗单位[1]={
    名称=任务数据[任务id].名称
    ,模型=任务数据[任务id].模型
    ,武器=取武器数据(Q_闯关数据[Q_门派编号[任务数据[任务id].序列]].武器.名称,120)
    ,伤害=等级*10
    ,角色=true
    ,气血=等级*等级*2
    ,灵力=等级*3
    ,速度=等级*1.5
    ,防御=等级*3
    ,法防=等级*0.2
    ,躲闪=100
    ,魔法=200
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术[Q_门派编号[任务数据[任务id].序列]]
  }
  local 数量=6+(15-#任务数据[任务id1].闯关序列)
  if 数量>10 then 数量=10 end
  for n=2,数量 do
    战斗单位[n]={
      名称=Q_门派编号[任务数据[任务id].序列].."弟子"
      ,模型=Q_闯关数据[Q_门派编号[任务数据[任务id].序列]].弟子[取随机数(1,#Q_闯关数据[Q_门派编号[任务数据[任务id].序列]].弟子)]
      ,伤害=等级*8
      ,气血=math.floor(等级*等级*2*0.75)
      ,灵力=等级*3+500
      ,速度=等级*1
      ,防御=等级*2
      ,法防=等级*0.1
      ,躲闪=100
      ,魔法=200
      ,等级=等级
      ,技能={"高级感知"}
      ,主动技能=Q_门派法术[Q_门派编号[任务数据[任务id].序列]]
    }
  end
  return 战斗单位
end
function 战斗准备类:取幼儿园信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=0
  战斗单位[1]={
    名称=任务数据[任务id].名称
    ,模型=任务数据[任务id].模型
    ,伤害=100
    ,变异=任务数据[任务id].变异
    ,气血=5000
    ,灵力=0
    ,速度=0
    ,防御=0
    ,法防=0
    ,躲闪=0
    ,魔法=200
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能={}
  }
  local 临时技能=取宝宝(任务数据[任务id].模型)
  for n=1,#临时技能[9] do
    if 取随机数()<=50 then
      战斗单位[1].技能[#战斗单位[1].技能+1]=临时技能[9][n]
    end
  end
  return 战斗单位
end
function 战斗准备类:取封妖任务信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=任务数据[任务id].等级+10
  战斗单位[1]={
    名称=任务数据[任务id].名称
    ,模型=任务数据[任务id].模型
    ,伤害=等级*10
    ,气血=等级*等级*1.5+(等级*10)
    ,灵力=等级*4
    ,速度=等级*2
    ,防御=等级*3
    ,法防=等级*1
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能=取随机法术(3)
  }
 local 数量=取队伍人数(玩家id)
 数量=数量+3
 local 等级=任务数据[任务id].等级
  for n=1,数量 do
    local 模型=取随机怪(任务数据[任务id].等级,任务数据[任务id].等级)
    战斗单位[n+1]={
      名称=模型[2].."喽啰"
      ,模型=模型[2]
      ,伤害=等级*7
      ,气血=等级*等级+(等级*20)
      ,灵力=等级*3
      ,速度=等级*1.5
      ,防御=等级*2
      ,法防=等级*0.2
      ,躲闪=等级*2
      ,魔法=200
      ,等级=等级
      ,技能={"高级感知"}
      ,主动技能=取随机法术(2)
    }
  end
  战斗单位[#战斗单位].变异=true
  战斗单位[#战斗单位].名称="变异"..战斗单位[#战斗单位].模型
  战斗单位[#战斗单位].主动技能={"失心符"}
  战斗单位[#战斗单位].伤害=1
  战斗单位[#战斗单位].法防=0
  战斗单位[#战斗单位].速度=等级
  战斗单位[#战斗单位].气血=战斗单位[#战斗单位].气血*10
  return 战斗单位
end
function 战斗准备类:取官职巡逻信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
 for n=1,2 do
      战斗单位[n]={
名称="突厥奸细"
,模型="强盗"
,伤害=等级*6
,气血=等级*15
,灵力=等级*2
,速度=等级*1
,防御=等级*0.5
,法防=10
,躲闪=等级*2
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(1)
}
   end
 return 战斗单位
 end
function 战斗准备类:取门派巡逻信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
 for n=1,2 do
    local 模型=取随机怪(1,等级)
      战斗单位[n]={
名称="捣乱的"..模型[2]
,模型=模型[2]
,伤害=等级*5
,气血=等级*等级*0.65
,灵力=等级*1
,速度=等级*1.5
,防御=等级*4
,法防=等级
,躲闪=等级*2
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(1)
}
   end
 战斗单位[2].名称=战斗单位[2].模型.."帮凶"
 return 战斗单位
end

function 战斗准备类:取青龙巡逻信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
 for n=1,2 do
    local 模型=取随机怪(1,等级)
      战斗单位[n]={
名称="捣乱的"..模型[2]
,模型=模型[2]
,伤害=等级*5
,气血=等级*等级*0.65
,灵力=等级*1
,速度=等级*1.5
,防御=等级*4
,法防=等级
,躲闪=等级*2
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(1)
}
   end
 战斗单位[2].名称=战斗单位[2].模型.."帮凶"
 return 战斗单位
end

function 战斗准备类:取玄武巡逻信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
 for n=1,2 do
    local 模型=取随机怪(1,等级)
      战斗单位[n]={
名称="捣乱的"..模型[2]
,模型=模型[2]
,伤害=等级*5
,气血=等级*等级*0.65
,灵力=等级*1
,速度=等级*1.5
,防御=等级*4
,法防=等级
,躲闪=等级*2
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(1)
}
   end
 战斗单位[2].名称=战斗单位[2].模型.."帮凶"
 return 战斗单位
end

function 战斗准备类:取官职流氓信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
 for n=1,2 do
      战斗单位[n]={
名称="流氓"
,模型="赌徒"
,伤害=等级*6
,气血=等级*30
,灵力=等级*2
,速度=等级*1.5
,防御=等级*0.5
,法防=10
,躲闪=等级*2
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
   end
 战斗单位[2].名称="流氓同伙"
 return 战斗单位
 end
function 战斗准备类:取三界悬赏令信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 local 数量=2+取队伍人数(玩家id)
 for n=1,8 do
       local 模型=取随机怪(1,120)
      战斗单位[n]={
名称="帮凶"
,模型=模型[2]
,伤害=等级*12
,气血=等级*等级*3
,灵力=等级*4
,速度=等级*3.5
,防御=等级*3
,法防=等级*1.2
,躲闪=等级*2
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(4)
}
   end
 战斗单位[1]={
名称="通缉犯"
,模型="强盗"
,伤害=等级*15
,气血=等级*等级*6
,灵力=等级*6
,速度=等级*4.5
,防御=等级*3
,法防=等级*1.2
,躲闪=等级*2
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 return 战斗单位
 end

function 战斗准备类:取游泳水妖信息(任务id,玩家id)
 local 战斗单位={}
 local 模型范围={"蟹将","虾兵","大海龟","海毛虫","巨蛙","海星","章鱼","小龙女","蛟龙","龟丞相"}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
 local 数量=2+取队伍人数(玩家id)
 for n=1,数量 do
      local 模型=模型范围[取随机数(1,#模型范围)]
      战斗单位[n]={
名称="捣乱的水妖"
,模型=模型
,伤害=等级*10
,气血=等级*等级
,灵力=等级*2
,速度=等级*1.5
,防御=等级*0.8
,法防=等级*0.2
,躲闪=等级*2
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
   end
 return 战斗单位
 end
function 战斗准备类:取镖王信息1(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 local 数量=10
 local 难度=任务数据[任务id].难度
 local 血量加成=1
 local 伤害加成=1
 local 灵力加成=1
 local 防御加成=1
 local 速度加成=1
 local 法防加成=1
 if 难度=="高级" then
     血量加成=2
     伤害加成=1.5
     灵力加成=1.5
     防御加成=1.5
     速度加成=1.5
     法防加成=1.5
  elseif 难度=="珍贵" then
    血量加成=4
    伤害加成=2
    灵力加成=2
    防御加成=2
    速度加成=2
    法防加成=2
  end
 for n=1,数量 do
      local 随机技能="高级必杀"
      local 模型="鬼将"
      if 取随机数()<=50 then
         随机技能="高级连击"
         模型="幽灵"
         end
      战斗单位[n]={
名称="劫匪"
,模型=模型
,伤害=等级*7*伤害加成
,气血=等级*等级*0.65*血量加成
,灵力=等级*2*灵力加成
,速度=等级*1.5*速度加成
,防御=等级*0.8*防御加成
,法防=等级*0.2*法防加成
,躲闪=等级*2
,魔法=200
,等级=等级
,技能={随机技能}
,主动技能={}
}
   end
 return 战斗单位
 end
function 战斗准备类:取镖王信息2(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 local 数量=10
 local 难度=任务数据[任务id].难度
 local 血量加成=1
 local 伤害加成=1
 local 灵力加成=1
 local 防御加成=1
 local 速度加成=1
 local 法防加成=1
 if 难度=="高级" then
     血量加成=2
     伤害加成=1.5
     灵力加成=1.5
     防御加成=1.5
     速度加成=1.5
     法防加成=1.5
 elseif 难度=="珍贵" then
    血量加成=4
    伤害加成=2
    灵力加成=2
    防御加成=2
    速度加成=2
    法防加成=2
   end
 for n=1,数量 do
      local 随机技能={"三昧真火","烈火"}
      local 模型="炎魔神"
      local 被动技能={"高级法术暴击"}
      if 取随机数()<=20 then
        随机技能={"龙卷雨击","龙吟"}
        模型="混沌兽"
        被动技能={"高级法术连击"}
      elseif 取随机数()<=50 then
        随机技能={"唧唧歪歪","落雷符"}
        模型="灵符女娲"
        被动技能={"高级法术波动"}
      elseif 取随机数()<=70 then
       随机技能={"水攻","落岩","雷击","烈火"}
       被动技能={"高级法术波动"}
        end
      战斗单位[n]={
名称="劫匪"
,模型=模型
,伤害=等级*7*伤害加成
,气血=等级*等级*0.65*血量加成
,灵力=等级*2*灵力加成
,速度=等级*1.5*速度加成
,防御=等级*0.8*防御加成
,法防=等级*0.2*法防加成
,躲闪=等级*2
,魔法=200
,等级=等级
,技能=被动技能
,主动技能=随机技能
}
   end
 return 战斗单位
 end
function 战斗准备类:取镖王信息3(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 local 数量=8
 local 难度=任务数据[任务id].难度
 local 血量加成=1
 local 伤害加成=1
 local 灵力加成=1
 local 防御加成=1
 local 速度加成=1
 local 法防加成=1
  if 难度=="高级" then
     血量加成=2
     伤害加成=1.5
     灵力加成=1.5
     防御加成=1.5
     速度加成=1.5
     法防加成=1.5
  elseif 难度=="珍贵" then
    血量加成=4
    伤害加成=2
    灵力加成=2
    防御加成=2
    速度加成=2
    法防加成=2
  end
 for n=1,数量 do
      战斗单位[n]={
名称="劫匪"
,模型="雾中仙"
,伤害=等级*8*伤害加成
,气血=等级*等级*0.45*血量加成
,灵力=等级*2*灵力加成
,速度=等级*1.5*速度加成
,防御=等级*0.8*防御加成
,法防=等级*0.2*法防加成
,躲闪=等级*2
,魔法=200
,等级=等级
,技能={"高级隐身"}
,主动技能={}
}
   end
 return 战斗单位
 end
function 战斗准备类:取镖王信息4(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 local 数量=8
 local 难度=任务数据[任务id].难度
 local 血量加成=1
 local 伤害加成=1
 local 灵力加成=1
 local 防御加成=1
 local 速度加成=1
 local 法防加成=1
 if 难度=="高级" then
     血量加成=2
     伤害加成=1.5
     灵力加成=1.5
     防御加成=1.5
     速度加成=1.5
     法防加成=1.5
  elseif 难度=="珍贵" then
    血量加成=4
    伤害加成=2
    灵力加成=2
    防御加成=2
    速度加成=2
    法防加成=2
  end
 for n=1,数量 do
   local 模型="曼珠沙华"
   local 主动技能=取随机法术(3)
   if 数量>4 then
      模型="修罗傀儡妖"
      主动技能={"烟雨剑法"}
     end
      战斗单位[n]={
名称="劫匪"
,模型=模型
,伤害=等级*8*伤害加成
,气血=等级*等级*0.65*血量加成
,灵力=等级*2*灵力加成
,速度=等级*1.5*速度加成
,防御=等级*0.8*防御加成
,法防=等级*0.2*法防加成
,躲闪=等级*2
,魔法=200
,等级=等级
,技能={"高级鬼魂术"}
,主动技能=主动技能
}
   end
 return 战斗单位
 end
function 战斗准备类:取镖王信息5(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 local 数量=3
 local 难度=任务数据[任务id].难度
 local 血量加成=1
 local 伤害加成=1
 local 灵力加成=1
 local 防御加成=1
 local 速度加成=1
 local 法防加成=1
 if 难度=="高级" then
     血量加成=2
     伤害加成=1.5
     灵力加成=1.5
     防御加成=1.5
     速度加成=1.5
     法防加成=1.5
  elseif 难度=="珍贵" then
    血量加成=4
    伤害加成=2
    灵力加成=2
    防御加成=2
    速度加成=2
    法防加成=2
  end
 for n=1,数量 do
   local 模型="蜃气妖"
   local 主动技能={"横扫千军"}
   if n==2 then
      模型="长眉灵猴"
      主动技能={"龙卷雨击"}
   elseif  n==3 then
      模型="狂豹人形"
      主动技能={"烟雨剑法"}
     end
   战斗单位[n]={
名称="劫匪"
,模型=模型
,伤害=等级*12*伤害加成
,气血=等级*等级*5*血量加成
,灵力=等级*7*灵力加成
,速度=等级*2.5*速度加成
,防御=等级*12.8*防御加成
,法防=等级*0.7*法防加成
,躲闪=等级*2
,魔法=200
,等级=等级
,技能={"高级神佑复生"}
,主动技能=主动技能
}
   end
 return 战斗单位
 end
function 战斗准备类:取镖王信息6(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 local 数量=10
 local 难度=任务数据[任务id].难度
 local 血量加成=1
 local 伤害加成=1
 local 灵力加成=1
 local 防御加成=1
 local 速度加成=1
 local 法防加成=1
 if 难度=="高级" then
     血量加成=2
     伤害加成=1.5
     灵力加成=1.5
     防御加成=1.5
     速度加成=1.5
     法防加成=1.5
  elseif 难度=="珍贵" then
    血量加成=4
    伤害加成=2
    灵力加成=2
    防御加成=2
    速度加成=2
    法防加成=2
  end
 for n=1,数量 do
   local 模型=取随机怪(40,120)
      战斗单位[n]={
名称="劫匪"
,模型=模型[2]
,伤害=等级*8*伤害加成
,气血=等级*等级*0.65*血量加成
,灵力=等级*2*灵力加成
,速度=等级*1.5*速度加成
,防御=等级*0.8*防御加成
,法防=等级*0.2*法防加成
,躲闪=等级*2
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
   end
 return 战斗单位
 end
function 战斗准备类:取妖魔鬼怪信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+10
 local 技能={"鬼魂术"}
 if 任务数据[任务id].名称=="妖魔" then
     技能={"神佑复生"}
   end
  战斗单位[1]={
名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*8
,气血=等级*等级+(等级*50)
,灵力=等级*3
,速度=等级*3
,防御=等级*2
,法防=等级*0.7
,躲闪=等级*4
,魔法=200
,等级=等级
,技能=技能
,主动技能=取随机法术(5)
}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
 for n=1,7 do
      local 模型=取随机怪(任务数据[任务id].等级,任务数据[任务id].等级)
      战斗单位[n+1]={
名称=模型[2].."喽啰"
,模型=模型[2]
,伤害=等级*7
,气血=等级*等级*0.65+(等级*20)
,灵力=等级*2.5
,速度=等级*1.5
,防御=等级*0.8
,法防=等级*0.2
,躲闪=等级*2
,魔法=200
,等级=等级
,技能=技能
,主动技能=取随机法术(5)
}
   end
 return 战斗单位
 end

function 战斗准备类:取副本三妖信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+10
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型="地狱战神"
,伤害=等级*9
,气血=等级*100
,灵力=等级*4
,速度=等级*1.5
,防御=等级*3
,法防=等级*0.7
,躲闪=100
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 等级=等级-5
  战斗单位[2]={
 名称="妖怪守卫"
,模型="兔子怪"
,伤害=等级*10
,气血=等级*60
,灵力=等级*2
,速度=等级*2.5
,防御=等级*3
,法防=0
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级连击"}
,主动技能={}
}
 战斗单位[3]={
 名称="妖怪守卫"
,模型="兔子怪"
,伤害=等级*10
,气血=等级*60
,灵力=等级*2
,速度=等级*2.5
,防御=等级*3
,法防=0
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级连击"}
,主动技能={}
}
  战斗单位[4]={
 名称="妖怪士兵"
,模型="牛头"
,伤害=等级*7
,气血=等级*40
,灵力=等级*3
,速度=等级*1.5
,防御=等级*2
,法防=0
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(2)
}
  战斗单位[5]={
 名称="妖怪士兵"
,模型="牛头"
,伤害=等级*7
,气血=等级*40
,灵力=等级*3
,速度=等级*1.5
,防御=等级*2
,法防=0
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(2)
}
战斗单位[6]={
 名称="妖怪士兵"
,模型="牛头"
,伤害=等级*7
,气血=等级*40
,灵力=等级*3
,速度=等级*1.5
,防御=等级*2
,法防=0
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(2)
}
 战斗单位[7]={
 名称="妖怪士兵"
,模型="牛头"
,伤害=等级*7
,气血=等级*40
,灵力=等级*3
,速度=等级*1.5
,防御=等级*2
,法防=0
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(2)
}
 战斗单位[8]={
 名称="妖怪士兵"
,模型="牛头"
,伤害=等级*7
,气血=等级*40
,灵力=等级*3
,速度=等级*1.5
,防御=等级*2
,法防=0
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(2)
}
  return 战斗单位
 end
function 战斗准备类:取副本国王信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+20
  战斗单位[1]={
 名称="乌鸡国王"
,模型="大力金刚"
,伤害=等级*12
,气血=等级*200
,灵力=等级*5
,速度=等级*2
,防御=等级*3
,法防=等级*0.7
,躲闪=100
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
 等级=等级
  战斗单位[2]={
 名称="侍从"
,模型="蛤蟆精"
,伤害=等级*9
,气血=等级*100
,灵力=等级*5
,速度=等级*1.5
,防御=等级*3
,法防=0
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
   战斗单位[3]={
 名称="侍从"
,模型="蛤蟆精"
,伤害=等级*9
,气血=等级*100
,灵力=等级*5
,速度=等级*1.5
,防御=等级*3
,法防=0
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
   战斗单位[4]={
 名称="侍从"
,模型="蛤蟆精"
,伤害=等级*9
,气血=等级*100
,灵力=等级*5
,速度=等级*1.5
,防御=等级*3
,法防=0
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[5]={
 名称="侍从"
,模型="蛤蟆精"
,伤害=等级*9
,气血=等级*100
,灵力=等级*5
,速度=等级*1.5
,防御=等级*3
,法防=0
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[6]={
 名称="侍女"
,模型="狐狸精"
,伤害=等级*11
,气血=等级*100
,灵力=等级*3
,速度=等级*1.5
,防御=等级*3
,法防=0
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[7]={
 名称="侍女"
,模型="狐狸精"
,伤害=等级*11
,气血=等级*100
,灵力=等级*3
,速度=等级*1.5
,防御=等级*3
,法防=0
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[8]={
 名称="侍女"
,模型="狐狸精"
,伤害=等级*11
,气血=等级*100
,灵力=等级*3
,速度=等级*1.5
,防御=等级*3
,法防=0
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[9]={
 名称="侍女"
,模型="狐狸精"
,伤害=等级*11
,气血=等级*100
,灵力=等级*3
,速度=等级*1.5
,防御=等级*3
,法防=0
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  return 战斗单位
 end
function 战斗准备类:取副本芭蕉妖怪信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
 for n=1,8 do
      战斗单位[n]={
名称="伙伴木妖"
,模型="树怪"
,伤害=等级*5
,气血=等级*20
,灵力=等级*2
,速度=等级*1
,防御=等级*0.8
,法防=等级*0.2
,躲闪=等级*2
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(2)
}
   end
战斗单位[1].名称="芭蕉木妖"
战斗单位[1].变异=true
 return 战斗单位
 end
function 战斗准备类:取迷宫小怪信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+10
 local 技能={}
  战斗单位[1]={
名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*6
,气血=等级*30
,灵力=等级*2
,速度=等级*1.5
,防御=等级*2
,法防=等级*0.7
,躲闪=等级*4
,魔法=200
,等级=等级
,技能=技能
,主动技能=取随机法术(3)
}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
 local 数量=取队伍人数(玩家id)*2+1
 if 数量>7 then 数量=7 end
 for n=1,数量 do
      local 模型=取随机怪(任务数据[任务id].等级,任务数据[任务id].等级)
      战斗单位[n+1]={
名称="迷宫小怪"
,模型=模型[2]
,伤害=等级*5
,气血=等级*20
,灵力=等级*2
,速度=等级*1
,防御=等级*0.8
,法防=等级*0.2
,躲闪=等级*2
,魔法=200
,等级=等级
,技能=技能
,主动技能=取随机法术(2)
}
   end
 return 战斗单位
 end
function 战斗准备类:取副本鬼祟小怪信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
 for n=1,5 do
      local 模型=取随机怪(10,20)
      战斗单位[n]={
名称="鬼祟小怪"
,模型=模型[2]
,伤害=等级*5
,气血=等级*20
,灵力=等级*2
,速度=等级*1
,防御=等级*0.8
,法防=等级*0.2
,躲闪=等级*2
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能={}
}
   end
 战斗单位[1].模型=任务数据[任务id].模型
 return 战斗单位
 end
function 战斗准备类:取捉鬼任务信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家id)+10
 local 血量加成=1
 local 法伤减少=1
 local 物伤减少=1
 local 躲避减少=0
 if 任务数据[任务id].模型=="马面" then
      法伤减少=0.35
    elseif 任务数据[任务id].模型=="牛头" then
      物伤减少=0.35
    elseif 任务数据[任务id].模型=="野鬼" then
      物伤减少=0.2
      法伤减少=0.2
      血量加成=0.2
    elseif 任务数据[任务id].模型=="骷髅怪" then
      躲避减少=95
      血量加成=0.7
    elseif 任务数据[任务id].模型=="僵尸" then
      血量加成=3
   end
  战斗单位[1]={
名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*6
,气血=(等级*等级)*血量加成
,灵力=等级*2
,速度=等级*2
,防御=等级*4
,法防=等级*1
,躲闪=等级*4
,躲避减少=躲避减少
,物伤减少=物伤减少
,法伤减少=法伤减少
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(2)
}
 local 数量=取随机数(5,8)
 local 等级=取队伍平均等级(玩家id)+2
 for n=1,数量 do
      local 模型=取随机怪(任务数据[任务id].等级,任务数据[任务id].等级)
      战斗单位[n+1]={
名称=模型[2].."恶鬼"
,模型=模型[2]
,伤害=等级*5
,气血=等级*等级*0.65+(等级*20)
,灵力=等级*2
,速度=等级*1
,防御=等级*2
,法防=等级*0.2
,躲闪=等级*2
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(2)
}
   end
 if 取随机数()<=2 then
      战斗单位[#战斗单位]={
名称="善良的"..任务数据[任务id].模型
,模型=任务数据[任务id].模型
,伤害=1
,气血=等级*等级*0.65+(等级*20)
,灵力=等级*2
,速度=等级*3
,防御=等级*2
,法防=等级*0.2
,躲闪=等级*2
,魔法=200
,等级=等级
,变异=true
,捉鬼变异=true
,技能={"高级感知"}
,主动技能={}
}
   end
 return 战斗单位
 end
function 战斗准备类:取宝图强盗信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级+5
  战斗单位[1]={
名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*5
,气血=等级*30
,灵力=等级*5
,速度=等级*3
,防御=等级*2
,法防=等级*0.5
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能={}
}
  return 战斗单位
 end
function 战斗准备类:取妖王鬼将(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+15
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*10+500
,气血=等级*800
,灵力=等级*6+500
,速度=等级*3.5
,防御=等级*0.5
,法防=等级*3
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(11,15)]]
}
  战斗单位[2]={
 名称="幽冥鬼卒"
,模型="吸血鬼"
,伤害=等级*8+300
,气血=等级*600
,灵力=等级*4+300
,速度=等级*2.5
,防御=等级*3
,法防=等级*0.8
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(11,15)]]
}
 战斗单位[3]={
 名称="幽冥鬼卒"
,模型="幽灵"
,伤害=等级*8+300
,气血=等级*600
,灵力=等级*4+300
,速度=等级*2.5
,防御=等级*3
,法防=等级*0.8
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(11,15)]]
}
  战斗单位[4]={
 名称="幽冥鬼卒"
,模型="吸血鬼"
,伤害=等级*8+300
,气血=等级*600
,灵力=等级*4+300
,速度=等级*2.5
,防御=等级*3
,法防=等级*0.8
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(11,15)]]
}
 战斗单位[5]={
 名称="幽冥鬼卒"
,模型="幽灵"
,伤害=等级*8+300
,气血=等级*600
,灵力=等级*4+300
,速度=等级*2.5
,防御=等级*3
,法防=等级*0.8
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(11,15)]]
}
  战斗单位[6]={
 名称="幽冥鬼卒"
,模型="吸血鬼"
,伤害=等级*8+300
,气血=等级*600
,灵力=等级*4+300
,速度=等级*2.5
,防御=等级*3
,法防=等级*0.8
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(11,15)]]
}
 战斗单位[7]={
 名称="幽冥鬼卒"
,模型="幽灵"
,伤害=等级*8+300
,气血=等级*600
,灵力=等级*4+300
,速度=等级*2.5
,防御=等级*3
,法防=等级*0.8
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(11,15)]]
}
 战斗单位[8]={
 名称="狸"
,模型="花妖"
,变异=true
,伤害=等级*5+500
,气血=等级*800
,灵力=等级*2+300
,速度=等级*8
,防御=等级*0
,法防=等级*0
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能={"含情脉脉"}
}
  return 战斗单位
end

function 战斗准备类:取地煞信息(任务id,玩家id)
  local 战斗单位={}
  local 伤害系数=1
  local 等级=任务数据[任务id].等级
  if 任务数据[任务id].名称 == "初出茅庐地煞星" then
      伤害系数 = 1
  elseif 任务数据[任务id].名称 == "小有所成地煞星" then
      伤害系数 = 1.4
  elseif 任务数据[任务id].名称 == "伏虎斩妖地煞星" then
      伤害系数 = 1.6
  elseif 任务数据[任务id].名称 == "御风神行地煞星" then
      伤害系数 = 1.8
  elseif 任务数据[任务id].名称 == "履水吐焰地煞星" then
      伤害系数 = 2
  end
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,武器=取武器数据(任务数据[任务id].武器,任务数据[任务id].武器等级)
,角色=true
,伤害=等级*12*伤害系数+800
,气血=等级*等级*5*伤害系数+45000
,灵力=等级*8*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*5*伤害系数
,法防=等级*5*伤害系数
,躲闪=等级*6*伤害系数
,魔法=等级*6*伤害系数
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="铁血无双"
,模型="律法女娲"
,伤害=等级*10*伤害系数+800
,气血=等级*等级*4*伤害系数+30000
,灵力=等级*3*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*4*伤害系数
,法防=等级*2*伤害系数
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级感知"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
 战斗单位[3]={
 名称="铁血无双"
,模型="幽灵"
,伤害=等级*10*伤害系数+800
,气血=等级*等级*4*伤害系数+30000
,灵力=等级*3*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*4*伤害系数
,法防=等级*2*伤害系数
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级感知"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
  战斗单位[4]={
 名称="玄法无边"
,模型="灵符女娲"
,伤害=等级*5*伤害系数
,气血=等级*等级*4*伤害系数+30000
,灵力=等级*8*伤害系数+300
,速度=等级*1.5*伤害系数
,防御=等级*2*伤害系数
,法防=等级*4*伤害系数
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"三昧真火","地狱烈火","飞砂走石"}
}
     战斗单位[5]={
 名称="玄法无边"
,模型="灵鹤"
,伤害=等级*5*伤害系数
,气血=等级*等级*4*伤害系数+30000
,灵力=等级*8*伤害系数+300
,速度=等级*1.5*伤害系数
,防御=等级*2*伤害系数
,法防=等级*4*伤害系数
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"龙卷雨击","龙腾","龙吟","二龙戏珠"}
}
战斗单位[6]={
 名称="玄法无边"
,模型="炎魔神"
,伤害=等级*5*伤害系数
,气血=等级*等级*4*伤害系数+30000
,灵力=等级*8*伤害系数+300
,速度=等级*1.5*伤害系数
,防御=等级*2*伤害系数
,法防=等级*4*伤害系数
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"落叶萧萧","雷击","奔雷咒"}
}
 战斗单位[7]={
 名称="神封无量"
,模型="鼠先锋"
,伤害=等级*5*伤害系数
,气血=等级*等级*4*伤害系数+20000
,灵力=等级*8*伤害系数
,速度=等级*5*伤害系数
,防御=等级*3*伤害系数
,法防=等级*4*伤害系数
,躲闪=等级*5*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
 战斗单位[8]={
 名称="神封无量"
,模型="雾中仙"
,伤害=等级*5*伤害系数
,气血=等级*等级*4*伤害系数+20000
,灵力=等级*8*伤害系数
,速度=等级*5*伤害系数
,防御=等级*3*伤害系数
,法防=等级*4*伤害系数
,躲闪=等级*5*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
 战斗单位[9]={
 名称="长生无界"
,模型="龙龟"
,伤害=等级*5*伤害系数
,气血=等级*等级*8*伤害系数+20000
,灵力=等级*8*伤害系数
,速度=等级*2.5*伤害系数
,防御=等级*8*伤害系数
,法防=等级*6*伤害系数
,躲闪=等级*8*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级神佑复生"}
,愤怒=99999
,主动技能={"推气过宫","金刚护体","普渡众生","金刚护法","晶清诀","罗汉金钟","四海升平"}
}
 战斗单位[10]={
 名称="乾坤无行"
,模型="吸血鬼"
,伤害=等级*12*伤害系数+1000
,气血=等级*等级*4*伤害系数+20000
,灵力=等级*4*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*4*伤害系数
,法防=等级*3*伤害系数
,躲闪=等级*5*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级隐身","高级神佑复生"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
  return 战斗单位
end

function 战斗准备类:取变强就点我(任务id,玩家id)
  local 战斗单位={}
  local 伤害系数=1
  local 等级=任务数据[任务id].等级
  if 等级<=80 then
      伤害系数 = 1.2
  elseif 等级<=100 then
      伤害系数 = 1.4
  elseif 等级<=120 then
      伤害系数 = 1.6
  elseif 等级<=140 then
      伤害系数 = 1.8
  else
      伤害系数 = 2
  end
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,武器=取武器数据(任务数据[任务id].武器,任务数据[任务id].武器等级)
,角色=true
,伤害=等级*12*伤害系数+800
,气血=等级*等级*5*伤害系数+45000
,灵力=等级*8*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*5*伤害系数
,法防=等级*5*伤害系数
,躲闪=等级*6*伤害系数
,魔法=等级*6*伤害系数
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="我最强"
,模型="毗舍童子"
,伤害=等级*10*伤害系数+800
,气血=等级*等级*4*伤害系数+30000
,灵力=等级*3*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*4*伤害系数
,法防=等级*2*伤害系数
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级隐身"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
 战斗单位[3]={
 名称="我最强"
,模型="大力金刚"
,伤害=等级*10*伤害系数+800
,气血=等级*等级*4*伤害系数+30000
,灵力=等级*3*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*4*伤害系数
,法防=等级*2*伤害系数
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级隐身"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
  战斗单位[4]={
 名称="我最强"
,模型="大力金刚"
,伤害=等级*5*伤害系数
,气血=等级*等级*4*伤害系数+30000
,灵力=等级*8*伤害系数+300
,速度=等级*1.5*伤害系数
,防御=等级*2*伤害系数
,法防=等级*4*伤害系数
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"三昧真火","地狱烈火","飞砂走石"}
}
     战斗单位[5]={
 名称="我最强"
,模型="毗舍童子"
,伤害=等级*5*伤害系数
,气血=等级*等级*4*伤害系数+30000
,灵力=等级*8*伤害系数+300
,速度=等级*1.5*伤害系数
,防御=等级*2*伤害系数
,法防=等级*4*伤害系数
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"龙卷雨击","龙腾","龙吟","二龙戏珠"}
}
战斗单位[6]={
 名称="强中强"
,模型="炎魔神"
,伤害=等级*5*伤害系数
,气血=等级*等级*4*伤害系数+30000
,灵力=等级*8*伤害系数+300
,速度=等级*1.5*伤害系数
,防御=等级*2*伤害系数
,法防=等级*4*伤害系数
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"落叶萧萧","雷击","奔雷咒"}
}
 战斗单位[7]={
 名称="遇强则强"
,模型="雾中仙"
,伤害=等级*5*伤害系数
,气血=等级*等级*4*伤害系数+20000
,灵力=等级*8*伤害系数
,速度=等级*5*伤害系数
,防御=等级*3*伤害系数
,法防=等级*4*伤害系数
,躲闪=等级*5*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
 战斗单位[8]={
 名称="遇强则强"
,模型="雾中仙"
,伤害=等级*5*伤害系数
,气血=等级*等级*4*伤害系数+20000
,灵力=等级*8*伤害系数
,速度=等级*5*伤害系数
,防御=等级*3*伤害系数
,法防=等级*4*伤害系数
,躲闪=等级*5*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
 战斗单位[9]={
 名称="遇强则强"
,模型="龙龟"
,伤害=等级*5*伤害系数
,气血=等级*等级*8*伤害系数+20000
,灵力=等级*8*伤害系数
,速度=等级*2.5*伤害系数
,防御=等级*8*伤害系数
,法防=等级*6*伤害系数
,躲闪=等级*8*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级神佑复生"}
,愤怒=99999
,主动技能={"推气过宫","金刚护体","普渡众生","金刚护法","晶清诀","罗汉金钟","四海升平"}
}
 战斗单位[10]={
 名称="强中强"
,模型="吸血鬼"
,伤害=等级*12*伤害系数+1000
,气血=等级*等级*4*伤害系数+20000
,灵力=等级*4*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*4*伤害系数
,法防=等级*3*伤害系数
,躲闪=等级*5*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级神佑复生"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
  return 战斗单位
end

function 战斗准备类:取地煞信息1(任务id,玩家id)
  local 战斗单位={}
  local 伤害系数=1
  local 等级=任务数据[任务id].等级
  if 任务数据[任务id].名称 == "初出茅庐地煞星" then
      伤害系数 = 1
  elseif 任务数据[任务id].名称 == "小有所成地煞星" then
      伤害系数 = 1.4
  elseif 任务数据[任务id].名称 == "伏虎斩妖地煞星" then
      伤害系数 = 1.6
  elseif 任务数据[任务id].名称 == "御风神行地煞星" then
      伤害系数 = 1.8
  elseif 任务数据[任务id].名称 == "履水吐焰地煞星" then
      伤害系数 = 2
  end
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,武器=取武器数据(任务数据[任务id].武器,任务数据[任务id].武器等级)
,角色=true
,伤害=等级*12*伤害系数+800
,气血=等级*等级*4*伤害系数
,灵力=等级*6*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*5*伤害系数
,法防=等级*2*伤害系数
,躲闪=等级*6*伤害系数
,魔法=等级*6*伤害系数
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="铁血无双"
,模型="律法女娲"
,伤害=等级*10*伤害系数+500
,气血=等级*等级*2*伤害系数
,灵力=等级*3*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*4*伤害系数
,法防=等级*1*伤害系数
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级感知"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
 战斗单位[3]={
 名称="铁血无双"
,模型="幽灵"
,伤害=等级*10*伤害系数+500
,气血=等级*等级*2*伤害系数
,灵力=等级*3*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*4*伤害系数
,法防=等级*1*伤害系数
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级感知"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
  战斗单位[4]={
 名称="玄法无边"
,模型="灵符女娲"
,伤害=等级*5*伤害系数
,气血=等级*等级*2*伤害系数
,灵力=等级*6*伤害系数
,速度=等级*1.5*伤害系数
,防御=等级*2*伤害系数
,法防=等级*3*伤害系数
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"三昧真火","地狱烈火","飞砂走石"}
}
     战斗单位[5]={
 名称="玄法无边"
,模型="灵鹤"
,伤害=等级*5*伤害系数
,气血=等级*等级*2*伤害系数
,灵力=等级*6*伤害系数
,速度=等级*1.5*伤害系数
,防御=等级*2*伤害系数
,法防=等级*3*伤害系数
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"龙卷雨击","龙腾","龙吟","二龙戏珠"}
}
战斗单位[6]={
 名称="玄法无边"
,模型="炎魔神"
,伤害=等级*5*伤害系数
,气血=等级*等级*2*伤害系数
,灵力=等级*6*伤害系数
,速度=等级*1.5*伤害系数
,防御=等级*2*伤害系数
,法防=等级*3*伤害系数
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"落叶萧萧","雷击","奔雷咒"}
}
 战斗单位[7]={
 名称="神封无量"
,模型="鼠先锋"
,伤害=等级*5*伤害系数
,气血=等级*等级*2*伤害系数
,灵力=等级*4*伤害系数
,速度=等级*5*伤害系数
,防御=等级*4*伤害系数
,法防=等级*2*伤害系数
,躲闪=等级*5*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
 战斗单位[8]={
 名称="神封无量"
,模型="雾中仙"
,伤害=等级*5*伤害系数
,气血=等级*等级*2*伤害系数
,灵力=等级*4*伤害系数
,速度=等级*5*伤害系数
,防御=等级*4*伤害系数
,法防=等级*2*伤害系数
,躲闪=等级*5*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
 战斗单位[9]={
 名称="长生无界"
,模型="龙龟"
,伤害=等级*5*伤害系数
,气血=等级*等级*6*伤害系数
,灵力=等级*4*伤害系数
,速度=等级*2.5*伤害系数
,防御=等级*8*伤害系数
,法防=等级*1*伤害系数
,躲闪=等级*5*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级神佑复生"}
,愤怒=99999
,主动技能={"推气过宫","金刚护体","普渡众生","金刚护法","晶清诀","罗汉金钟","四海升平"}
}
 战斗单位[10]={
 名称="乾坤无行"
,模型="吸血鬼"
,伤害=等级*12*伤害系数+800
,气血=等级*等级*2*伤害系数
,灵力=等级*4*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*4*伤害系数
,法防=等级*1*伤害系数
,躲闪=等级*5*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级隐身","高级神佑复生"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
  return 战斗单位
end

function 战斗准备类:取天罡星信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=任务数据[任务id].等级
  战斗单位[1]={
     名称=任务数据[任务id].名称
    ,模型=任务数据[任务id].模型
    ,武器=取武器数据(任务数据[任务id].武器,任务数据[任务id].武器等级)
    ,角色=true
    ,伤害=等级*20+1000
    ,气血=等级*等级*10+200000
    ,灵力=等级*15
    ,速度=等级*5
    ,防御=等级*10
    ,法防=等级*8
    ,躲闪=等级*10
    ,魔法=等级*10
    ,愤怒=99999
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能=取随机法术(5)
  }
  for i=2,3 do
    local 造型=Q_随机模型[取随机数(1,#Q_随机模型)]
    local 武器造型=取天罡星武器造型(造型)
    战斗单位[i]={
      名称=Q_天罡星名称[取随机数(1,#Q_天罡星名称)]
      ,模型=造型
      ,角色=true
      ,武器=取武器数据(武器造型.武器,武器造型.级别)
      ,伤害=等级*20+800
      ,气血=等级*等级*8+150000
      ,灵力=等级*5
      ,速度=等级*3
      ,防御=等级*3
      ,法防=0
      ,愤怒=99999
      ,躲闪=等级*4
      ,魔法=2000
      ,等级=等级
      ,技能={"高级神佑复生"}
      ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}
    }
  end
  for i=4,5 do
    local 造型=Q_随机模型[取随机数(1,#Q_随机模型)]
    local 武器造型=取天罡星武器造型(造型)
    战斗单位[i]={
      名称=Q_天罡星名称[取随机数(1,#Q_天罡星名称)]
      ,模型=造型
      ,角色=true
      ,武器=取武器数据(武器造型.武器,武器造型.级别)
      ,伤害=等级*12
      ,气血=等级*等级*8+150000
      ,灵力=等级*15+500
      ,速度=等级*2.3
      ,防御=等级*3
      ,愤怒=99999
      ,法防=等级*15
      ,躲闪=等级*4
      ,魔法=2000
      ,等级=等级
      ,技能={"高级神佑复生"}
      ,主动技能={"落叶萧萧","三昧真火","飞砂走石","八凶法阵","上古灵符","龙卷雨击","龙吟"}
    }
  end
  for i=6,7 do
    local 造型=Q_随机模型[取随机数(1,#Q_随机模型)]
    local 武器造型=取天罡星武器造型(造型)
    战斗单位[i]={
      名称=Q_天罡星名称[取随机数(1,#Q_天罡星名称)]
      ,模型=造型
      ,角色=true
      ,武器=取武器数据(武器造型.武器,武器造型.级别)
      ,伤害=等级*12
      ,气血=等级*等级*8+150000
      ,灵力=等级*15+300
      ,速度=等级*7
      ,防御=等级*3
      ,愤怒=99999
      ,法防=等级*10
      ,躲闪=等级*4
      ,魔法=2000
      ,等级=等级
      ,技能={"高级神佑复生"}
      ,主动技能={"失心符","催眠符","定身符","落雷符","反间之计","晶清诀"}
    }
  end
  for i=8,9 do
    local 造型=Q_随机模型[取随机数(1,#Q_随机模型)]
    local 武器造型=取天罡星武器造型(造型)
    战斗单位[i]={
      名称=Q_天罡星名称[取随机数(1,#Q_天罡星名称)]
      ,模型=造型
      ,角色=true
      ,武器=取武器数据(武器造型.武器,武器造型.级别)
      ,伤害=等级*12
      ,气血=等级*等级*15+250000
      ,灵力=等级*10
      ,速度=等级*1.3
      ,防御=等级*10
      ,愤怒=99999
      ,法防=等级*10
      ,躲闪=等级*10
      ,魔法=2000
      ,等级=等级
      ,技能={"高级神佑复生"}
      ,主动技能={"推气过宫","四海升平","晶清诀","罗汉金钟"}
    }
  end
  for i=10,10 do
    local 造型=Q_随机模型[取随机数(1,#Q_随机模型)]
    local 武器造型=取天罡星武器造型(造型)
    战斗单位[i]={
      名称=Q_天罡星名称[取随机数(1,#Q_天罡星名称)]
      ,模型=造型
      ,角色=true
      ,武器=取武器数据(武器造型.武器,武器造型.级别)
      ,伤害=等级*12*2+500
      ,气血=等级*等级*8+150000
      ,灵力=等级*5
      ,速度=等级*2.3
      ,防御=等级*5
      ,法防=0
      ,愤怒=99999
      ,躲闪=等级*4
      ,魔法=2000
      ,等级=等级
      ,技能={"高级神佑复生"}
      ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}
    }
  end
  return 战斗单位
end

function 战斗准备类:取最强王者信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
   名称=任务数据[任务id].名称
  ,模型=任务数据[任务id].模型
  ,伤害=等级*20+800
  ,气血=等级*等级*10+200000
  ,灵力=等级*15
  ,速度=等级*5
  ,防御=等级*10
  ,法防=等级*8
  ,躲闪=等级*10
  ,魔法=等级*110
  ,等级=等级
  ,技能={"高级神佑复生"}
  ,主动技能=取随机法术(5)
  }
  for i=2,10 do
    战斗单位[i]={
   名称="最强王者"
  ,模型="毗舍童子"
  ,伤害=等级*20+200
  ,气血=等级*等级*10+100000
  ,灵力=等级*13
  ,速度=等级*5
  ,防御=等级*10
  ,法防=等级*8
  ,躲闪=等级*10
  ,魔法=等级*110
  ,等级=等级
  ,技能={"高级神佑复生"}
  ,主动技能=取随机法术(5)
  }
  end
  return 战斗单位
end

function 战斗准备类:取知了王信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*18+1000
,气血=等级*等级*8+35000
,灵力=等级*15
,速度=等级*4
,防御=等级*7
,法防=等级*7
,躲闪=等级*6
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="诡秘千疑"
,模型="幽灵"
,变异=true
,伤害=等级*18+800
,气血=等级*等级*6+30000
,灵力=等级*10
,速度=等级*5
,防御=等级*6
,法防=等级*3
,躲闪=等级*5
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
 战斗单位[3]={
 名称="诡秘千疑"
,模型="幽灵"
,变异=true
,伤害=等级*18+800
,气血=等级*等级*6+30000
,灵力=等级*10
,速度=等级*5
,防御=等级*6
,法防=等级*4
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
  战斗单位[4]={
 名称="诡秘千疑"
,模型="幽灵"
,伤害=等级*10+800
,气血=等级*等级*6+30000
,灵力=等级*15
,速度=等级*2
,防御=等级*3
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能=Q_门派法术["魔王寨"]
}
  战斗单位[5]={
 名称="诡秘千疑"
,模型="幽灵"
,伤害=等级*10+800
,气血=等级*等级*6+30000
,灵力=等级*15
,速度=等级*2
,防御=等级*3
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能=Q_门派法术["龙宫"]
}
  战斗单位[6]={
 名称="喽啰"
,模型="野猪精"
,伤害=等级*10+800
,气血=等级*等级*5+15000
,灵力=等级*10
,速度=等级*3
,防御=等级*4
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="喽啰"
,模型="野猪精"
,伤害=等级*12+800
,气血=等级*等级*5+15000
,灵力=等级*10
,速度=等级*3
,防御=等级*4
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="喽啰"
,模型="野猪精"
,伤害=等级*12+800
,气血=等级*等级*5+15000
,灵力=等级*10
,速度=等级*3
,防御=等级*4
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[9]={
 名称="喽啰"
,模型="野猪精"
,伤害=等级*16+800
,气血=等级*等级*5+15000
,灵力=等级*10
,速度=等级*3
,防御=等级*4
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[10]={
 名称="喽啰"
,模型="野猪精"
,伤害=等级*16+800
,气血=等级*等级*5+15000
,灵力=等级*10
,速度=等级*3
,防御=等级*4
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  return 战斗单位
 end

function 战斗准备类:取知了先锋信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*18+500
,气血=等级*等级*4+15000
,灵力=等级*15
,速度=等级*2
,防御=等级*6
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="先锋军师"
,模型="进阶锦毛貂精"
,变异=true
,伤害=等级*18+300
,气血=等级*等级*2+10000
,灵力=等级*8
,速度=等级*5
,防御=等级*5
,法防=等级*3
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
 战斗单位[3]={
 名称="先锋军师"
,模型="进阶锦毛貂精"
,变异=true
,伤害=等级*18+30
,气血=等级*等级*2+10000
,灵力=等级*8
,速度=等级*5
,防御=等级*5
,法防=等级*3
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
  战斗单位[4]={
 名称="先锋小队长"
,模型="进阶野猪精"
,伤害=等级*8
,气血=等级*等级*2+10000
,灵力=等级*15
,速度=等级*2
,防御=等级*3
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级魔之心"}
,主动技能=Q_门派法术["魔王寨"]
}
  战斗单位[5]={
 名称="先锋小队长"
,模型="进阶野猪精"
,伤害=等级*8
,气血=等级*等级*2+10000
,灵力=等级*15
,速度=等级*2
,防御=等级*3
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级魔之心"}
,主动技能=Q_门派法术["龙宫"]
}
  战斗单位[6]={
 名称="喽啰"
,模型="百足将军"
,伤害=等级*12+300
,气血=等级*等级*2+10000
,灵力=等级*8
,速度=等级*4
,防御=等级*5
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="喽啰"
,模型="百足将军"
,伤害=等级*12+300
,气血=等级*等级*2+10000
,灵力=等级*8
,速度=等级*4
,防御=等级*5
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="喽啰"
,模型="百足将军"
,伤害=等级*12+300
,气血=等级*等级*2+10000
,灵力=等级*8
,速度=等级*4
,防御=等级*5
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[9]={
 名称="喽啰"
,模型="百足将军"
,伤害=等级*12+300
,气血=等级*等级*2+10000
,灵力=等级*8
,速度=等级*4
,防御=等级*5
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[10]={
 名称="喽啰"
,模型="百足将军"
,伤害=等级*12+300
,气血=等级*等级*2
,灵力=等级*8
,速度=等级*4
,防御=等级*5
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  return 战斗单位
 end

 function 战斗准备类:取神秘钥匙怪信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,变异=true
,伤害=等级*18+500
,气血=等级*等级*4+15000
,灵力=等级*15
,速度=等级*2
,防御=等级*6
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="小喽啰"
,模型="毗舍童子"
,伤害=等级*18+300
,气血=等级*等级*2+10000
,灵力=等级*8
,速度=等级*5
,防御=等级*5
,法防=等级*3
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}

  战斗单位[3]={
 名称="小喽啰"
,模型="毗舍童子"
,伤害=等级*8
,气血=等级*等级*2+10000
,灵力=等级*15
,速度=等级*2
,防御=等级*3
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级魔之心"}
,主动技能=Q_门派法术["龙宫"]
}

  return 战斗单位
 end

 function 战斗准备类:取永恒钻石信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*18+500
,气血=等级*等级*4
,灵力=等级*6
,变异=true
,速度=等级*2
,防御=等级*5
,法防=等级*4
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="钻石高中生"
,模型="鬼将"
,变异=true
,伤害=等级*18+300
,气血=等级*等级*2
,灵力=等级*2
,速度=等级*5
,防御=等级*5
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
 战斗单位[3]={
 名称="钻石高中生"
,模型="鬼将"
,变异=true
,伤害=等级*18+30
,气血=等级*等级*2
,灵力=等级*2
,速度=等级*5
,防御=等级*5
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
  战斗单位[4]={
 名称="钻石高中生"
,模型="鬼将"
,伤害=等级*8
,气血=等级*等级*2
,灵力=等级*6
,速度=等级*2
,防御=等级*6
,法防=等级*3
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级魔之心"}
,主动技能=Q_门派法术["魔王寨"]
}
  战斗单位[5]={
 名称="钻石高中生"
,模型="鬼将"
,伤害=等级*8
,气血=等级*等级*2
,灵力=等级*6
,速度=等级*2
,防御=等级*6
,法防=等级*3
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级魔之心"}
,主动技能=Q_门派法术["龙宫"]
}
  战斗单位[6]={
 名称="钻石高中生"
,模型="鬼将"
,伤害=等级*12+300
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*4
,防御=等级*10
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="钻石高中生"
,模型="鬼将"
,伤害=等级*12+300
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*4
,防御=等级*10
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="钻石高中生"
,模型="鬼将"
,伤害=等级*12+300
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*4
,防御=等级*10
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[9]={
 名称="钻石高中生"
,模型="鬼将"
,伤害=等级*12+300
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*4
,防御=等级*10
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[10]={
 名称="钻石高中生"
,模型="鬼将"
,伤害=等级*12+300
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*4
,防御=等级*10
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  return 战斗单位
 end

function 战斗准备类:取至尊星耀信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*21+800
,气血=等级*等级*15
,灵力=等级*12
,速度=等级*5
,防御=等级*10
,法防=等级*5
,躲闪=等级*7
,变异=true
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="星耀大学生"
,模型="大力金刚"
,变异=true
,伤害=等级*20+500
,气血=等级*等级*8
,灵力=等级*6
,速度=等级*5
,防御=等级*8
,法防=等级*1
,躲闪=等级*5
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
 战斗单位[3]={
 名称="星耀大学生"
,模型="大力金刚"
,变异=true
,伤害=等级*20+500
,气血=等级*等级*8
,灵力=等级*5
,速度=等级*5
,防御=等级*8
,法防=等级*1
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
  战斗单位[4]={
 名称="星耀大学生"
,模型="大力金刚"
,伤害=等级*15
,气血=等级*等级*8
,灵力=等级*10
,速度=等级*3
,防御=等级*7
,法防=等级*3
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能=Q_门派法术["魔王寨"]
}
  战斗单位[5]={
 名称="星耀大学生"
,模型="大力金刚"
,伤害=等级*12
,气血=等级*等级*8
,灵力=等级*8
,速度=等级*2
,防御=等级*6
,法防=等级*3
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能=Q_门派法术["龙宫"]
}
  战斗单位[6]={
 名称="星耀大学生"
,模型="大力金刚"
,伤害=等级*15+500
,气血=等级*等级*5
,灵力=等级*12
,速度=等级*5
,防御=等级*8
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="星耀大学生"
,模型="大力金刚"
,伤害=等级*15+500
,气血=等级*等级*5
,灵力=等级*9
,速度=等级*3
,防御=等级*10
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="星耀大学生"
,模型="大力金刚"
,伤害=等级*15+500
,气血=等级*等级*5
,灵力=等级*8
,速度=等级*3
,防御=等级*10
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[9]={
 名称="星耀大学生"
,模型="大力金刚"
,伤害=等级*15+500
,气血=等级*等级*5
,灵力=等级*10
,速度=等级*3
,防御=等级*8
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[10]={
 名称="星耀大学生"
,模型="大力金刚"
,伤害=等级*15+500
,气血=等级*等级*5
,灵力=等级*10
,速度=等级*5
,防御=等级*8
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  return 战斗单位
 end

function 战斗准备类:取梦幻粉信息(任务id,玩家id)
  local 难度 = 1
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*18*难度+500
,气血=等级*等级*6*难度
,灵力=等级*8*难度
,速度=等级*4*难度
,防御=等级*8*难度
,法防=等级*4*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="梦幻粉丝"
,模型="进阶葫芦宝贝"
,变异=true
,伤害=等级*18*难度+350
,气血=等级*等级*4*难度
,灵力=等级*3*难度
,速度=等级*5*难度
,防御=等级*8*难度
,法防=等级*2*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
 战斗单位[3]={
 名称="梦幻粉丝"
,模型="进阶葫芦宝贝"
,变异=true
,伤害=等级*18*难度+350
,气血=等级*等级*4*难度
,灵力=等级*3*难度
,速度=等级*5*难度
,防御=等级*8*难度
,法防=等级*2*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
  战斗单位[4]={
 名称="梦粉"
,模型="葫芦宝贝"
,伤害=等级*12*难度
,气血=等级*等级*4*难度
,灵力=等级*8*难度
,速度=等级*2*难度
,防御=等级*6*难度
,法防=等级*3*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级魔之心","高级法术连击"}
,主动技能=Q_门派法术["魔王寨"]
}
  战斗单位[5]={
 名称="梦粉"
,模型="葫芦宝贝"
,伤害=等级*12*难度
,气血=等级*等级*4*难度
,灵力=等级*8*难度
,速度=等级*2*难度
,防御=等级*6*难度
,法防=等级*3*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级魔之心","高级法术连击"}
,主动技能=Q_门派法术["龙宫"]
}
  战斗单位[6]={
 名称="梦粉"
,模型="葫芦宝贝"
,伤害=等级*15*难度+350
,气血=等级*等级*4*难度
,灵力=等级*6*难度
,速度=等级*4*难度
,防御=等级*8*难度
,法防=等级*2*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="梦粉"
,模型="葫芦宝贝"
,伤害=等级*15*难度+350
,气血=等级*等级*4*难度
,灵力=等级*6*难度
,速度=等级*4*难度
,防御=等级*8*难度
,法防=等级*2*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="梦粉"
,模型="葫芦宝贝"
,伤害=等级*15*难度+350
,气血=等级*等级*4*难度
,灵力=等级*6*难度
,速度=等级*4*难度
,防御=等级*8*难度
,法防=等级*2*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[9]={
 名称="梦粉"
,模型="葫芦宝贝"
,伤害=等级*15*难度+350
,气血=等级*等级*4*难度
,灵力=等级*6*难度
,速度=等级*4*难度
,防御=等级*8*难度
,法防=等级*2*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[10]={
 名称="梦粉"
,模型="葫芦宝贝"
,伤害=等级*15*难度+350
,气血=等级*等级*4*难度
,灵力=等级*6*难度
,速度=等级*4*难度
,防御=等级*8*难度
,法防=等级*2*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  return 战斗单位


end

function 战斗准备类:取子鼠信息(任务id,玩家id)
  local 难度 = 1
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
 名称="子鼠"
,模型="进阶鼠先锋"
,伤害=等级*18*难度+500
,气血=等级*等级*6*难度
,灵力=等级*8*难度
,速度=等级*4*难度
,防御=等级*8*难度
,法防=等级*4*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="生肖护法"
,模型="鼠先锋"
,变异=true
,伤害=等级*18*难度+350
,气血=等级*等级*4*难度
,灵力=等级*3*难度
,速度=等级*5*难度
,防御=等级*8*难度
,法防=等级*2*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
 战斗单位[3]={
 名称="生肖护法"
,模型="鼠先锋"
,变异=true
,伤害=等级*18*难度+350
,气血=等级*等级*4*难度
,灵力=等级*3*难度
,速度=等级*5*难度
,防御=等级*8*难度
,法防=等级*2*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[4]={
 名称="生肖侍卫"
,模型="鼠先锋"
,伤害=等级*12*难度
,气血=等级*等级*4*难度
,灵力=等级*8*难度
,速度=等级*2*难度
,防御=等级*6*难度
,法防=等级*3*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级魔之心","高级法术连击"}
,主动技能=取随机法术(3)
}
  战斗单位[5]={
 名称="生肖侍卫"
,模型="鼠先锋"
,伤害=等级*12*难度
,气血=等级*等级*4*难度
,灵力=等级*8*难度
,速度=等级*2*难度
,防御=等级*6*难度
,法防=等级*3*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级魔之心","高级法术连击"}
,主动技能=取随机法术(3)
}
  战斗单位[6]={
 名称="生肖侍卫"
,模型="鼠先锋"
,伤害=等级*15*难度+350
,气血=等级*等级*4*难度
,灵力=等级*6*难度
,速度=等级*4*难度
,防御=等级*8*难度
,法防=等级*2*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="生肖侍卫"
,模型="鼠先锋"
,伤害=等级*15*难度+350
,气血=等级*等级*4*难度
,灵力=等级*6*难度
,速度=等级*4*难度
,防御=等级*8*难度
,法防=等级*2*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="生肖侍卫"
,模型="鼠先锋"
,伤害=等级*15*难度+350
,气血=等级*等级*4*难度
,灵力=等级*6*难度
,速度=等级*4*难度
,防御=等级*8*难度
,法防=等级*2*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[9]={
 名称="生肖侍卫"
,模型="鼠先锋"
,伤害=等级*15*难度+350
,气血=等级*等级*4*难度
,灵力=等级*6*难度
,速度=等级*4*难度
,防御=等级*8*难度
,法防=等级*2*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[10]={
 名称="生肖侍卫"
,模型="鼠先锋"
,伤害=等级*15*难度+350
,气血=等级*等级*4*难度
,灵力=等级*6*难度
,速度=等级*4*难度
,防御=等级*8*难度
,法防=等级*2*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  return 战斗单位
end

function 战斗准备类:取丑牛信息(任务id,玩家id)
  local 难度 = 1
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+10
  战斗单位[1]={
 名称="丑牛"
,模型="进阶超级神牛"
,伤害=等级*18*难度+500
,气血=等级*等级*6*难度
,灵力=等级*8*难度
,速度=等级*4*难度
,防御=等级*13*难度
,法防=等级*8*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="生肖护法"
,模型="超级神牛"
,变异=true
,伤害=等级*18*难度+350
,气血=等级*等级*4*难度
,灵力=等级*3*难度
,速度=等级*5*难度
,防御=等级*13*难度
,法防=等级*8*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
 战斗单位[3]={
 名称="生肖护法"
,模型="超级神牛"
,变异=true
,伤害=等级*18*难度+350
,气血=等级*等级*4*难度
,灵力=等级*3*难度
,速度=等级*5*难度
,防御=等级*13*难度
,法防=等级*8*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[4]={
 名称="生肖侍卫"
,模型="超级神牛"
,伤害=等级*12*难度
,气血=等级*等级*4*难度
,灵力=等级*8*难度
,速度=等级*2*难度
,防御=等级*12*难度
,法防=等级*6*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级魔之心","高级法术连击"}
,主动技能=取随机法术(3)
}
  战斗单位[5]={
 名称="生肖侍卫"
,模型="超级神牛"
,伤害=等级*12*难度
,气血=等级*等级*4*难度
,灵力=等级*8*难度
,速度=等级*2*难度
,防御=等级*12*难度
,法防=等级*6*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级魔之心","高级法术连击"}
,主动技能=取随机法术(3)
}
  战斗单位[6]={
 名称="生肖侍卫"
,模型="超级神牛"
,伤害=等级*15*难度+350
,气血=等级*等级*4*难度
,灵力=等级*6*难度
,速度=等级*4*难度
,防御=等级*12*难度
,法防=等级*6*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="生肖侍卫"
,模型="超级神牛"
,伤害=等级*15*难度+350
,气血=等级*等级*4*难度
,灵力=等级*6*难度
,速度=等级*4*难度
,防御=等级*12*难度
,法防=等级*6*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="生肖侍卫"
,模型="超级神牛"
,伤害=等级*15*难度+350
,气血=等级*等级*4*难度
,灵力=等级*6*难度
,速度=等级*4*难度
,防御=等级*12*难度
,法防=等级*6*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[9]={
 名称="生肖侍卫"
,模型="超级神牛"
,伤害=等级*15*难度+350
,气血=等级*等级*4*难度
,灵力=等级*6*难度
,速度=等级*4*难度
,防御=等级*12*难度
,法防=等级*6*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[10]={
 名称="生肖侍卫"
,模型="超级神牛"
,伤害=等级*15*难度+350
,气血=等级*等级*4*难度
,灵力=等级*6*难度
,速度=等级*4*难度
,防御=等级*12*难度
,法防=等级*6*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  return 战斗单位
end

function 战斗准备类:取寅虎信息(任务id,玩家id)
  local 难度 = 1
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+15
  战斗单位[1]={
 名称="寅虎"
,模型="进阶超级神虎"
,伤害=等级*18*难度+500
,气血=等级*等级*6*难度
,灵力=等级*8*难度
,速度=等级*4*难度
,防御=等级*13*难度
,法防=等级*8*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="生肖护法"
,模型="超级神虎"
,变异=true
,伤害=等级*18*难度+350
,气血=等级*等级*4*难度
,灵力=等级*3*难度
,速度=等级*5*难度
,防御=等级*13*难度
,法防=等级*8*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
 战斗单位[3]={
 名称="生肖护法"
,模型="超级神虎"
,变异=true
,伤害=等级*18*难度+350
,气血=等级*等级*4*难度
,灵力=等级*3*难度
,速度=等级*5*难度
,防御=等级*13*难度
,法防=等级*8*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[4]={
 名称="生肖侍卫"
,模型="超级神虎"
,伤害=等级*12*难度
,气血=等级*等级*4*难度
,灵力=等级*8*难度
,速度=等级*2*难度
,防御=等级*12*难度
,法防=等级*6*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级魔之心","高级法术连击"}
,主动技能=取随机法术(3)
}
  战斗单位[5]={
 名称="生肖侍卫"
,模型="超级神虎"
,伤害=等级*12*难度
,气血=等级*等级*4*难度
,灵力=等级*8*难度
,速度=等级*2*难度
,防御=等级*12*难度
,法防=等级*6*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级魔之心","高级法术连击"}
,主动技能=取随机法术(3)
}
  战斗单位[6]={
 名称="生肖侍卫"
,模型="超级神虎"
,伤害=等级*15*难度+350
,气血=等级*等级*4*难度
,灵力=等级*6*难度
,速度=等级*4*难度
,防御=等级*12*难度
,法防=等级*6*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="生肖侍卫"
,模型="超级神虎"
,伤害=等级*15*难度+350
,气血=等级*等级*4*难度
,灵力=等级*6*难度
,速度=等级*4*难度
,防御=等级*12*难度
,法防=等级*6*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="生肖侍卫"
,模型="超级神虎"
,伤害=等级*15*难度+350
,气血=等级*等级*4*难度
,灵力=等级*6*难度
,速度=等级*4*难度
,防御=等级*12*难度
,法防=等级*6*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[9]={
 名称="生肖侍卫"
,模型="超级神虎"
,伤害=等级*15*难度+350
,气血=等级*等级*4*难度
,灵力=等级*6*难度
,速度=等级*4*难度
,防御=等级*12*难度
,法防=等级*6*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[10]={
 名称="生肖侍卫"
,模型="超级神虎"
,伤害=等级*15*难度+350
,气血=等级*等级*4*难度
,灵力=等级*6*难度
,速度=等级*4*难度
,防御=等级*12*难度
,法防=等级*6*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  return 战斗单位
end

function 战斗准备类:取卯兔信息(任务id,玩家id)
  local 难度 = 1
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+20
  战斗单位[1]={
 名称="卯兔"
,模型="进阶超级神兔"
,伤害=等级*20*难度+500
,气血=等级*等级*10*难度
,灵力=等级*8*难度
,速度=等级*4*难度
,防御=等级*13*难度
,法防=等级*8*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="生肖护法"
,模型="超级神兔"
,变异=true
,伤害=等级*20*难度+350
,气血=等级*等级*7*难度
,灵力=等级*3*难度
,速度=等级*5*难度
,防御=等级*13*难度
,法防=等级*8*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
 战斗单位[3]={
 名称="生肖护法"
,模型="超级神兔"
,变异=true
,伤害=等级*20*难度+350
,气血=等级*等级*7*难度
,灵力=等级*3*难度
,速度=等级*5*难度
,防御=等级*13*难度
,法防=等级*8*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[4]={
 名称="生肖侍卫"
,模型="超级神兔"
,伤害=等级*15*难度
,气血=等级*等级*7*难度
,灵力=等级*8*难度
,速度=等级*2*难度
,防御=等级*18*难度
,法防=等级*6*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级魔之心","高级法术连击"}
,主动技能=取随机法术(3)
}
  战斗单位[5]={
 名称="生肖侍卫"
,模型="超级神兔"
,伤害=等级*12*难度
,气血=等级*等级*7*难度
,灵力=等级*15*难度
,速度=等级*2*难度
,防御=等级*12*难度
,法防=等级*6*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级魔之心","高级法术连击"}
,主动技能=取随机法术(3)
}
  战斗单位[6]={
 名称="生肖侍卫"
,模型="超级神兔"
,伤害=等级*20*难度+350
,气血=等级*等级*7*难度
,灵力=等级*15*难度
,速度=等级*4*难度
,防御=等级*12*难度
,法防=等级*6*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="生肖侍卫"
,模型="超级神兔"
,伤害=等级*20*难度+350
,气血=等级*等级*7*难度
,灵力=等级*15*难度
,速度=等级*4*难度
,防御=等级*12*难度
,法防=等级*6*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="生肖侍卫"
,模型="超级神兔"
,伤害=等级*20*难度+350
,气血=等级*等级*7*难度
,灵力=等级*15*难度
,速度=等级*4*难度
,防御=等级*12*难度
,法防=等级*6*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[9]={
 名称="生肖侍卫"
,模型="超级神兔"
,伤害=等级*20*难度+350
,气血=等级*等级*7*难度
,灵力=等级*15*难度
,速度=等级*4*难度
,防御=等级*12*难度
,法防=等级*6*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[10]={
 名称="生肖侍卫"
,模型="超级神兔"
,伤害=等级*20*难度+350
,气血=等级*等级*7*难度
,灵力=等级*15*难度
,速度=等级*4*难度
,防御=等级*12*难度
,法防=等级*6*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  return 战斗单位
end

function 战斗准备类:取小知了王信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*18+500
,气血=等级*等级*6+30000
,灵力=等级*15
,速度=等级*4
,防御=等级*8
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="知了军师"
,模型="进阶千年蛇魅"
,变异=true
,伤害=等级*18+350
,气血=等级*等级*4+20000
,灵力=等级*10
,速度=等级*5
,防御=等级*8
,法防=等级*4
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
 战斗单位[3]={
 名称="知了军师"
,模型="进阶千年蛇魅"
,变异=true
,伤害=等级*18+350
,气血=等级*等级*4+20000
,灵力=等级*10
,速度=等级*5
,防御=等级*8
,法防=等级*4
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
  战斗单位[4]={
 名称="知了大队长"
,模型="进阶鲛人"
,伤害=等级*12
,气血=等级*等级*4+20000
,灵力=等级*15
,速度=等级*2
,防御=等级*4
,法防=等级*8
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级魔之心","高级法术连击"}
,主动技能=Q_门派法术["魔王寨"]
}
  战斗单位[5]={
 名称="知了大队长"
,模型="进阶鲛人"
,伤害=等级*12
,气血=等级*等级*4+20000
,灵力=等级*15
,速度=等级*2
,防御=等级*4
,法防=等级*8
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级魔之心","高级法术连击"}
,主动技能=Q_门派法术["龙宫"]
}
  战斗单位[6]={
 名称="喽啰"
,模型="进阶碧水夜叉"
,伤害=等级*15+350
,气血=等级*等级*4+15000
,灵力=等级*10
,速度=等级*4
,防御=等级*4
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="喽啰"
,模型="进阶碧水夜叉"
,伤害=等级*15+350
,气血=等级*等级*4+15000
,灵力=等级*10
,速度=等级*4
,防御=等级*4
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="喽啰"
,模型="进阶碧水夜叉"
,伤害=等级*15+350
,气血=等级*等级*4+15000
,灵力=等级*10
,速度=等级*4
,防御=等级*4
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[9]={
 名称="喽啰"
,模型="进阶碧水夜叉"
,伤害=等级*15+350
,气血=等级*等级*4+15000
,灵力=等级*10
,速度=等级*4
,防御=等级*4
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[10]={
 名称="喽啰"
,模型="进阶碧水夜叉"
,伤害=等级*15+350
,气血=等级*等级*4+15000
,灵力=等级*10
,速度=等级*4
,防御=等级*4
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  return 战斗单位
 end

function 战斗准备类:取妖王炎魔神(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*10+500
,气血=等级*1000
,灵力=等级*6+500
,速度=等级*3.5
,防御=等级*8
,法防=0
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级反震","高级反击"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(1,5)]]
}
  战斗单位[2]={
 名称="上古魔灵"
,模型="黑山老妖"
,伤害=等级*8+300
,气血=等级*800
,灵力=等级*4+300
,速度=等级*2.5
,防御=等级*3
,法防=等级*0.8
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(1,5)]]
}
 战斗单位[3]={
 名称="上古魔灵"
,模型="地狱战神"
,伤害=等级*8+300
,气血=等级*800
,灵力=等级*4+300
,速度=等级*2.5
,防御=等级*3
,法防=等级*0.8
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(1,5)]]
}
  战斗单位[4]={
 名称="上古魔灵"
,模型="黑山老妖"
,伤害=等级*8+300
,气血=等级*800
,灵力=等级*4+300
,速度=等级*2.5
,防御=等级*3
,法防=等级*0.8
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(1,5)]]
}
 战斗单位[5]={
 名称="上古魔灵"
,模型="地狱战神"
,伤害=等级*8+300
,气血=等级*800
,灵力=等级*4+300
,速度=等级*2.5
,防御=等级*3
,法防=等级*0.8
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(1,5)]]
}
  战斗单位[6]={
 名称="上古魔灵"
,模型="黑山老妖"
,伤害=等级*8+300
,气血=等级*800
,灵力=等级*4+300
,速度=等级*2.5
,防御=等级*3
,法防=等级*0.8
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(1,5)]]
}
 战斗单位[7]={
 名称="上古魔灵"
,模型="地狱战神"
,伤害=等级*8+300
,气血=等级*800
,灵力=等级*4+300
,速度=等级*2.5
,防御=等级*3
,法防=等级*0.8
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(1,5)]]
}
 战斗单位[8]={
 名称="狐"
,模型="狐狸精"
,变异=true
,伤害=等级*5+300
,气血=等级*800
,灵力=等级*2
,速度=等级*4
,防御=等级*0
,法防=等级*0
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","似玉生香","反间之计"}
}
  return 战斗单位
 end
function 战斗准备类:取妖王净瓶女娲(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*10+700
,气血=等级*1500
,灵力=等级*6+600
,速度=等级*3.5
,防御=等级*5
,法防=0
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(6,10)]]
}
  战斗单位[2]={
 名称="九天妖兵"
,模型="灵符女娲"
,伤害=等级*8+500
,气血=等级*1200
,灵力=等级*4+300
,速度=等级*2.5
,防御=等级*3
,法防=等级*0.8
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(6,10)]]
}
战斗单位[3]={
 名称="九天妖兵"
,模型="噬天虎"
,伤害=等级*8+500
,气血=等级*1200
,灵力=等级*4+300
,速度=等级*2.5
,防御=等级*3
,法防=等级*0.8
,躲闪=等级*4
,魔法=200
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(6,10)]]
}
  战斗单位[4]={
 名称="九天妖兵"
,模型="灵符女娲"
,伤害=等级*8+500
,气血=等级*1200
,灵力=等级*4+300
,速度=等级*2.5
,防御=等级*3
,法防=等级*0.8
,躲闪=等级*4
,魔法=200
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(6,10)]]
}
战斗单位[5]={
 名称="九天妖兵"
,模型="灵符女娲"
,伤害=等级*8+500
,气血=等级*1200
,灵力=等级*4+300
,速度=等级*2.5
,防御=等级*3
,法防=等级*0.8
,躲闪=等级*4
,魔法=200
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(6,10)]]
}
  战斗单位[6]={
 名称="九天妖兵"
,模型="灵符女娲"
,伤害=等级*8+500
,气血=等级*1200
,灵力=等级*4+300
,速度=等级*2.5
,防御=等级*3
,法防=等级*0.8
,躲闪=等级*4
,魔法=200
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(6,10)]]
}
 战斗单位[7]={
 名称="九天妖兵"
,模型="灵符女娲"
,伤害=等级*8+500
,气血=等级*1200
,灵力=等级*4+300
,速度=等级*2.5
,防御=等级*3
,法防=等级*0.8
,躲闪=等级*4
,魔法=200
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(6,10)]]
}
 战斗单位[8]={
 名称="狸"
,模型="花妖"
,变异=true
,伤害=等级*5+500
,气血=等级*1300
,灵力=等级*2+500
,速度=等级*6
,防御=等级*0
,法防=等级*0
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能={"日月乾坤","反间之计"}
}
  return 战斗单位
 end
function 战斗准备类:取星宿任务信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+20
  战斗单位[1]={
名称=任务数据[任务id].名称
,模型="天兵"
,伤害=等级*12+500
,气血=等级*1000
,灵力=等级*7+500
,速度=等级*4.5
,防御=等级*4
,法防=等级*0.8
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  return 战斗单位
end

function 战斗准备类:取不屈将魂信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  local 难度 = 等级/60
  local 小怪 = {"进阶吸血鬼","进阶幽灵","牛头"}
  战斗单位[1]={
    名称=任务数据[任务id].名称
    ,模型="进阶鬼将"
    ,伤害=2000*难度
    ,气血=50000*难度
    ,灵力=0
    ,速度=1000*难度
    ,防御=0
    ,法防=0
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级鬼魂术","高级隐身"}
    ,主动技能={"满天花雨"}
  }
  for i=2,9 do
    战斗单位[i]={
    名称="将魂亲卫"
    ,模型=小怪[取随机数(1,3)]
    ,伤害=1300*难度
    ,气血=10000*难度
    ,灵力=0
    ,速度=1000*难度
    ,防御=0
    ,法防=0
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,物伤减少=0.35
    ,技能={"高级鬼魂术"}
    ,主动技能= 取随机物理法术(5)
  }
  end
  战斗单位[10]={
    名称="红颜知己"
    ,模型="进阶画魂"
    ,伤害=1300*难度
    ,气血=50000*难度
    ,灵力=0
    ,速度=0
    ,防御=0
    ,法防=0
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能={"反间之计"}
  }
  return 战斗单位
 end
function 战斗准备类:取魔化沙僧信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  local 难度 = 1
  local 小怪 = {"吸血鬼","鬼将","章鱼"}
  战斗单位[1]={
    名称=任务数据[任务id].名称
    ,模型="沙僧"
    ,伤害=3500*难度
    ,气血=500000*难度
    ,灵力=1500
    ,速度=1000*难度
    ,防御=1500
    ,法防=800
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级鬼魂术"}
    ,主动技能={"满天花雨","横扫千军","鹰击"}
  }
  for i=2,6 do
    战斗单位[i]={
    名称="魔道余孽"
    ,模型=小怪[取随机数(1,3)]
    ,伤害=3300*难度
    ,气血=200000*难度
    ,灵力=1500
    ,速度=1000*难度
    ,防御=1000
    ,法防=600
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}
  }
  end
  for i=7,9 do
    战斗单位[i]={
    名称="魔道余孽"
    ,模型=小怪[取随机数(1,3)]
    ,伤害=3300*难度
    ,气血=200000*难度
    ,灵力=1500
    ,速度=1000*难度
    ,防御=1000
    ,法防=600
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级连击","高级必杀"}
    ,主动技能={"力劈华山","壁垒击破"}
  }
  end
  战斗单位[10]={
    名称="魔道魔子"
    ,模型="毗舍童子"
    ,伤害=2300*难度
    ,气血=200000*难度
    ,灵力=1000
    ,速度=500
    ,防御=1000
    ,法防=1000
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能={"反间之计","失心符","定身符"}
  }
  return 战斗单位
 end



 function 战斗准备类:取魔化取经信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  local 难度 = 1
  local 小怪 = {"吸血鬼","鬼将","章鱼"}
  战斗单位[1]={
    名称=任务数据[任务id].名称
    ,模型="孙悟空"
    ,伤害=5500*难度
    ,气血=1000000*难度
    ,灵力=2500
    ,速度=1000*难度
    ,防御=2500
    ,法防=1500
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级鬼魂术","高级感知"}
    ,主动技能={"满天花雨","横扫千军","鹰击"}
  }
  战斗单位[2]={
    名称="魔化沙僧"
    ,模型="沙僧"
    ,伤害=5300*难度
    ,气血=200000*难度
    ,灵力=3500
    ,速度=1000*难度
    ,防御=1500
    ,法防=1000
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,物伤减少=0.35
    ,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
    ,主动技能={"水漫金山","八凶法阵","水攻","龙卷雨击","龙腾"}
  }
  战斗单位[6]={
    名称="魔化猪八戒"
    ,模型="猪八戒"
    ,伤害=5300*难度
    ,气血=200000*难度
    ,灵力=3500
    ,速度=1000*难度
    ,防御=1500
    ,法防=1000
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,物伤减少=0.35
    ,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
    ,主动技能={"水漫金山","八凶法阵","水攻","龙卷雨击","龙腾"}
  }
  for i=3,5 do
    战斗单位[i]={
    名称="魔道余孽"
    ,模型=小怪[取随机数(1,3)]
    ,伤害=5300*难度
    ,气血=200000*难度
    ,灵力=2500
    ,速度=1000*难度
    ,防御=1500
    ,法防=1000
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}
  }
  end
  for i=7,9 do
    战斗单位[i]={
    名称="魔道余孽"
    ,模型=小怪[取随机数(1,3)]
    ,伤害=5300*难度
    ,气血=200000*难度
    ,灵力=1500
    ,速度=1000*难度
    ,防御=1500
    ,法防=1000
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级连击","高级必杀"}
    ,主动技能={"力劈华山","壁垒击破"}
  }
  end
  战斗单位[10]={
    名称="魔道魔子"
    ,模型="毗舍童子"
    ,伤害=5300*难度
    ,气血=400000*难度
    ,灵力=2000
    ,速度=1000
    ,防御=2000
    ,法防=1500
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能={"反间之计","失心符","定身符"}
  }
  return 战斗单位
 end

 function 战斗准备类:取七十二地煞星信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+10
  local 难度 = 1 + 任务数据[任务id].难度/10
  local 小怪 = {"吸血鬼","鬼将","黑山老妖","幽灵","天兵","天将"}
  战斗单位[1]={
    名称=任务数据[任务id].名称
    ,模型=任务数据[任务id].模型
    ,伤害=2500*难度
    ,气血=300000*难度
    ,灵力=1500*难度
    ,速度=800*难度
    ,防御=1000*难度
    ,法防=800*难度
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级神迹","高级感知"}
    ,主动技能=取随机法术1(5)
  }
  for i=2,5 do
    战斗单位[i]={
    名称="地煞护卫"
    ,模型=小怪[取随机数(1,6)]
    ,伤害=1300*难度
    ,气血=200000*难度
    ,灵力=1800*难度
    ,速度=500*难度
    ,防御=1000*难度
    ,法防=500*难度
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生","高级魔之心","高级法术暴击"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}
  }
  end
  for i=6,9 do
    战斗单位[i]={
    名称="地煞护卫"
    ,模型=小怪[取随机数(1,6)]
    ,伤害=2300*难度
    ,气血=200000*难度
    ,灵力=800*难度
    ,速度=500*难度
    ,防御=1000*难度
    ,法防=800*难度
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生","高级连击","高级必杀"}
    ,主动技能=取随机物理法术(5)
  }
  end
  战斗单位[10]={
    名称="地煞星辰"
    ,模型="龙龟"
    ,伤害=2000*难度
    ,气血=300000*难度
    ,灵力=1000*难度
    ,速度=800*难度
    ,防御=1000*难度
    ,法防=500*难度
    ,变异=true
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级神迹"}
    ,主动技能={"反间之计","失心符","定身符","推气过宫","舍身取义"}
  }
  return 战斗单位
 end


function 战斗准备类:取科举闯关信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级+5
 for n=1,5 do
  战斗单位[n]={
名称="护卫"
,模型="护卫"
,伤害=等级*6
,气血=等级*30
,灵力=等级*3.5
,速度=等级*3
,防御=等级*2
,法防=等级*0.5
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能={}
}
 end
  return 战斗单位
 end
function 战斗准备类:取宝图遇怪信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级+10
  战斗单位[1]={
名称="远古魔王"
,模型="黑山老妖"
,伤害=等级*6
,气血=等级*30
,灵力=等级*3
,速度=等级*3
,防御=等级*4
,法防=等级*1
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能={}
}
if 取随机数()<=50 then
     战斗单位[1].模型="地狱战神"
   end
 local 等级=玩家数据[玩家id].角色.数据.等级-5
 local 临时信息=取等级怪(取随机数(1,80))
 local 临时模型=取敌人信息(临时信息[取随机数(1,#临时信息)])
  战斗单位[2]={
名称="喽啰"
,模型=临时模型[2]
,伤害=等级*4
,气血=等级*20
,灵力=等级*2
,速度=等级*1.5
,防御=等级*2
,法防=等级*0.3
,躲闪=等级*2
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能={}
}
  return 战斗单位
 end
function 战斗准备类:显示(x,y)
end
function 战斗准备类:天庭叛逆(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*7+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"持国巡守","毗舍童子","灵灯侍者","般若天女","真陀护法","增长巡守","金身罗汉","曼珠沙华","红萼仙子","琴仙","金饶僧","灵鹤","雾中仙","大力金刚","净瓶女娲","律法女娲","灵符女娲","如意仙子","巡游天神","星灵仙子","蛟龙","凤凰","雨师","天兵","风伯","龟丞相","小龙女"}--"宠物口粮",
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称="叛逆的"..模型,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取倔强青铜信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,变异=true,伤害=等级*7+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  for i=2,10 do
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称="青铜幼儿园",模型="海毛虫",显示饰品=true,伤害=等级*5+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取秩序白银信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,变异=true,伤害=等级*10+500,气血=等级*200,灵力=等级*7+300,速度=等级*3,防御=等级*5,法防=0,躲闪=等级*5,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  for i=2,10 do
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称="白银小学生",模型="牛头",显示饰品=true,伤害=等级*7+500,气血=等级*150,灵力=等级*6+300,速度=等级*3,防御=等级*4,法防=0,躲闪=等级*5,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取荣耀黄金信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,变异=true,伤害=等级*15+500,气血=等级*300,灵力=等级*15+300,速度=等级*4,防御=等级*7,法防=0,躲闪=等级*7,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  for i=2,10 do
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称="黄金初中生",模型="蛟龙",显示饰品=true,伤害=等级*11+500,气血=等级*250,灵力=等级*11+300,速度=等级*5,防御=等级*8,法防=0,躲闪=等级*8,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end


function 战斗准备类:捣乱的水果(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=任务数据[任务id].等级-2
  local 模型范围={"泡泡","超级泡泡","进阶超级泡泡"}
  local 模型名称范围={"腐烂的水果","火红的水果","金色的水果","发霉的水果","恶心的水果"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,取随机数(3,5) do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取大力神灵信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称="大力神灵",模型="天将",显示饰品=true,变异=true,伤害=等级*13+500,气血=等级*300,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-4
  local 模型范围={"天兵"}
  local 模型名称范围={"天兵"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*13+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取妖魔亲信信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称="妖魔亲信",模型="蝴蝶仙子",显示饰品=true,变异=true,伤害=等级*13+500,气血=等级*300,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-4
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  战斗单位[2]={名称="小喽啰",模型="蝴蝶仙子",显示饰品=true,伤害=等级*13+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  战斗单位[3]={名称="小喽啰",模型="蝴蝶仙子",显示饰品=true,伤害=等级*13+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  战斗单位[4]={名称="小喽啰",模型="黑熊精",显示饰品=true,伤害=等级*13+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  战斗单位[5]={名称="小喽啰",模型="蝴蝶仙子",显示饰品=true,伤害=等级*13+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  战斗单位[6]={名称="小喽啰",模型="黑山老妖",显示饰品=true,伤害=等级*13+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  战斗单位[7]={名称="小喽啰",模型="黑山老妖",显示饰品=true,伤害=等级*13+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  return 战斗单位
end

function 战斗准备类:取蜃妖元神信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称="蜃妖元神",模型="炎魔神",显示饰品=true,变异=true,伤害=等级*13+500,气血=等级*300,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-2
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  战斗单位[2]={名称="小妖",模型="地狱战神",显示饰品=true,伤害=等级*13+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  战斗单位[3]={名称="小妖",模型="地狱战神",显示饰品=true,伤害=等级*13+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  战斗单位[4]={名称="小妖",模型="蝴蝶仙子",显示饰品=true,伤害=等级*13+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  战斗单位[5]={名称="小妖",模型="黑熊精",显示饰品=true,伤害=等级*13+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  return 战斗单位
end

function 战斗准备类:取周猎户信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称="周猎户",模型="山贼",显示饰品=true,变异=true,伤害=等级*13+500,气血=等级*400,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-5
  local 模型范围={"山贼","强盗","赌徒"}
  local 模型名称范围={"帮手"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*13+500,气血=等级*200,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取冠状病毒(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*13+500,气血=等级*180,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"飞燕女泡泡","骨精灵泡泡","剑侠客泡泡","羽灵神泡泡"}--"宠物口粮",
  local 模型名称范围={"调皮的病毒","嚣张的病毒","胆小的病毒","强壮的病毒","捣乱的病毒"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*13+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取法宝战斗信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].人物,模型="山贼",显示饰品=true,变异=true,伤害=等级*13+500,气血=等级*300,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-5
  local 模型范围={"山贼","强盗","赌徒"}
  local 模型名称范围={"帮手"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*13+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取法宝内丹战斗信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=true,变异=true,伤害=等级*13+500,气血=等级*400,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-5
  local 模型范围={"吸血鬼","鬼将","噬天虎","灵鹤","幽灵","百足将军","犀牛将军人形","犀牛将军兽形"}
  local 模型名称范围={"帮手"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*13+500,气血=等级*200,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取横行霸道的土匪战斗信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=true,变异=true,伤害=等级*13+500,气血=等级*300,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-5
  local 模型范围={"强盗","山贼"}
  local 模型名称范围={"土匪喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,3 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*13+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取飞升心魔战斗信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,染色方案=任务数据[任务id].染色方案,染色组=任务数据[任务id].染色组,角色=true,武器=取武器数据(任务数据[任务id].武器,任务数据[任务id].武器等级),武器染色方案=任务数据[任务id].武器染色方案,武器染色组=任务数据[任务id].武器染色组,伤害=等级*13+500,气血=等级*400,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-5
  local 模型范围={任务数据[任务id].模型}
  local 模型名称范围={任务数据[任务id].名称}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,染色方案=任务数据[任务id].染色方案,染色组=任务数据[任务id].染色组,角色=true,武器=取武器数据(任务数据[任务id].武器,任务数据[任务id].武器等级),武器染色方案=任务数据[任务id].武器染色方案,武器染色组=任务数据[任务id].武器染色组,伤害=等级*13+500,气血=等级*200,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取飞升小妖战斗信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={名称="牛魔王小弟",模型="牛妖",伤害=等级*13+500,气血=等级*400,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-5
  local 模型范围={"牛妖"}
  local 模型名称范围={"牛魔王小弟"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*13+500,气血=等级*200,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取飞升小宝箱战斗信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={名称="不死壤守卫",模型="鬼将",变异=true,伤害=等级*13+500,气血=等级*400,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-5
  local 模型范围={"鬼将","吸血鬼","幽灵","画魂","幽萤娃娃"}
  local 模型名称范围={"不死壤护卫"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*13+500,气血=等级*200,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取飞升阵法1战斗信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
 名称="监兵"
,模型="天兵"
,伤害=等级*12+800
,气血=等级*等级*4
,灵力=等级*6
,速度=等级*3.5
,防御=等级*5
,法防=等级*2
,躲闪=等级*6
,魔法=等级*6
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="参"
,模型="天兵"
,伤害=等级*10+500
,气血=等级*等级*2
,灵力=等级*3
,速度=等级*3.5
,防御=等级*4
,法防=等级*1
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"横扫千军","善恶有报"}
}
 战斗单位[3]={
 名称="觜"
,模型="天兵"
,伤害=等级*10+500
,气血=等级*等级*2
,灵力=等级*3
,速度=等级*3.5
,防御=等级*4
,法防=等级*1
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
  战斗单位[4]={
 名称="毕"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*6
,速度=等级*1.5
,防御=等级*2
,法防=等级*3
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"三昧真火","地狱烈火","飞砂走石"}
}
     战斗单位[5]={
 名称="昴"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*6
,速度=等级*1.5
,防御=等级*2
,法防=等级*3
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"龙卷雨击","龙腾","龙吟","二龙戏珠"}
}
战斗单位[6]={
 名称="娄"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*6
,速度=等级*1.5
,防御=等级*2
,法防=等级*3
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"落叶萧萧","雷击","奔雷咒"}
}
 战斗单位[7]={
 名称="奎"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*5
,防御=等级*4
,法防=等级*2
,躲闪=等级*5
,魔法=等级*5
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
 战斗单位[8]={
 名称="胃"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*5
,防御=等级*4
,法防=等级*2
,躲闪=等级*5
,魔法=等级*5
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
  return 战斗单位
end

function 战斗准备类:取飞升阵法2战斗信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级+5
  战斗单位[1]={
 名称="孟章"
,模型="天兵"
,伤害=等级*12+800
,气血=等级*等级*4
,灵力=等级*6
,速度=等级*3.5
,防御=等级*5
,法防=等级*2
,躲闪=等级*6
,魔法=等级*6
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="箕"
,模型="天兵"
,伤害=等级*10+500
,气血=等级*等级*2
,灵力=等级*3
,速度=等级*3.5
,防御=等级*4
,法防=等级*1
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"横扫千军","善恶有报"}
}
 战斗单位[3]={
 名称="尾"
,模型="天兵"
,伤害=等级*10+500
,气血=等级*等级*2
,灵力=等级*3
,速度=等级*3.5
,防御=等级*4
,法防=等级*1
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
  战斗单位[4]={
 名称="心"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*6
,速度=等级*1.5
,防御=等级*2
,法防=等级*3
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"三昧真火","地狱烈火","飞砂走石"}
}
     战斗单位[5]={
 名称="房"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*6
,速度=等级*1.5
,防御=等级*2
,法防=等级*3
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"龙卷雨击","龙腾","龙吟","二龙戏珠"}
}
战斗单位[6]={
 名称="亢"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*6
,速度=等级*1.5
,防御=等级*2
,法防=等级*3
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"落叶萧萧","雷击","奔雷咒"}
}
 战斗单位[7]={
 名称="氐"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*5
,防御=等级*4
,法防=等级*2
,躲闪=等级*5
,魔法=等级*5
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
 战斗单位[8]={
 名称="角"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*5
,防御=等级*4
,法防=等级*2
,躲闪=等级*5
,魔法=等级*5
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
  return 战斗单位
end

function 战斗准备类:取飞升阵法3战斗信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
 名称="陵光"
,模型="天兵"
,伤害=等级*12+800
,气血=等级*等级*4
,灵力=等级*6
,速度=等级*3.5
,防御=等级*5
,法防=等级*2
,躲闪=等级*6
,魔法=等级*6
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="轸"
,模型="天兵"
,伤害=等级*10+500
,气血=等级*等级*2
,灵力=等级*3
,速度=等级*3.5
,防御=等级*4
,法防=等级*1
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"横扫千军","善恶有报"}
}
 战斗单位[3]={
 名称="翼"
,模型="天兵"
,伤害=等级*10+500
,气血=等级*等级*2
,灵力=等级*3
,速度=等级*3.5
,防御=等级*4
,法防=等级*1
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
  战斗单位[4]={
 名称="张"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*6
,速度=等级*1.5
,防御=等级*2
,法防=等级*3
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"三昧真火","地狱烈火","飞砂走石"}
}
     战斗单位[5]={
 名称="星"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*6
,速度=等级*1.5
,防御=等级*2
,法防=等级*3
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"龙卷雨击","龙腾","龙吟","二龙戏珠"}
}
战斗单位[6]={
 名称="柳"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*6
,速度=等级*1.5
,防御=等级*2
,法防=等级*3
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"落叶萧萧","雷击","奔雷咒"}
}
 战斗单位[7]={
 名称="鬼"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*5
,防御=等级*4
,法防=等级*2
,躲闪=等级*5
,魔法=等级*5
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
 战斗单位[8]={
 名称="井"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*5
,防御=等级*4
,法防=等级*2
,躲闪=等级*5
,魔法=等级*5
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
  return 战斗单位
end

function 战斗准备类:取飞升阵法4战斗信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级+5
  战斗单位[1]={
 名称="执明"
,模型="天兵"
,伤害=等级*12+800
,气血=等级*等级*4
,灵力=等级*6
,速度=等级*3.5
,防御=等级*5
,法防=等级*2
,躲闪=等级*6
,魔法=等级*6
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="壁"
,模型="天兵"
,伤害=等级*10+500
,气血=等级*等级*2
,灵力=等级*3
,速度=等级*3.5
,防御=等级*4
,法防=等级*1
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"横扫千军","善恶有报"}
}
 战斗单位[3]={
 名称="室"
,模型="天兵"
,伤害=等级*10+500
,气血=等级*等级*2
,灵力=等级*3
,速度=等级*3.5
,防御=等级*4
,法防=等级*1
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
  战斗单位[4]={
 名称="危"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*6
,速度=等级*1.5
,防御=等级*2
,法防=等级*3
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"三昧真火","地狱烈火","飞砂走石"}
}
     战斗单位[5]={
 名称="虚"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*6
,速度=等级*1.5
,防御=等级*2
,法防=等级*3
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"龙卷雨击","龙腾","龙吟","二龙戏珠"}
}
战斗单位[6]={
 名称="女"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*6
,速度=等级*1.5
,防御=等级*2
,法防=等级*3
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"落叶萧萧","雷击","奔雷咒"}
}
 战斗单位[7]={
 名称="牛"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*5
,防御=等级*4
,法防=等级*2
,躲闪=等级*5
,魔法=等级*5
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
 战斗单位[8]={
 名称="斗"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*5
,防御=等级*4
,法防=等级*2
,躲闪=等级*5
,魔法=等级*5
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
  return 战斗单位
end

function 战斗准备类:取飞升阵法5战斗信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级+10
  战斗单位[1]={
 名称="稷神"
,模型="天兵"
,伤害=等级*12+800
,气血=等级*等级*4
,灵力=等级*6
,速度=等级*3.5
,防御=等级*5
,法防=等级*2
,躲闪=等级*6
,魔法=等级*6
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="稷神"
,模型="天兵"
,伤害=等级*10+500
,气血=等级*等级*2
,灵力=等级*3
,速度=等级*3.5
,防御=等级*4
,法防=等级*1
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"横扫千军","善恶有报"}
}
 战斗单位[3]={
 名称="稷神"
,模型="天兵"
,伤害=等级*10+500
,气血=等级*等级*2
,灵力=等级*3
,速度=等级*3.5
,防御=等级*4
,法防=等级*1
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
  战斗单位[4]={
 名称="稷神"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*6
,速度=等级*1.5
,防御=等级*2
,法防=等级*3
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"三昧真火","地狱烈火","飞砂走石"}
}
     战斗单位[5]={
 名称="稷神"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*6
,速度=等级*1.5
,防御=等级*2
,法防=等级*3
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"龙卷雨击","龙腾","龙吟","二龙戏珠"}
}
战斗单位[6]={
 名称="稷神"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*6
,速度=等级*1.5
,防御=等级*2
,法防=等级*3
,躲闪=等级*4
,魔法=等级*4
,等级=等级
,技能={"高级感知"}
,主动技能={"落叶萧萧","雷击","奔雷咒"}
}
 战斗单位[7]={
 名称="社神"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*5
,防御=等级*4
,法防=等级*2
,躲闪=等级*5
,魔法=等级*5
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
 战斗单位[8]={
 名称="社神"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*5
,防御=等级*4
,法防=等级*2
,躲闪=等级*5
,魔法=等级*5
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
战斗单位[9]={
 名称="社神"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*5
,防御=等级*4
,法防=等级*2
,躲闪=等级*5
,魔法=等级*5
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
战斗单位[10]={
 名称="社神"
,模型="天兵"
,伤害=等级*5
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*5
,防御=等级*4
,法防=等级*2
,躲闪=等级*5
,魔法=等级*5
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
  return 战斗单位
end

function 战斗准备类:取生死劫信息1(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
     名称="罗成"
    ,模型="神天兵"
    ,武器=取武器数据("天龙破城",150)
    ,伤害=1900
    ,角色=true
    ,气血=50000
    ,灵力=800
    ,速度=450
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["大唐官府"]
  }

  战斗单位[2]={
     名称="张副将"
    ,模型="剑侠客"
    ,武器=取武器数据("业火三灾",150)
    ,伤害=2000
    ,角色=true
    ,气血=50000
    ,灵力=800
    ,速度=450
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["狮驼岭"]
  }

  战斗单位[3]={
     名称="李副将"
    ,模型="剑侠客"
    ,武器=取武器数据("霜冷九州",150)
    ,伤害=2000
    ,角色=true
    ,气血=50000
    ,灵力=800
    ,速度=450
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["狮驼岭"]
  }

  战斗单位[4]={
     名称="护驾亲兵"
    ,模型="逍遥生"
    ,武器=取武器数据("霜冷九州",150)
    ,伤害=2100
    ,角色=true
    ,气血=80000
    ,灵力=900
    ,速度=350
    ,防御=600
    ,法防=150
    ,躲闪=100
    ,魔法=200
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["化生寺"]
  }

  战斗单位[5]={
     名称="护驾亲兵"
    ,模型="逍遥生"
    ,武器=取武器数据("浩气长舒",150)
    ,伤害=2100
    ,角色=true
    ,气血=80000
    ,灵力=900
    ,速度=350
    ,防御=600
    ,法防=150
    ,躲闪=100
    ,魔法=200
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["化生寺"]
  }

  for n=6,10 do
    战斗单位[n]={
       名称="大唐骁勇"
      ,模型="护卫"
      ,变异=true
      ,伤害=1900
      ,气血=35000
      ,灵力=900
      ,速度=350
      ,防御=300
      ,法防=100
      ,躲闪=100
      ,魔法=200
      ,等级=等级-10
      ,技能={"高级感知"}
      ,主动技能=""
    }
  end
  return 战斗单位
end

function 战斗准备类:取生死劫信息2(任务id,玩家id)
  local 战斗单位={}
  local 等级=120
  战斗单位[1]={
     名称="红孩儿"
    ,模型="小魔头"
    ,伤害=1900
    ,气血=75000
    ,灵力=1100
    ,速度=450
    ,防御=700
    ,法防=550
    ,躲闪=100
    ,魔法=200
    ,等级=等级
    ,技能={"高级反震"}
    ,主动技能=Q_门派法术["魔王寨"]
  }

  战斗单位[2]={
     名称="护殿牛将"
    ,模型="牛妖"
    ,变异=true
    ,伤害=2200
    ,气血=50000
    ,灵力=800
    ,速度=500
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["狮驼岭"]
  }

  战斗单位[3]={
     名称="护殿牛将"
    ,模型="牛妖"
    ,变异=true
    ,伤害=2200
    ,气血=50000
    ,灵力=800
    ,速度=500
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["狮驼岭"]
  }

  战斗单位[4]={
     名称="护殿牛将"
    ,模型="牛妖"
    ,变异=true
    ,伤害=2200
    ,气血=50000
    ,灵力=900
    ,速度=500
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["魔王寨"]
  }

  战斗单位[5]={
     名称="护殿牛将"
    ,模型="牛妖"
    ,变异=true
    ,伤害=2200
    ,气血=50000
    ,灵力=900
    ,速度=500
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["魔王寨"]
  }

  for n=6,10 do
    战斗单位[n]={
       名称="火云妖兵"
      ,模型="炎魔神"
      ,变异=true
      ,伤害=2000
      ,气血=45000
      ,灵力=800
      ,速度=350
      ,防御=300
      ,法防=100
      ,躲闪=100
      ,魔法=200
      ,等级=等级-10
      ,技能={"反震"}
      ,主动技能=取随机法术(3)
    }
  end
  return 战斗单位
end

function 战斗准备类:取生死劫信息3(任务id,玩家id)
  local 战斗单位={}
  local 等级=120
  战斗单位[1]={
     名称="雷祖"
    ,模型="雨师"
    ,变异=true
    ,伤害=2000
    ,气血=100000
    ,灵力=1200
    ,速度=600
    ,防御=700
    ,法防=550
    ,躲闪=100
    ,魔法=200
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["天宫"]
  }

  战斗单位[2]={
     名称="邓天君"
    ,模型="天兵"
    ,变异=true
    ,伤害=2300
    ,气血=80000
    ,灵力=900
    ,速度=500
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=取随机法术(3)
  }

  战斗单位[3]={
     名称="辛天君"
    ,模型="天兵"
    ,变异=true
    ,伤害=2300
    ,气血=80000
    ,灵力=900
    ,速度=500
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=取随机法术(3)
  }

  战斗单位[4]={
     名称="张天君"
    ,模型="天兵"
    ,变异=true
    ,伤害=2300
    ,气血=80000
    ,灵力=900
    ,速度=500
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=取随机法术(3)
  }

  战斗单位[5]={
     名称="陶天君"
    ,模型="天兵"
    ,变异=true
    ,伤害=2300
    ,气血=80000
    ,灵力=900
    ,速度=500
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=取随机法术(3)
  }

  for n=6,10 do
    战斗单位[n]={
       名称="火云妖兵"
      ,模型="天兵"
      ,变异=true
      ,伤害=2000
      ,气血=50000
      ,灵力=800
      ,速度=350
      ,防御=300
      ,法防=100
      ,躲闪=100
      ,魔法=200
      ,等级=等级-10
      ,技能={"高级感知"}
      ,主动技能=取随机法术(3)
    }
    if n==6 then
      战斗单位[n].名称="庞天君"
    elseif n==7 then
      战斗单位[n].名称="刘天君"
    elseif n==8 then
      战斗单位[n].名称="荀天君"
    elseif n==9 then
      战斗单位[n].名称="毕天君"
    elseif n==10 then
      战斗单位[n].名称="秦天君"
    end
  end
  return 战斗单位
end

function 战斗准备类:取生死劫信息4(任务id,玩家id)
  local 战斗单位={}
  local 等级=130
  战斗单位[1]={
     名称="麻姑"
    ,模型="雾中仙"
    ,变异=true
    ,伤害=2000
    ,气血=120000
    ,灵力=1200
    ,速度=1000
    ,防御=700
    ,法防=1550
    ,躲闪=100
    ,魔法=200
    ,等级=等级
    ,技能={"高级隐身","高级反震"}
    ,主动技能=Q_门派法术["女儿村"]
  }

  战斗单位[2]={
     名称="玫瑰护法"
    ,模型="律法女娲"
    ,变异=true
    ,伤害=2400
    ,气血=80000
    ,灵力=1000
    ,速度=400
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["龙宫"]
  }

  战斗单位[3]={
     名称="海棠护法"
    ,模型="灵符女娲"
    ,变异=true
    ,伤害=1900
    ,气血=80000
    ,灵力=1000
    ,速度=400
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级反震"}
    ,主动技能=Q_门派法术["魔王寨"]
  }

  战斗单位[4]={
     名称="荷花仙子"
    ,模型="雾中仙"
    ,变异=true
    ,伤害=2300
    ,气血=80000
    ,灵力=900
    ,速度=500
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级反震"}
    ,主动技能=取随机法术(5)
  }

  战斗单位[5]={
     名称="梅花仙子"
    ,模型="雾中仙"
    ,变异=true
    ,伤害=2300
    ,气血=80000
    ,灵力=900
    ,速度=500
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级反震"}
    ,主动技能=取随机法术(5)
  }

  for n=6,10 do
    战斗单位[n]={
       名称="火云妖兵"
      ,模型="雾中仙"
      ,变异=true
      ,伤害=2100
      ,气血=70000
      ,灵力=800
      ,速度=350
      ,防御=300
      ,法防=100
      ,躲闪=100
      ,魔法=200
      ,等级=等级-10
      ,技能={"高级反震"}
      ,主动技能=取随机法术(3)
    }
    if n==6 then
      战斗单位[n].名称="桃花仙子"
    elseif n==7 then
      战斗单位[n].名称="兰花仙子"
    elseif n==8 then
      战斗单位[n].名称="梨花仙子"
    elseif n==9 then
      战斗单位[n].名称="昙花仙子"
    elseif n==10 then
      战斗单位[n].名称="菊花仙子"
    end
  end
  return 战斗单位
end

function 战斗准备类:取生死劫信息5(任务id,玩家id)
  local 战斗单位={}
  local 等级=130
  战斗单位[1]={
     名称="云霄仙子"
    ,模型="进阶如意仙子"
    ,变异=true
    ,伤害=2200
    ,气血=150000
    ,灵力=1200
    ,速度=700
    ,防御=1000
    ,法防=650
    ,躲闪=100
    ,魔法=200
    ,等级=等级
    ,技能={"高级隐身"}
    ,主动技能=Q_门派法术["普陀山"]
  }

  战斗单位[2]={
     名称="紫霞仙子"
    ,模型="星灵仙子"
    ,变异=true
    ,伤害=2000
    ,气血=120000
    ,灵力=1300
    ,速度=500
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级隐身"}
    ,主动技能=Q_门派法术["龙宫"]
  }

  战斗单位[3]={
     名称="忘情护法"
    ,模型="吸血鬼"
    ,变异=true
    ,伤害=2300
    ,气血=100000
    ,灵力=1000
    ,速度=500
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["大唐官府"]
  }

  战斗单位[4]={
     名称="忘情护法"
    ,模型="吸血鬼"
    ,变异=true
    ,伤害=2300
    ,气血=100000
    ,灵力=1000
    ,速度=500
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["凌波城"]
  }

  战斗单位[5]={
     名称="忘情护法"
    ,模型="吸血鬼"
    ,变异=true
    ,伤害=2300
    ,气血=100000
    ,灵力=1000
    ,速度=500
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["狮驼岭"]
  }

  for n=6,10 do
    战斗单位[n]={
       名称="盘丝小仙"
      ,模型="幽灵"
      ,变异=true
      ,伤害=1900
      ,气血=85000
      ,灵力=1000
      ,速度=350
      ,防御=300
      ,法防=100
      ,躲闪=100
      ,魔法=200
      ,等级=等级-10
      ,技能={"高级感知"}
      ,主动技能=取随机法术(3)
    }
  end
  return 战斗单位
end

function 战斗准备类:取生死劫信息6(任务id,玩家id)
  local 战斗单位={}
  local 等级=130
  战斗单位[1]={
     名称="龙王"
    ,模型="蛟龙"
    ,变异=true
    ,伤害=2000
    ,气血=200000
    ,灵力=1500
    ,速度=700
    ,防御=800
    ,法防=1650
    ,躲闪=100
    ,魔法=200
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["龙宫"]
  }

  战斗单位[2]={
     名称="九头驸马"
    ,模型="九头精怪"
    ,伤害=2000
    ,气血=150000
    ,灵力=1500
    ,速度=500
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["魔王寨"]
  }

  战斗单位[3]={
     名称="万圣公主"
    ,模型="小龙女"
    ,变异=true
    ,伤害=2300
    ,气血=120000
    ,灵力=1000
    ,速度=1000
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["普陀山"]
  }

  战斗单位[4]={
     名称="碧波水勇"
    ,模型="净瓶女娲"
    ,变异=true
    ,伤害=2000
    ,气血=120000
    ,灵力=1200
    ,速度=600
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=取随机法术(5)
  }

  战斗单位[5]={
     名称="碧波水勇"
    ,模型="净瓶女娲"
    ,变异=true
    ,伤害=2000
    ,气血=120000
    ,灵力=1200
    ,速度=600
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=取随机法术(5)
  }

  for n=6,10 do
    战斗单位[n]={
       名称="碧波水勇"
      ,模型="净瓶女娲"
      ,变异=true
      ,伤害=2000
      ,气血=100000
      ,灵力=1100
      ,速度=600
      ,防御=600
      ,法防=350
      ,躲闪=100
      ,魔法=200
      ,等级=等级-10
      ,技能={"高级感知"}
      ,主动技能=取随机法术(5)
    }
  end
  return 战斗单位
end

function 战斗准备类:取生死劫信息7(任务id,玩家id)
  local 战斗单位={}
  local 等级=140
  战斗单位[1]={
     名称="张天师"
    ,模型="雨师"
    ,变异=true
    ,伤害=2000
    ,气血=250000
    ,灵力=1800
    ,速度=1200
    ,防御=1000
    ,法防=1850
    ,躲闪=100
    ,魔法=200
    ,等级=等级
    ,技能={"高级反震"}
    ,主动技能=Q_门派法术["方寸山"]
  }

  战斗单位[2]={
     名称="许天师"
    ,模型="雨师"
    ,变异=true
    ,伤害=2800
    ,气血=200000
    ,灵力=1000
    ,速度=500
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级反震"}
    ,主动技能=Q_门派法术["天宫"]
  }

  战斗单位[3]={
     名称="萨天师"
    ,模型="雨师"
    ,变异=true
    ,伤害=2000
    ,气血=200000
    ,灵力=1800
    ,速度=1000
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["龙宫"]
  }

  战斗单位[4]={
     名称="许天师"
    ,模型="雨师"
    ,变异=true
    ,伤害=2000
    ,气血=150000
    ,灵力=1800
    ,速度=1000
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["龙宫"]
  }

  战斗单位[5]={
     名称="司命星君"
    ,模型="天将"
    ,变异=true
    ,伤害=2500
    ,气血=150000
    ,灵力=1300
    ,速度=600
    ,防御=600
    ,法防=350
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=取随机法术(5)
  }

  for n=6,10 do
    战斗单位[n]={
       名称="司命星君"
      ,模型="天将"
      ,变异=true
      ,伤害=2400
      ,气血=100000
      ,灵力=1200
      ,速度=600
      ,防御=600
      ,法防=350
      ,躲闪=100
      ,魔法=200
      ,等级=等级-10
      ,技能={"高级感知"}
      ,主动技能=取随机法术(5)
    }
    if n==6 then
      战斗单位[n].名称="司禄星君"
    elseif n==7 then
      战斗单位[n].名称="延寿星君"
    elseif n==8 then
      战斗单位[n].名称="益算星君"
    elseif n==9 then
      战斗单位[n].名称="度厄星君"
    elseif n==10 then
      战斗单位[n].名称="上生星君"
    end
  end
  return 战斗单位
end

function 战斗准备类:取生死劫信息8(任务id,玩家id)
  local 战斗单位={}
  local 等级=140
  战斗单位[1]={
     名称="转轮王"
    ,模型="阎罗王"
    ,伤害=2800
    ,气血=300000
    ,灵力=1800
    ,速度=1200
    ,防御=1600
    ,法防=1450
    ,躲闪=100
    ,魔法=200
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["阴曹地府"]
  }

  战斗单位[2]={
     名称="平方王"
    ,模型="野鬼"
    ,变异=true
    ,伤害=3000
    ,气血=250000
    ,灵力=1000
    ,速度=600
    ,防御=800
    ,法防=650
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级鬼魂术"}
    ,主动技能=Q_门派法术["狮驼岭"]
  }

  战斗单位[3]={
     名称="阴长生"
    ,模型="吸血鬼"
    ,变异=true
    ,伤害=2500
    ,气血=250000
    ,灵力=1000
    ,速度=1500
    ,防御=1000
    ,法防=450
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["盘丝洞"]
  }

  战斗单位[4]={
     名称="牛头"
    ,模型="牛头"
    ,变异=true
    ,伤害=2600
    ,气血=200000
    ,灵力=1400
    ,速度=600
    ,防御=800
    ,法防=450
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=取随机法术(5)
  }

  战斗单位[5]={
     名称="马面"
    ,模型="马面"
    ,变异=true
    ,伤害=2600
    ,气血=200000
    ,灵力=1400
    ,速度=600
    ,防御=800
    ,法防=450
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=取随机法术(5)
  }

  for n=6,10 do
    战斗单位[n]={
       名称="勾魂使者"
      ,模型="幽灵"
      ,变异=true
      ,伤害=2500
      ,气血=150000
      ,灵力=1200
      ,速度=500
      ,防御=600
      ,法防=500
      ,躲闪=100
      ,魔法=200
      ,等级=等级-10
      ,技能={"高级感知"}
      ,主动技能=取随机法术(5)
    }
  end
  return 战斗单位
end

function 战斗准备类:取生死劫信息9(任务id,玩家id)
  local 战斗单位={}
  local 等级=150
  战斗单位[1]={
     名称="孔雀明王"
    ,模型="九头精怪"
    ,伤害=3000
    ,愤怒=99999
    ,不可封印=true
    ,气血=400000
    ,灵力=900
    ,速度=1800
    ,防御=2500
    ,法防=2450
    ,躲闪=100
    ,魔法=200
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能={"晶清诀","天雷斩"}
  }

  战斗单位[2]={
     名称="泼法金刚"
    ,模型="大力金刚"
    ,变异=true
    ,伤害=2500
    ,气血=300000
    ,灵力=1200
    ,速度=800
    ,防御=1200
    ,法防=650
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["化生寺"]
  }

  战斗单位[3]={
     名称="胜至金刚"
    ,模型="大力金刚"
    ,变异=true
    ,伤害=2500
    ,气血=300000
    ,灵力=2500
    ,速度=800
    ,防御=600
    ,法防=2450
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术["龙宫"]
  }

  战斗单位[4]={
     名称="大力金刚"
    ,模型="大力金刚"
    ,变异=true
    ,伤害=3600
    ,气血=250000
    ,灵力=400
    ,速度=900
    ,防御=1200
    ,法防=50
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级必杀"}
    ,主动技能={"反间之计","横扫千军","后发制人"}
  }

  战斗单位[5]={
     名称="永住金刚"
    ,模型="大力金刚"
    ,变异=true
    ,伤害=3000
    ,气血=250000
    ,灵力=100
    ,速度=900
    ,防御=1200
    ,法防=50
    ,躲闪=100
    ,魔法=200
    ,等级=等级-10
    ,技能={"高级必杀"}
    ,主动技能=Q_门派法术["狮驼岭"]
  }

  for n=6,10 do
    战斗单位[n]={
       名称="护法枷蓝"
      ,模型="大力金刚"
      ,变异=true
      ,伤害=2700
      ,气血=200000
      ,灵力=1300
      ,速度=600
      ,防御=800
      ,法防=400
      ,躲闪=100
      ,魔法=200
      ,等级=等级-10
      ,技能={"高级隐身"}
      ,主动技能=取随机法术(5)
    }
  end
  return 战斗单位
end

function 战斗准备类:取天蝎座信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-20
  if 等级<=10 then
      等级=10
  end
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*7+500,气血=2000,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型范围={"进阶蝎子精"}
  local 模型名称范围={"天蝎座"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5,气血=2000,灵力=等级*4,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取射手座信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-20
  if 等级<=10 then
      等级=10
  end
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*7+500,气血=2000,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型范围={"进阶真陀护法"}
  local 模型名称范围={"射手座"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=2000,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取摩羯座信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-20
  if 等级<=10 then
      等级=10
  end
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*7+500,气血=2000,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型范围={"进阶龙龟"}
  local 模型名称范围={"摩羯座"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=2000,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取新服福利BOSS信息(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=500,气血=1000,灵力=300,速度=2.3,防御=3,法防=0,躲闪=4,魔法=2000,等级=0,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型范围={"超级玉兔"}
  local 模型名称范围={"新服福利BOSS"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,6 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=500,气血=1000,灵力=300,速度=2.3,防御=3,法防=0,躲闪=4,魔法=2000,等级=0,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取帮派侍卫信息(任务id,玩家id)
  local 等级=玩家数据[玩家id].角色.数据.等级
  local 战斗单位={}
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*7+500,气血=等级*150,灵力=等级*5,速度=2.3,防御=3,法防=0,躲闪=4,魔法=2000,等级=0,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型范围={"凤凰","芙蓉仙子","巡游天神","白熊","古代瑞兽","炎魔神","净瓶女娲","幽灵","灵符女娲","吸血鬼","鬼将","灵鹤"}
  local 模型名称范围={"帮派守卫"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*7+500,气血=等级*100,灵力=等级*5,速度=2.3,防御=3,法防=0,躲闪=4,魔法=2000,等级=0,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取帮派护法信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
     名称=任务数据[任务id].名称
    ,模型=任务数据[任务id].模型
    ,武器=取武器数据(任务数据[任务id].武器,任务数据[任务id].武器等级)
    ,角色=true
    ,伤害=等级*15+500
    ,气血=等级*10+50000
    ,灵力=等级*10
    ,速度=等级*5
    ,防御=等级*10
    ,法防=等级*8
    ,躲闪=等级*10
    ,魔法=等级*10
    ,愤怒=99999
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能=取随机法术(5)
  }
  for i=2,3 do
    local 造型=Q_随机模型[取随机数(1,#Q_随机模型)]
    local 武器造型=取天罡星武器造型(造型)
    战斗单位[i]={
      名称="护法随从"
      ,模型=造型
      ,角色=true
      ,武器=取武器数据(武器造型.武器,武器造型.级别)
      ,伤害=等级*15+300
      ,气血=等级*10+30000
      ,灵力=等级*5
      ,速度=等级*3
      ,防御=等级*3
      ,法防=0
      ,愤怒=99999
      ,躲闪=等级*4
      ,魔法=2000
      ,等级=等级
      ,技能={"高级感知"}
      ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}
    }
  end
  for i=4,5 do
    local 造型=Q_随机模型[取随机数(1,#Q_随机模型)]
    local 武器造型=取天罡星武器造型(造型)
    战斗单位[i]={
      名称="护法随从"
      ,模型=造型
      ,角色=true
      ,武器=取武器数据(武器造型.武器,武器造型.级别)
      ,伤害=等级*15
      ,气血=等级*10+30000
      ,灵力=等级*15
      ,速度=等级*2.3
      ,防御=等级*3
      ,愤怒=99999
      ,法防=等级*15
      ,躲闪=等级*4
      ,魔法=2000
      ,等级=等级
      ,技能={"高级感知"}
      ,主动技能={"落叶萧萧","三昧真火","飞砂走石","八凶法阵","上古灵符","龙卷雨击","龙吟"}
    }
  end
  for i=6,7 do
    local 造型=Q_随机模型[取随机数(1,#Q_随机模型)]
    local 武器造型=取天罡星武器造型(造型)
    战斗单位[i]={
      名称="护法随从"
      ,模型=造型
      ,角色=true
      ,武器=取武器数据(武器造型.武器,武器造型.级别)
      ,伤害=等级*15
      ,气血=等级*10+30000
      ,灵力=等级*15
      ,速度=等级*7
      ,防御=等级*3
      ,愤怒=99999
      ,法防=等级*10
      ,躲闪=等级*4
      ,魔法=2000
      ,等级=等级
      ,技能={"高级感知"}
      ,主动技能={"失心符","催眠符","定身符","落雷符","反间之计","晶清诀"}
    }
  end
  for i=8,9 do
    local 造型=Q_随机模型[取随机数(1,#Q_随机模型)]
    local 武器造型=取天罡星武器造型(造型)
    战斗单位[i]={
      名称="护法随从"
      ,模型=造型
      ,角色=true
      ,武器=取武器数据(武器造型.武器,武器造型.级别)
      ,伤害=等级*15
      ,气血=等级*10+50000
      ,灵力=等级*10
      ,速度=等级*1.3
      ,防御=等级*10
      ,愤怒=99999
      ,法防=等级*10
      ,躲闪=等级*10
      ,魔法=2000
      ,等级=等级
      ,技能={"高级感知"}
      ,主动技能={"推气过宫","四海升平","晶清诀","罗汉金钟"}
    }
  end
  for i=10,10 do
    local 造型=Q_随机模型[取随机数(1,#Q_随机模型)]
    local 武器造型=取天罡星武器造型(造型)
    战斗单位[i]={
      名称="护法随从"
      ,模型=造型
      ,角色=true
      ,武器=取武器数据(武器造型.武器,武器造型.级别)
      ,伤害=等级*15+500
      ,气血=等级*10+30000
      ,灵力=等级*5
      ,速度=等级*2.3
      ,防御=等级*5
      ,法防=0
      ,愤怒=99999
      ,躲闪=等级*4
      ,魔法=2000
      ,等级=等级
      ,技能={"高级感知"}
      ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}
    }
  end
  return 战斗单位
end

function 战斗准备类:取水瓶座信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-20
  if 等级<=10 then
      等级=10
  end
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*7+500,气血=2000,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型范围={"净瓶女娲"}
  local 模型名称范围={"水瓶座"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5,气血=2000,灵力=等级*4,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取白羊座信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-20
  if 等级<=10 then
      等级=10
  end
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*7+500,气血=2000,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型范围={"超级神羊"}
  local 模型名称范围={"白羊座"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=2000,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取金牛座信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-20
  if 等级<=10 then
      等级=10
  end
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*7+500,气血=2000,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型范围={"踏云兽"}
  local 模型名称范围={"金牛座"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=2000,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取狮子座信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+20
  if 等级<=10 then
      等级=10
  end
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*25+500,气血=250000,灵力=等级*20+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型范围={"净瓶女娲"}
  local 模型名称范围={"狮子座"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*25,气血=150000,灵力=等级*20,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取处女座信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+20
  if 等级<=10 then
      等级=10
  end
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*25+500,气血=250000,灵力=等级*20+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型范围={"超级神羊"}
  local 模型名称范围={"处女座"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*25+500,气血=150000,灵力=等级*20+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取天秤座信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+20
  if 等级<=10 then
      等级=10
  end
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*25+500,气血=250000,灵力=等级*20+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型范围={"踏云兽"}
  local 模型名称范围={"天秤座"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*25+500,气血=150000,灵力=等级*20+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取车迟斗法贡品信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-20
  if 等级<=10 then
      等级=10
  end
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*7+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型范围={"泡泡"}
  local 模型名称范围={"贡品"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,3 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=任务数据[任务id].名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  for i=4,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取车迟斗法三清信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+10
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型="大力金刚"
,变异=true
,伤害=等级*15
,气血=等级*等级*8
,灵力=等级*8
,速度=等级*3.5
,防御=等级*5
,法防=等级*0.7
,躲闪=100
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 等级=等级-5
 for i=2,10 do
      战斗单位[i]={
   名称="护法"
  ,模型="天兵"
  ,伤害=等级*20
  ,气血=等级*等级*5
  ,灵力=等级*5
  ,速度=等级*2.5
  ,防御=等级*3
  ,法防=0
  ,躲闪=等级*4
  ,魔法=200
  ,等级=等级
  ,技能={"高级连击"}
  ,主动技能=取随机法术(2)
  }
 end
 return 战斗单位
end

function 战斗准备类:取车迟斗法求雨信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+10
    战斗单位[1]={
   名称=任务数据[任务id].名称
  ,模型=任务数据[任务id].模型
  ,变异=true
  ,伤害=等级*18
  ,气血=等级*等级*8
  ,灵力=等级*4
  ,速度=等级*3.5
  ,防御=等级*3
  ,法防=等级*0.7
  ,躲闪=100
  ,魔法=200
  ,等级=等级
  ,技能={"高级感知"}
  ,主动技能=取随机法术(3)
  }
  等级=等级-5
  for i=2,10 do
      战斗单位[i]={
   名称="天将"
  ,模型="天将"
  ,伤害=等级*20
  ,气血=等级*等级*5
  ,灵力=等级*5
  ,速度=等级*2.5
  ,防御=等级*3
  ,法防=0
  ,躲闪=等级*4
  ,魔法=200
  ,等级=等级
  ,技能={"高级连击"}
  ,主动技能=取随机法术(2)
  }
  end
  return 战斗单位
end

function 战斗准备类:取车迟斗法不动信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+10
  if 任务数据[任务id].名称=="我不动" then
        战斗单位[1]={
     名称=任务数据[任务id].名称
    ,模型="净瓶女娲"
    ,变异=true
    ,伤害=等级*20
    ,气血=等级*等级*10
    ,灵力=等级*15
    ,速度=等级*3.5
    ,防御=等级*3
    ,法防=等级*0.7
    ,躲闪=100
    ,魔法=200
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能=取随机法术(3)
    }
      for i=2,5 do
          战斗单位[i]={
       名称="你不动"
      ,模型="净瓶女娲"
      ,变异=true
      ,伤害=等级*18
      ,气血=等级*等级*8
      ,灵力=等级*15
      ,速度=等级*2.5
      ,防御=等级*3
      ,法防=等级*0.7
      ,躲闪=100
      ,魔法=200
      ,等级=等级
      ,技能={"高级连击"}
      ,主动技能=取随机法术(2)
      }
     end
     等级=等级-5
     for i=6,10 do
          战斗单位[i]={
       名称="护法"
      ,模型="大力金刚"
      ,伤害=等级*18
      ,气血=等级*等级*5
      ,灵力=等级*10
      ,速度=等级*2.5
      ,防御=等级*3
      ,法防=0
      ,躲闪=等级*4
      ,魔法=200
      ,等级=等级
      ,技能={"高级连击"}
      ,主动技能=取随机法术(2)
      }
     end
  else
        战斗单位[1]={
     名称=任务数据[任务id].名称
    ,模型="净瓶女娲"
    ,变异=true
    ,伤害=等级*18
    ,气血=等级*等级*6
    ,灵力=等级*10
    ,速度=等级*3.5
    ,防御=等级*3
    ,法防=等级*0.7
    ,躲闪=100
    ,魔法=200
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能=取随机法术(3)
    }
    for i=2,5 do
          战斗单位[i]={
       名称="护法"
      ,模型="大力金刚"
      ,变异=true
      ,伤害=等级*18
      ,气血=等级*等级*5
      ,灵力=等级*10
      ,速度=等级*3.5
      ,防御=等级*3
      ,法防=等级*0.7
      ,躲闪=100
      ,魔法=200
      ,等级=等级
      ,技能={"高级连击"}
      ,主动技能=取随机法术(2)
      }
     end
     等级=等级-5
     for i=6,10 do
          战斗单位[i]={
       名称="护卫"
      ,模型="夜罗刹"
      ,伤害=等级*18
      ,气血=等级*等级*3
      ,灵力=等级*10
      ,速度=等级*2.5
      ,防御=等级*3
      ,法防=0
      ,躲闪=等级*4
      ,魔法=200
      ,等级=等级
      ,技能={"高级连击"}
      ,主动技能=取随机法术(2)
      }
     end
  end
  return 战斗单位
end

function 战斗准备类:取车迟斗法妖怪信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+20
  if 等级<=10 then
      等级=10
  end
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*15+500,气血=等级*等级*10,灵力=等级*10+300,速度=等级*4.3,防御=等级*5,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击","高级隐身"},主动技能=取随机法术(5)}
  local 模型范围={"踏云兽","净瓶女娲","炎魔神","灵符女娲","雨师","芙蓉仙子"}
  local 模型名称范围={"喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*12+500,气血=等级*等级*5,灵力=等级*8+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取60级蚩尤元神信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
    名称="蚩尤元神"
    ,模型=任务数据[任务id].模型
    ,伤害=1800*1.3
    ,气血=(等级*等级*10+100000)*1.3
    ,灵力=等级*20*1.3
    ,变异=true
    ,速度=等级*5*1.3
    ,防御=等级*10*1.3
    ,法防=等级*8*1.3
    ,躲闪=等级*5*1.3
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能=取随机法术(5)
  }
  战斗单位[2]={
    名称="魔族护法"
    ,模型="进阶夜罗刹"
    ,伤害=1500*1.3
    ,气血=(等级*等级*10+50000)*1.3
    ,灵力=等级*4*1.3
    ,变异=true
    ,速度=等级*2.5*1.3
    ,防御=等级*6*1.3
    ,法防=130
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"横扫千军","天雷斩","浪涌"}
  }
  战斗单位[3]={
    名称="魔族军师"
    ,模型="进阶曼珠沙华"
    ,伤害=500*1.3
    ,变异=true
    ,气血=(等级*等级*10+50000)*1.3
    ,灵力=(等级*20+200)*1.3
    ,速度=等级*2.5*1.3
    ,防御=等级*3*1.3
    ,法防=等级*8*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"三昧真火","龙卷雨击","飞砂走石"}
  }
  战斗单位[4]={
    名称="魔族首领"
    ,模型="进阶蝎子精"
    ,伤害=等级*2*1.3
    ,变异=true
    ,气血=(等级*等级*10+50000)*1.3
    ,灵力=等级*4*1.3
    ,速度=等级*8*1.3
    ,防御=等级*2*1.3
    ,法防=500
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"失心符","定身符","反间之计"}
  }
  战斗单位[5]={
    名称="魔族首领"
    ,模型="进阶蝎子精"
    ,伤害=等级*2*1.3
    ,变异=true
    ,气血=(等级*等级*10+50000)*1.3
    ,灵力=等级*4*1.3
    ,速度=等级*8*1.3
    ,防御=等级*2*1.3
    ,法防=500
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"失心符","定身符","反间之计"}
  }
  战斗单位[6]={
    名称="魔族精英"
    ,模型="进阶锦毛貂精"
    ,伤害=等级*2*1.3
    ,变异=true
    ,气血=(等级*等级*10+50000)*1.3
    ,灵力=(等级*20+200)*1.3
    ,速度=300*1.3
    ,防御=等级*2*1.3
    ,法防=等级*8*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"三昧真火","龙卷雨击","飞砂走石"}
  }
  战斗单位[7]={
    名称="魔族精英"
    ,模型="进阶千年蛇魅"
    ,伤害=600*1.3
    ,变异=true
    ,气血=(等级*等级*15+100000)*1.3
    ,灵力=等级*4*1.3
    ,速度=等级*2.5*1.3
    ,防御=等级*15*1.3
    ,法防=等级*10*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级神佑复生"}
    ,主动技能={"推气过宫","晶清诀","罗汉金钟","圣灵之甲","四海升平"}
  }
  战斗单位[8]={
    名称="魔族精英"
    ,模型="进阶碧水夜叉"
    ,伤害=1500*1.3
    ,变异=true
    ,气血=(等级*等级*10+50000)*1.3
    ,灵力=等级*2*1.3
    ,速度=等级*4*1.3
    ,防御=等级*8*1.3
    ,法防=等级*0.5*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"横扫千军","天雷斩","浪涌"}
  }
  return 战斗单位
end

function 战斗准备类:取100级蚩尤元神信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
    名称="蚩尤元神"
    ,模型=任务数据[任务id].模型
    ,伤害=2500*1.3
    ,变异=true
    ,气血=(等级*等级*20+100000)*1.3
    ,灵力=(等级*15+200)*1.3
    ,速度=等级*7*1.3
    ,防御=等级*5*1.3
    ,法防=等级*5*1.3
    ,躲闪=等级*5*1.3
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能=取随机法术(5)}
  战斗单位[2]={
    名称="魔族护法"
    ,模型="进阶夜罗刹"
    ,伤害=2200*1.3
    ,变异=true
    ,气血=(等级*等级*15+50000)*1.3
    ,灵力=等级*4*1.3
    ,速度=等级*3*1.3
    ,防御=等级*8*1.3
    ,法防=500
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级神佑复生"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  战斗单位[3]={
    名称="魔族军师"
    ,模型="进阶曼珠沙华"
    ,伤害=2200*1.3
    ,变异=true
    ,气血=(等级*等级*15+50000)*1.3
    ,灵力=等级*4*1.3
    ,速度=等级*3*1.3
    ,防御=等级*8*1.3
    ,法防=500
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级神佑复生"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  战斗单位[4]={
    名称="魔族首领"
    ,模型="进阶蝎子精"
    ,伤害=等级*2*1.3
    ,变异=true
    ,气血=(等级*等级*15+50000)*1.3
    ,灵力=(等级*20+200)*1.3
    ,速度=等级*2*1.3
    ,防御=等级*2*1.3
    ,法防=等级*8*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[5]={
    名称="魔族首领"
    ,模型="进阶蝎子精"
    ,变异=true
    ,伤害=等级*2*1.3
    ,气血=(等级*等级*15+50000)*1.3
    ,灵力=(等级*20+200)*1.3
    ,速度=等级*2*1.3
    ,防御=等级*2*1.3
    ,法防=等级*8*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[6]={
    名称="魔族精英"
    ,模型="进阶画魂"
    ,变异=true
    ,伤害=等级*2*1.3
    ,气血=(等级*等级*15+50000)*1.3
    ,灵力=(等级*20+200)*1.3
    ,速度=等级*2*1.3
    ,防御=等级*2*1.3
    ,法防=等级*8*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[7]={
    名称="魔族精英"
    ,模型="进阶阴阳伞"
    ,变异=true
    ,伤害=600*1.3
    ,气血=(等级*等级*18+50000)*1.3
    ,灵力=等级*4*1.3
    ,速度=等级*7*1.3
    ,防御=等级*3*1.3
    ,法防=等级*0.8*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级神佑复生"}
    ,主动技能={"失心符","定身符","反间之计","晶清诀","四海升平"}}
  战斗单位[8]={
    名称="魔族精英"
    ,模型="进阶阴阳伞"
    ,变异=true
    ,伤害=600*1.3
    ,气血=(等级*等级*18+50000)*1.3
    ,灵力=等级*4*1.3
    ,速度=等级*7*1.3
    ,防御=等级*3*1.3
    ,法防=等级*0.8*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"失心符","定身符","反间之计"}}
  战斗单位[9]={
    名称="鬼族圣贤"
    ,模型="进阶幽灵"
    ,变异=true
    ,伤害=600*1.3
    ,气血=(等级*等级*25+100000)*1.3
    ,灵力=等级*4*1.3
    ,速度=等级*2.5*1.3
    ,防御=等级*8*1.3
    ,法防=等级*8*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级神佑复生"}
    ,主动技能={"推气过宫","罗汉金钟","晶清诀"}}
  战斗单位[10]={
    名称="魔族精英"
    ,模型="进阶吸血鬼"
    ,变异=true
    ,伤害=2200*1.3
    ,气血=(等级*等级*15+50000)*1.3
    ,灵力=等级*2*1.3
    ,速度=等级*4*1.3
    ,防御=等级*5*1.3
    ,法防=等级*0.5*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级神佑复生"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  return 战斗单位
end

function 战斗准备类:取150级蚩尤元神信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
    名称="蚩尤元神"
    ,模型=任务数据[任务id].模型
    ,变异=true
    ,伤害=3500*1.3
    ,气血=(等级*等级*20+400000)*1.3
    ,灵力=等级*8*1.3
    ,速度=等级*6*1.3
    ,防御=等级*6*1.3
    ,法防=等级*6*1.3
    ,躲闪=等级*6*1.3
    ,魔法=等级*10*1.3
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能=取随机法术(5)}
  战斗单位[2]={
    名称="魔族护法"
    ,模型="进阶夜罗刹"
    ,变异=true
    ,伤害=3300*1.3
    ,气血=(等级*等级*15+200000)*1.3
    ,灵力=等级*4*1.3
    ,速度=等级*3*1.3
    ,防御=等级*6*1.3
    ,法防=500
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级神佑复生","高级必杀","高级吸血"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  战斗单位[3]={
    名称="魔族军师"
    ,模型="进阶曼珠沙华"
    ,变异=true
    ,伤害=3300*1.3
    ,气血=(等级*等级*15+200000)*1.3
    ,灵力=等级*4*1.3
    ,速度=等级*3*1.3
    ,防御=等级*6*1.3
    ,法防=500
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级神佑复生","高级必杀","高级吸血"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  战斗单位[4]={
    名称="魔族首领"
    ,模型="进阶蝎子精"
    ,变异=true
    ,伤害=等级*2*1.3
    ,气血=(等级*等级*15+200000)*1.3
    ,灵力=(等级*15+300)*1.3
    ,速度=等级*2*1.3
    ,防御=等级*2*1.3
    ,法防=等级*6*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[5]={
    名称="魔族首领"
    ,模型="进阶蝎子精"
    ,变异=true
    ,伤害=等级*2*1.3
    ,气血=(等级*等级*15+200000)*1.3
    ,灵力=(等级*15+300)*1.3
    ,速度=等级*2*1.3
    ,防御=等级*2*1.3
    ,法防=等级*6*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[6]={
    名称="魔族精英"
    ,模型="进阶混沌兽"
    ,变异=true
    ,伤害=等级*2*1.3
    ,气血=(等级*等级*15+200000)*1.3
    ,灵力=(等级*15+300)*1.3
    ,速度=等级*2*1.3
    ,防御=等级*2*1.3
    ,法防=等级*6*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[7]={
    名称="魔族精英"
    ,模型="进阶琴仙"
    ,变异=true
    ,伤害=600*1.3
    ,气血=(等级*等级*15+150000)*1.3
    ,灵力=等级*4*1.3
    ,速度=800*1.3
    ,防御=等级*3*1.3
    ,法防=等级*0.8*1.3
    ,躲闪=等级*4*1.3
    ,愤怒=99999
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"失心符","定身符","反间之计"}}
  战斗单位[8]={
    名称="魔族精英"
    ,模型="进阶琴仙"
    ,变异=true
    ,伤害=600*1.3
    ,气血=(等级*等级*15+150000)*1.3
    ,灵力=等级*4*1.3
    ,速度=800*1.3
    ,防御=等级*3*1.3
    ,法防=等级*0.8*1.3
    ,躲闪=等级*4*1.3
    ,愤怒=99999
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"失心符","定身符","反间之计"}}
  战斗单位[9]={
    名称="魔族精英"
    ,模型="进阶龙龟"
    ,变异=true
    ,伤害=600*1.3
    ,气血=(等级*等级*25+400000)*1.3
    ,灵力=等级*4*1.3
    ,速度=等级*2.5*1.3
    ,防御=等级*6*1.3
    ,法防=等级*6*1.3
    ,躲闪=等级*4*1.3
    ,愤怒=99999
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"推气过宫","四海升平","罗汉金钟","晶清诀"}}
  战斗单位[10]={
    名称="魔族精英"
    ,模型="进阶蜃气妖"
    ,变异=true
    ,伤害=2300*1.3
    ,气血=(等级*等级*15+150000)*1.3
    ,灵力=等级*2*1.3
    ,速度=等级*4*1.3
    ,防御=等级*5*1.3
    ,法防=等级*0.5*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级神佑复生","高级必杀","高级吸血"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  return 战斗单位
end

function 战斗准备类:取知了王信息1(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*18+800
,气血=等级*等级*8
,灵力=等级*9
,速度=等级*4
,防御=等级*7
,法防=等级*3
,躲闪=等级*6
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="诡秘千疑"
,模型="幽灵"
,变异=true
,伤害=等级*18+500
,气血=等级*等级*4
,灵力=等级*3
,速度=等级*5
,防御=等级*5
,法防=等级*1
,躲闪=等级*5
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
 战斗单位[3]={
 名称="诡秘千疑"
,模型="幽灵"
,变异=true
,伤害=等级*18+500
,气血=等级*等级*4
,灵力=等级*3
,速度=等级*5
,防御=等级*5
,法防=等级*1
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
  战斗单位[4]={
 名称="诡秘千疑"
,模型="幽灵"
,伤害=等级*10
,气血=等级*等级*4
,灵力=等级*8
,速度=等级*2
,防御=等级*6
,法防=等级*3
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能=Q_门派法术["魔王寨"]
}
  战斗单位[5]={
 名称="诡秘千疑"
,模型="幽灵"
,伤害=等级*10
,气血=等级*等级*4
,灵力=等级*8
,速度=等级*2
,防御=等级*6
,法防=等级*3
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能=Q_门派法术["龙宫"]
}
  战斗单位[6]={
 名称="喽啰"
,模型="野猪精"
,伤害=等级*10+500
,气血=等级*等级*3
,灵力=等级*8
,速度=等级*3
,防御=等级*5
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="喽啰"
,模型="野猪精"
,伤害=等级*12+500
,气血=等级*等级*3
,灵力=等级*8
,速度=等级*3
,防御=等级*5
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="喽啰"
,模型="野猪精"
,伤害=等级*12+500
,气血=等级*等级*3
,灵力=等级*8
,速度=等级*3
,防御=等级*5
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[9]={
 名称="喽啰"
,模型="野猪精"
,伤害=等级*12+500
,气血=等级*等级*3
,灵力=等级*8
,速度=等级*3
,防御=等级*5
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[10]={
 名称="喽啰"
,模型="野猪精"
,伤害=等级*12+500
,气血=等级*等级*3
,灵力=等级*8
,速度=等级*3
,防御=等级*5
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  return 战斗单位
 end

 function 战斗准备类:取小知了王信息1(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*18+500
,气血=等级*等级*6
,灵力=等级*8
,速度=等级*4
,防御=等级*8
,法防=等级*4
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="知了军师"
,模型="进阶千年蛇魅"
,变异=true
,伤害=等级*18+350
,气血=等级*等级*4
,灵力=等级*3
,速度=等级*5
,防御=等级*8
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
 战斗单位[3]={
 名称="知了军师"
,模型="进阶千年蛇魅"
,变异=true
,伤害=等级*18+350
,气血=等级*等级*4
,灵力=等级*3
,速度=等级*5
,防御=等级*8
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
  战斗单位[4]={
 名称="知了大队长"
,模型="进阶鲛人"
,伤害=等级*12
,气血=等级*等级*4
,灵力=等级*8
,速度=等级*2
,防御=等级*6
,法防=等级*3
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级魔之心","高级法术连击"}
,主动技能=Q_门派法术["魔王寨"]
}
  战斗单位[5]={
 名称="知了大队长"
,模型="进阶鲛人"
,伤害=等级*12
,气血=等级*等级*4
,灵力=等级*8
,速度=等级*2
,防御=等级*6
,法防=等级*3
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级魔之心","高级法术连击"}
,主动技能=Q_门派法术["龙宫"]
}
  战斗单位[6]={
 名称="喽啰"
,模型="进阶碧水夜叉"
,伤害=等级*15+350
,气血=等级*等级*4
,灵力=等级*6
,速度=等级*4
,防御=等级*8
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="喽啰"
,模型="进阶碧水夜叉"
,伤害=等级*15+350
,气血=等级*等级*4
,灵力=等级*6
,速度=等级*4
,防御=等级*8
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="喽啰"
,模型="进阶碧水夜叉"
,伤害=等级*15+350
,气血=等级*等级*4
,灵力=等级*6
,速度=等级*4
,防御=等级*8
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[9]={
 名称="喽啰"
,模型="进阶碧水夜叉"
,伤害=等级*15+350
,气血=等级*等级*4
,灵力=等级*6
,速度=等级*4
,防御=等级*8
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[10]={
 名称="喽啰"
,模型="进阶碧水夜叉"
,伤害=等级*15+350
,气血=等级*等级*4
,灵力=等级*6
,速度=等级*4
,防御=等级*8
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  return 战斗单位
 end

function 战斗准备类:取知了先锋信息1(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*18+500
,气血=等级*等级*4
,灵力=等级*6
,速度=等级*2
,防御=等级*5
,法防=等级*4
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="先锋军师"
,模型="进阶锦毛貂精"
,变异=true
,伤害=等级*18+300
,气血=等级*等级*2
,灵力=等级*2
,速度=等级*5
,防御=等级*5
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
 战斗单位[3]={
 名称="先锋军师"
,模型="进阶锦毛貂精"
,变异=true
,伤害=等级*18+30
,气血=等级*等级*2
,灵力=等级*2
,速度=等级*5
,防御=等级*5
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
  战斗单位[4]={
 名称="先锋小队长"
,模型="进阶野猪精"
,伤害=等级*8
,气血=等级*等级*2
,灵力=等级*6
,速度=等级*2
,防御=等级*6
,法防=等级*3
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级魔之心"}
,主动技能=Q_门派法术["魔王寨"]
}
  战斗单位[5]={
 名称="先锋小队长"
,模型="进阶野猪精"
,伤害=等级*8
,气血=等级*等级*2
,灵力=等级*6
,速度=等级*2
,防御=等级*6
,法防=等级*3
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级魔之心"}
,主动技能=Q_门派法术["龙宫"]
}
  战斗单位[6]={
 名称="喽啰"
,模型="百足将军"
,伤害=等级*12+300
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*4
,防御=等级*10
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="喽啰"
,模型="百足将军"
,伤害=等级*12+300
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*4
,防御=等级*10
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="喽啰"
,模型="百足将军"
,伤害=等级*12+300
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*4
,防御=等级*10
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[9]={
 名称="喽啰"
,模型="百足将军"
,伤害=等级*12+300
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*4
,防御=等级*10
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[10]={
 名称="喽啰"
,模型="百足将军"
,伤害=等级*12+300
,气血=等级*等级*2
,灵力=等级*4
,速度=等级*4
,防御=等级*10
,法防=等级*2
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  return 战斗单位
 end

function 战斗准备类:取散财童子信息(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=500,气血=100000,灵力=300,速度=2.3,防御=3,法防=0,躲闪=4,魔法=2000,等级=0,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型范围={"葫芦宝贝"}
  local 模型名称范围={"恭喜发财"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,6 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=500,气血=60000,灵力=300,速度=2.3,防御=3,法防=0,躲闪=4,魔法=2000,等级=0,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取神秘妖怪信息(任务id,玩家id)
  local 等级=玩家数据[玩家id].角色.数据.等级
  local 战斗单位={}
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=任务数据[任务id].变异,显示饰品=任务数据[任务id].显示饰品,伤害=等级*8+500,气血=等级*300,灵力=等级*8+300,速度=等级*2.3,防御=等级*5,法防=等级*5,躲闪=等级*5,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型范围={"蛟龙","地狱战神","白熊","古代瑞兽"}
  local 模型名称范围={"喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*6+500,气血=等级*200,灵力=等级*6+300,速度=等级*2.3,防御=等级*5,法防=等级*5,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取妄空曰天冷信息(任务id,玩家id)
  local 等级=玩家数据[玩家id].角色.数据.等级
  local 战斗单位={}
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,角色=true,武器=取武器数据(任务数据[任务id].武器,任务数据[任务id].武器等级),武器染色组=任务数据[任务id].武器染色组,武器染色方案=任务数据[任务id].武器染色方案,变异=任务数据[任务id].变异,显示饰品=任务数据[任务id].显示饰品,伤害=等级*10+1000,气血=等级*400,灵力=等级*10+500,速度=5.3,防御=等级*6,法防=等级*6,躲闪=等级*5,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型范围={"进阶鬼将","进阶蝎子精","进阶吸血鬼","进阶碧水夜叉","进阶龙龟"}
  local 模型名称范围={"喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*8+500,气血=等级*300,灵力=等级*8+300,速度=等级*2.3,防御=等级*6,法防=等级*6,躲闪=等级*5,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取妄空曰天冷信息2(任务id,玩家id)
  local 等级=玩家数据[玩家id].角色.数据.等级
  local 战斗单位={}
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,角色=true,武器=取武器数据(任务数据[任务id].武器,任务数据[任务id].武器等级),武器染色组=任务数据[任务id].武器染色组,武器染色方案=任务数据[任务id].武器染色方案,变异=任务数据[任务id].变异,显示饰品=任务数据[任务id].显示饰品,伤害=等级*10+1000,气血=等级*400,灵力=等级*10+500,速度=5.3,防御=等级*6,法防=等级*6,躲闪=等级*5,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型名称范围={"喽啰"}
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    local 模型=Q_随机模型[取随机数(1,#Q_随机模型)]
    local 武器造型=取天罡星武器造型(模型)
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,角色=true,武器=取武器数据(武器造型.武器,武器造型.级别),武器染色组=任务数据[任务id].武器染色组,武器染色方案=任务数据[任务id].武器染色方案,显示饰品=true,伤害=等级*8+500,气血=等级*300,灵力=等级*8+300,速度=等级*2.3,防御=等级*6,法防=等级*6,躲闪=等级*5,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取渡劫师傅信息(任务id,玩家id)
  local 等级=玩家数据[玩家id].角色.数据.等级
  local 模型=玩家数据[玩家id].角色.数据.造型
  local 武器造型=取天罡星武器造型(模型)
  local 战斗单位={}
  战斗单位[1]={名称=玩家数据[玩家id].角色.数据.门派.."大弟子",模型=模型,角色=true,武器=取武器数据(武器造型.武器,武器造型.级别),武器染色组=任务数据[任务id].武器染色组,武器染色方案=任务数据[任务id].武器染色方案,变异=任务数据[任务id].变异,显示饰品=任务数据[任务id].显示饰品,伤害=等级*10+1000,气血=等级*400,灵力=等级*10+500,速度=5.3,防御=等级*6,法防=等级*6,躲闪=等级*5,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型名称范围={"喽啰"}
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    local 模型=Q_随机模型[取随机数(1,5)]
    if 玩家数据[玩家id].角色.数据.种族=="仙" then
      模型=Q_随机模型[取随机数(6,10)]
    elseif 玩家数据[玩家id].角色.数据.种族=="魔" then
      模型=Q_随机模型[取随机数(11,15)]
    end
    武器造型=取天罡星武器造型(模型)
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=玩家数据[玩家id].角色.数据.门派.."弟子",模型=模型,角色=true,武器=取武器数据(武器造型.武器,武器造型.级别),武器染色组=任务数据[任务id].武器染色组,武器染色方案=任务数据[任务id].武器染色方案,显示饰品=true,伤害=等级*8+500,气血=等级*300,灵力=等级*8+300,速度=等级*2.3,防御=等级*6,法防=等级*6,躲闪=等级*5,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取蚩尤幻影信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
    名称="蚩尤幻影"
    ,模型=任务数据[任务id].模型
    ,变异=true
    ,伤害=3500*1.3
    ,气血=(等级*等级*20+400000)*1.3
    ,灵力=等级*8*1.3
    ,速度=等级*6*1.3
    ,防御=等级*6*1.3
    ,法防=等级*6*1.3
    ,躲闪=等级*6*1.3
    ,魔法=等级*10*1.3
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能=取随机法术(5)}
  战斗单位[2]={
    名称="魔族护法"
    ,模型="进阶夜罗刹"
    ,变异=true
    ,伤害=3300*1.3
    ,气血=(等级*等级*15+200000)*1.3
    ,灵力=等级*4*1.3
    ,速度=等级*3*1.3
    ,防御=等级*6*1.3
    ,法防=500
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级神佑复生","高级必杀","高级吸血"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  战斗单位[3]={
    名称="魔族军师"
    ,模型="进阶曼珠沙华"
    ,变异=true
    ,伤害=3300*1.3
    ,气血=(等级*等级*15+200000)*1.3
    ,灵力=等级*4*1.3
    ,速度=等级*3*1.3
    ,防御=等级*6*1.3
    ,法防=500
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级神佑复生","高级必杀","高级吸血"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  战斗单位[4]={
    名称="魔族首领"
    ,模型="进阶蝎子精"
    ,变异=true
    ,伤害=等级*2*1.3
    ,气血=(等级*等级*15+200000)*1.3
    ,灵力=(等级*15+300)*1.3
    ,速度=等级*2*1.3
    ,防御=等级*2*1.3
    ,法防=等级*6*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[5]={
    名称="魔族首领"
    ,模型="进阶蝎子精"
    ,变异=true
    ,伤害=等级*2*1.3
    ,气血=(等级*等级*15+200000)*1.3
    ,灵力=(等级*15+300)*1.3
    ,速度=等级*2*1.3
    ,防御=等级*2*1.3
    ,法防=等级*6*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[6]={
    名称="魔族精英"
    ,模型="进阶混沌兽"
    ,变异=true
    ,伤害=等级*2*1.3
    ,气血=(等级*等级*15+200000)*1.3
    ,灵力=(等级*15+300)*1.3
    ,速度=等级*2*1.3
    ,防御=等级*2*1.3
    ,法防=等级*6*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[7]={
    名称="魔族精英"
    ,模型="进阶琴仙"
    ,变异=true
    ,伤害=600*1.3
    ,气血=(等级*等级*15+150000)*1.3
    ,灵力=等级*4*1.3
    ,速度=800*1.3
    ,防御=等级*3*1.3
    ,法防=等级*0.8*1.3
    ,躲闪=等级*4*1.3
    ,愤怒=99999
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"失心符","定身符","反间之计"}}
  战斗单位[8]={
    名称="魔族精英"
    ,模型="进阶琴仙"
    ,变异=true
    ,伤害=600*1.3
    ,气血=(等级*等级*15+150000)*1.3
    ,灵力=等级*4*1.3
    ,速度=800*1.3
    ,防御=等级*3*1.3
    ,法防=等级*0.8*1.3
    ,躲闪=等级*4*1.3
    ,愤怒=99999
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"失心符","定身符","反间之计"}}
  战斗单位[9]={
    名称="魔族精英"
    ,模型="进阶龙龟"
    ,变异=true
    ,伤害=600*1.3
    ,气血=(等级*等级*25+400000)*1.3
    ,灵力=等级*4*1.3
    ,速度=等级*2.5*1.3
    ,防御=等级*6*1.3
    ,法防=等级*6*1.3
    ,躲闪=等级*4*1.3
    ,愤怒=99999
    ,魔法=200
    ,等级=等级
    ,技能={"高级神佑复生"}
    ,主动技能={"推气过宫","四海升平","罗汉金钟","晶清诀"}}
  战斗单位[10]={
    名称="魔族精英"
    ,模型="进阶蜃气妖"
    ,变异=true
    ,伤害=2300*1.3
    ,气血=(等级*等级*15+150000)*1.3
    ,灵力=等级*2*1.3
    ,速度=等级*4*1.3
    ,防御=等级*5*1.3
    ,法防=等级*0.5*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级神佑复生","高级必杀","高级吸血"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  return 战斗单位
end

function 战斗准备类:取怒天魇信息(任务id,玩家id)
  local 难度 = 1
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+15
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=10000*难度
,气血=10000000*难度
,灵力=5000*难度
,速度=2000*难度
,防御=1000*难度
,法防=100*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=150
,愤怒=99999
,技能={"高级感知"}
,主动技能={"三昧真火","壁垒击破","满天花雨","剑荡四方","天雷斩","破血狂攻","破碎无双"}
}
  战斗单位[2]={
 名称="天魔将军"
,模型="进阶毗舍童子"
,变异=true
,伤害=8000*难度
,气血=1000000*难度
,灵力=200*难度
,速度=1500*难度
,防御=200*难度
,法防=100*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=150
,愤怒=99999
,技能={"高级感知"}
,主动技能={"横扫千军","善恶有报","力劈华山","剑荡四方","天雷斩","破血狂攻","破碎无双"}
}
 战斗单位[3]={
 名称="天魔将军"
,模型="进阶毗舍童子"
,变异=true
,伤害=8000*难度
,气血=1000000*难度
,灵力=200*难度
,速度=1500*难度
,防御=200*难度
,法防=100*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=150
,愤怒=99999
,技能={"高级感知"}
,主动技能={"横扫千军","善恶有报","力劈华山","剑荡四方","天雷斩","破血狂攻","破碎无双"}
}
  战斗单位[4]={
 名称="天魔军师"
,模型="进阶灵符女娲"
,伤害=1000*难度
,气血=1000000*难度
,灵力=5000*难度
,速度=1500*难度
,防御=200*难度
,法防=100*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=150
,技能={"高级魔之心","高级法术连击"}
,主动技能={"龙卷雨击","飞砂走石"}
}
  战斗单位[5]={
 名称="天魔军师"
,模型="进阶灵符女娲"
,伤害=1000*难度
,气血=1000000*难度
,灵力=5000*难度
,速度=1500*难度
,防御=200*难度
,法防=100*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=150
,技能={"高级魔之心","高级法术连击"}
,主动技能={"龙卷雨击","飞砂走石"}
}
  战斗单位[6]={
 名称="天魔先锋"
,模型="进阶灵符女娲"
,伤害=50*难度
,气血=500000*难度
,灵力=50*难度
,速度=1000*难度
,防御=200*难度
,法防=100*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=150
,愤怒=99999
,技能={"高级感知"}
,主动技能={"四海升平","推气过宫","冰清诀","普渡众生"}
}
  战斗单位[7]={
 名称="天魔先锋"
,模型="进阶灵符女娲"
,伤害=50*难度
,气血=500000*难度
,灵力=50*难度
,速度=1000*难度
,防御=200*难度
,法防=100*难度
,躲闪=等级*10*难度
,魔法=等级*10*难度
,等级=150
,愤怒=99999
,技能={"高级感知"}
,主动技能={"四海升平","推气过宫","冰清诀","普渡众生"}
}
  for i=8,10 do
      战斗单位[i]={
    名称="天魔侍卫"
    ,模型="进阶琴仙"
    ,伤害=50*难度
    ,气血=500000*难度
    ,灵力=50*难度
    ,速度=1000*难度
    ,防御=200*难度
    ,法防=100*难度
    ,固定伤害=1600
    ,躲闪=等级*10*难度
    ,魔法=等级*10*难度
    ,等级=150
    ,技能={"高级感知"}
    ,主动技能={"靛沧海","苍茫树","日光华","地裂火","巨岩破","天罗地网","阎罗令","判官令"}
  }
  end
  return 战斗单位
end

function 战斗准备类:取叛军信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 local 模型={"进阶凤凰","进阶蛟龙","进阶鲛人","进阶碧水夜叉","进阶蚌精","进阶雨师","进阶如意仙子","进阶芙蓉仙子","进阶巡游天神","进阶星灵仙子","进阶锦毛貂精","进阶千年蛇魅"}
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*18+500
,气血=等级*等级*4+15000
,灵力=等级*15
,速度=等级*2
,防御=等级*6
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
造型=模型[取随机数(1,#模型)]
  战斗单位[2]={
 名称="被煽动的禁军"
,模型=造型
,变异=true
,伤害=等级*18+300
,气血=等级*等级*2+10000
,灵力=等级*8
,速度=等级*5
,防御=等级*5
,法防=等级*3
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
造型=模型[取随机数(1,#模型)]
 战斗单位[3]={
 名称="被煽动的禁军"
,模型=造型
,变异=true
,伤害=等级*18+30
,气血=等级*等级*2+10000
,灵力=等级*8
,速度=等级*5
,防御=等级*5
,法防=等级*3
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
造型=模型[取随机数(1,#模型)]
  战斗单位[4]={
 名称="被煽动的禁军"
,模型=造型
,伤害=等级*8
,气血=等级*等级*2+10000
,灵力=等级*15
,速度=等级*2
,防御=等级*3
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级魔之心"}
,主动技能=Q_门派法术["魔王寨"]
}
造型=模型[取随机数(1,#模型)]
  战斗单位[5]={
 名称="被煽动的禁军"
,模型=造型
,伤害=等级*8
,气血=等级*等级*2+10000
,灵力=等级*15
,速度=等级*2
,防御=等级*3
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级魔之心"}
,主动技能=Q_门派法术["龙宫"]
}
造型=模型[取随机数(1,#模型)]
  战斗单位[6]={
 名称="被煽动的禁军"
,模型=造型
,伤害=等级*12+300
,气血=等级*等级*2+10000
,灵力=等级*8
,速度=等级*4
,防御=等级*5
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
造型=模型[取随机数(1,#模型)]
  战斗单位[7]={
 名称="被煽动的禁军"
,模型=造型
,伤害=等级*12+300
,气血=等级*等级*2+10000
,灵力=等级*8
,速度=等级*4
,防御=等级*5
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
造型=模型[取随机数(1,#模型)]
  战斗单位[8]={
 名称="被煽动的禁军"
,模型=造型
,伤害=等级*12+300
,气血=等级*等级*2+10000
,灵力=等级*8
,速度=等级*4
,防御=等级*5
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
造型=模型[取随机数(1,#模型)]
 战斗单位[9]={
 名称="被煽动的禁军"
,模型=造型
,伤害=等级*12+300
,气血=等级*等级*2+10000
,灵力=等级*8
,速度=等级*4
,防御=等级*5
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
造型=模型[取随机数(1,#模型)]
  战斗单位[10]={
 名称="被煽动的禁军"
,模型=造型
,伤害=等级*12+300
,气血=等级*等级*2
,灵力=等级*8
,速度=等级*4
,防御=等级*5
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  return 战斗单位
 end

function 战斗准备类:取福利宝箱怪(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
  -- local 等级=任务数据[任务id].等级
  local 模型范围={"虾兵","蟹将"}
  local 名称="秘制麻辣小龙虾"
  模型=模型范围[取随机数(1,#模型范围)]
  if 模型=="蟹将" then
    名称="火爆干锅梭子蟹"
  end
  战斗单位[1]={名称=名称,模型=模型,变异=true,显示饰品=任务数据[任务id].显示饰品,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  模型范围={"海毛虫","大海龟","海星","章鱼"}
  local 模型名称范围={"清蒸","红烧","炭烤","油炸","生吃"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,取随机数(3,5) do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,变异=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取倾国倾城信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,显示饰品=任务数据[任务id].显示饰品,伤害=5000,气血=3000,灵力=5000,速度=800,防御=10000,法防=10000,躲闪=2000,魔法=2000,等级=等级,技能={"高级隐身","嗜血追击","苍鸾怒击","高级连击","高级必杀","高级吸血"},主动技能=取随机法术(5)}
  模型范围={"炎魔神"}
  local 模型名称范围={"抠脚大汉"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,4 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,变异=true,伤害=1500,气血=100000,灵力=800,速度=0,防御=0,法防=5000,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  模型范围={"花妖"}
  local 模型名称范围={"侍女"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=5,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,变异=true,伤害=1500,气血=50000,灵力=0,速度=0,防御=1000,法防=0,躲闪=等级*4,魔法=2000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"四海升平","失魂符"}}
  end
  return 战斗单位
end

function 战斗准备类:取美食专家信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,显示饰品=任务数据[任务id].显示饰品,伤害=1000,气血=5000,灵力=600,速度=0,防御=0,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  模型范围={"山贼","赌徒","强盗"}
  local 模型名称范围={"贪吃的食客"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,变异=true,伤害=1000,气血=5000,灵力=600,速度=0,防御=0,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取通天塔信息(任务id, 玩家id)
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+10
  local 通天塔层数 = 通天塔数据[玩家id].层数
  if 通天塔层数 <= 20 then
    self.难度系数 = 1+通天塔层数/10
  elseif 通天塔层数 <=50 then
    self.难度系数 = 1+通天塔层数/11
  else
      self.难度系数 = 1+通天塔层数/12
  end
  local 战斗单位 = {}
  local 造型=Q_随机模型[取随机数(1,#Q_随机模型)]
  local 武器造型=取天罡星武器造型(造型)
  战斗单位[1] = {
    模型=造型,
    角色=true,
    武器=取武器数据(武器造型.武器,武器造型.级别),
    名称 = "通天"..(通天塔层数+1).."层统领",
    等级 = 等级,
    气血 = 等级 * 等级*5*self.难度系数,
    伤害 = 等级 * 15*self.难度系数,
    灵力 = 等级 * 12*self.难度系数,
    法防 = 等级 * 2*self.难度系数,
    防御 = 等级 * 3.5*self.难度系数,
    速度 = 等级 * 3.5*self.难度系数,
    躲闪 = 等级 * 1 * 0.65,
    魔法 = 20000,
    主动技能 = 取随机法术(5),
    技能 = {"高级神佑复生","高级必杀","高级连击","高级魔之心","高级法术暴击","高级法术连击","高级吸血","高级精神集中","高级感知"}
  }
  local 造型=Q_随机模型[取随机数(1,#Q_随机模型)]
  local 武器造型=取天罡星武器造型(造型)
  战斗单位[2] = {
    模型=造型,
    角色=true,
    武器=取武器数据(武器造型.武器,武器造型.级别),
    名称 = "通天"..(通天塔层数+1).."层守卫",
    等级 = 等级,
    气血 = 等级 * 等级 * 2* self.难度系数,
    伤害 = 等级 * 8*self.难度系数,
    灵力 = 等级 * 7*self.难度系数,
    法防 = 等级 * 2*self.难度系数,
    防御 = 等级 * 2*self.难度系数,
    速度 = 等级 * 2*self.难度系数,
    躲闪 = 等级 * 1 * 0.65,
    魔法 = 20000,
    主动技能 = 取随机法术(5),
    技能 = {"高级神佑复生","高级必杀","高级连击","高级魔之心","高级法术暴击","高级法术连击","高级吸血","高级精神集中","高级感知"}
  }
  local 造型=Q_随机模型[取随机数(1,#Q_随机模型)]
  local 武器造型=取天罡星武器造型(造型)
  战斗单位[3] = {
    模型=造型,
    角色=true,
    武器=取武器数据(武器造型.武器,武器造型.级别),
    名称 = "通天"..(通天塔层数+1).."层守卫",
    等级 = 等级,
    气血 = 等级 * 等级 * 2* self.难度系数,
    伤害 = 等级 * 8*self.难度系数,
    灵力 = 等级 * 7*self.难度系数,
    法防 = 等级 * 2*self.难度系数,
    防御 = 等级 * 3*self.难度系数,
    速度 = 等级 * 2*self.难度系数,
    躲闪 = 等级 * 1 * 0.65,
    魔法 = 20000,
    主动技能 = 取随机法术(5),
    技能 = {"高级神佑复生","高级必杀","高级连击","高级魔之心","高级法术暴击","高级法术连击","高级吸血","高级精神集中","高级感知"}
  }
  local 造型=Q_随机模型[取随机数(1,#Q_随机模型)]
  local 武器造型=取天罡星武器造型(造型)
  战斗单位[4] = {
    模型=造型,
    角色=true,
    武器=取武器数据(武器造型.武器,武器造型.级别),
    名称 = "通天"..(通天塔层数+1).."层守卫",
    等级 = 等级,
    气血 = 等级 * 等级 * 2* self.难度系数,
    伤害 = 等级 * 8*self.难度系数,
    灵力 = 等级 * 12*self.难度系数,
    法防 = 等级 * 2*self.难度系数,
    防御 = 等级 * 2*self.难度系数,
    速度 = 等级 * 2*self.难度系数,
    躲闪 = 等级 * 1 * 0.65,
    魔法 = 20000,
    主动技能 = 取随机法术(5),
    技能 = {"高级神佑复生","高级必杀","高级连击","高级魔之心","高级法术暴击","高级法术连击","高级吸血","高级精神集中","高级感知"}
  }
  local 造型=Q_随机模型[取随机数(1,#Q_随机模型)]
  local 武器造型=取天罡星武器造型(造型)
  战斗单位[5] = {
    模型=造型,
    角色=true,
    武器=取武器数据(武器造型.武器,武器造型.级别),
    名称 = "通天"..(通天塔层数+1).."层守卫",
    等级 = 等级,
    气血 = 等级 * 等级 * 2*self.难度系数,
    伤害 = 等级 * 15*self.难度系数,
    灵力 = 等级 * 12*self.难度系数,
    法防 = 等级 * 2*self.难度系数,
    防御 = 等级 * 3.5*self.难度系数,
    速度 = 等级 * 2*self.难度系数,
    躲闪 = 等级 * 1 * 0.65,
    魔法 = 20000,
    主动技能 = 取随机法术(5),
    技能 = {"高级神佑复生","高级必杀","高级连击","高级魔之心","高级法术暴击","高级法术连击","高级吸血","高级精神集中","高级感知"}
  }
  for n = 6, 10 do
    local 造型=Q_随机模型[取随机数(1,#Q_随机模型)]
    local 武器造型=取天罡星武器造型(造型)
    战斗单位[n] = {
      模型=造型,
      角色=true,
      武器=取武器数据(武器造型.武器,武器造型.级别),
      名称 = "通天"..(通天塔层数+1).."层守卫",
      等级 = 等级,
      气血 = 等级 * 等级 * 2* self.难度系数,
      伤害 = 等级 * 8*self.难度系数,
      灵力 = 等级 * 7*self.难度系数,
      法防 = 等级 * 2*self.难度系数,
      防御 = 等级 * 3*self.难度系数,
      速度 = 等级 * 2*self.难度系数,
      躲闪 = 等级 * 1 * 0.65,
      魔法 = 20000,
      主动技能 = 取随机法术(5),
      技能 = {"高级必杀","高级连击","高级魔之心","高级法术暴击","高级法术连击","高级吸血","高级精神集中","高级感知"}
    }
  end
  return 战斗单位
end

function 战斗准备类:取贼王的线索信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 local 数量=2+取队伍人数(玩家id)
 for n=1,数量 do
    战斗单位[n]={
  名称="帮凶"
  ,模型="骷髅怪"
  ,伤害=1000
  ,气血=30000
  ,灵力=3500
  ,速度=500
  ,防御=0
  ,法防=0
  ,躲闪=等级*2
  ,魔法=200
  ,等级=175
  ,技能={"高级感知"}
  ,主动技能=取随机法术(4)
  }
     end
   战斗单位[1]={
  名称="贼王"
  ,模型="吸血鬼"
  ,伤害=1000
  ,气血=30000
  ,灵力=3500
  ,速度=500
  ,防御=0
  ,法防=0
  ,躲闪=等级*2
  ,魔法=200
  ,等级=175
  ,技能={"高级感知"}
  ,主动技能=取随机法术(3)
  }
  return 战斗单位
end

function 战斗准备类:取貔貅的羁绊信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 local 数量=7
 local 造型范围={"老虎","黑熊"}
 local 造型=造型范围[取随机数(1,#造型范围)]
  for n=1,数量 do
      战斗单位[n]={
    名称="帮凶"
    ,模型=造型
    ,伤害=1100
    ,气血=2000
    ,灵力=0
    ,速度=0
    ,防御=0
    ,法防=0
    ,躲闪=等级*2
    ,魔法=200
    ,等级=175
    ,技能={"高级鬼魂术"}
    ,主动技能=取随机法术(4)
    }
  end
  战斗单位[1]={
    名称="貔貅"
    ,模型="帮派妖兽"
    ,伤害=2000
    ,气血=10000
    ,灵力=0
    ,速度=0
    ,防御=3000
    ,法防=0
    ,躲闪=等级*2
    ,魔法=200
    ,等级=175
    ,技能={"高级感知"}
    ,主动技能=取随机法术(3)
  }
  return 战斗单位
end

function 战斗准备类:取水陆桃木虫信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称="桃木虫",模型="海毛虫",变异=true,伤害=1000,气血=5000,灵力=600,速度=0,防御=0,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  模型范围={"蝴蝶仙子"}
  local 模型名称范围={"桃木虫喽罗"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,3 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,变异=true,伤害=800,气血=5000,灵力=600,速度=0,防御=0,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取水陆泼猴信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,伤害=800,气血=5000,灵力=600,速度=0,防御=0,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  模型范围={"长眉灵猴"}
  local 模型名称范围={"猴虱"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,3 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=800,气血=5000,灵力=600,速度=0,防御=0,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取水陆翼虎必死信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,伤害=9999999,气血=1000000000000,灵力=99999999,速度=99999999,防御=999999999,法防=99999999,躲闪=99999999,魔法=2000,等级=等级,技能={"高级魔之心","高级法术连击","高级法术暴击"},主动技能={"龙卷雨击","飞砂走石","三昧真火"}}
  模型范围={"老虎"}
  local 模型名称范围={"虎军师"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,3 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,变异=true,伤害=9999999,气血=1000000000000,灵力=99999999,速度=99999999,防御=999999999,法防=99999999,躲闪=99999999,魔法=2000,等级=等级,技能={"高级魔之心","高级法术连击","高级法术暴击"},主动技能={"龙卷雨击","飞砂走石","三昧真火"}}
  end
  return 战斗单位
end

function 战斗准备类:取水陆蝰蛇必死信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,伤害=9999999,气血=1000000000000,灵力=99999999,速度=99999999,防御=999999999,法防=99999999,躲闪=99999999,魔法=2000,等级=等级,技能={"高级魔之心","高级法术连击","高级法术暴击"},主动技能={"龙卷雨击","飞砂走石","三昧真火"}}
  模型范围={"灵符女娲"}
  local 模型名称范围={"蛇军师"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,3 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,变异=true,伤害=9999999,气血=1000000000000,灵力=99999999,速度=99999999,防御=999999999,法防=99999999,躲闪=99999999,魔法=2000,等级=等级,技能={"高级魔之心","高级法术连击","高级法术暴击"},主动技能={"龙卷雨击","飞砂走石","三昧真火"}}
  end
  return 战斗单位
end

function 战斗准备类:取水陆翼虎信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,伤害=等级*20+500,气血=等级*等级*10,灵力=等级*10+500,速度=等级*8,防御=等级*8,法防=等级*8,躲闪=等级*8,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  模型范围={"老虎"}
  local 模型名称范围={"虎精兵"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*15+500,气血=等级*等级*6,灵力=等级*10+500,速度=等级*4,防御=等级*4,法防=等级*4,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级魔之心","高级法术连击","高级法术暴击"},主动技能={"龙卷雨击","飞砂走石","三昧真火"}}
  end
  return 战斗单位
end

function 战斗准备类:取水陆蝰蛇信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,伤害=等级*20+500,气血=等级*等级*10,灵力=等级*10+500,速度=等级*8,防御=等级*8,法防=等级*8,躲闪=等级*8,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  模型范围={"灵符女娲"}
  local 模型名称范围={"蛇精兵"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*15+500,气血=等级*等级*6,灵力=等级*10+500,速度=等级*4,防御=等级*4,法防=等级*4,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取水陆巡山小妖信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,伤害=等级*20+500,气血=等级*等级*10,灵力=等级*10+500,速度=等级*8,防御=等级*8,法防=等级*8,躲闪=等级*8,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  模型范围={"雷鸟人"}
  local 模型名称范围={"巡山喽啰"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,7 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*15+500,气血=等级*等级*6,灵力=等级*10+500,速度=等级*4,防御=等级*4,法防=等级*4,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取水陆毒虫信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,伤害=等级*20+500,气血=等级*等级*10,灵力=等级*10+500,速度=等级*8,防御=等级*8,法防=等级*8,躲闪=等级*8,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  模型范围={"海毛虫"}
  local 模型名称范围={"毒虫"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*15+500,气血=等级*等级*6,灵力=等级*10+500,速度=等级*4,防御=等级*4,法防=等级*4,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取水陆上古妖兽头领信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,伤害=等级*20+500,气血=等级*等级*10,灵力=等级*10+500,速度=等级*8,防御=等级*8,法防=等级*8,躲闪=等级*8,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  模型范围={"吸血鬼"}
  local 模型名称范围={"妖巫师"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,2 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*15+500,气血=等级*等级*6,灵力=等级*10+500,速度=等级*4,防御=等级*4,法防=等级*4,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级隐身"},主动技能=取随机法术(5)}
  end
  模型范围={"蜘蛛精"}
  local 模型名称范围={"妖兽精兵"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=3,7 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*15+500,气血=等级*等级*6,灵力=等级*10+500,速度=等级*4,防御=等级*4,法防=等级*4,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取水陆妖将军信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,伤害=等级*20+500,气血=等级*等级*10,灵力=等级*10+500,速度=等级*8,防御=等级*8,法防=等级*8,躲闪=等级*8,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  模型范围={"蜘蛛精"}
  local 模型名称范围={"护法金刚"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,6 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*15+500,气血=等级*等级*6,灵力=等级*10+500,速度=等级*4,防御=等级*4,法防=等级*4,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  end
  模型范围={"幽灵"}
  local 模型名称范围={"妖护法"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=7,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*15+500,气血=等级*等级*6,灵力=等级*10+500,速度=等级*4,防御=等级*4,法防=等级*4,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级隐身"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取水陆魑魅魍魉信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,伤害=等级*20+500,气血=等级*等级*10,灵力=等级*10+500,速度=等级*8,防御=等级*8,法防=等级*8,躲闪=等级*8,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  模型范围={"百足将军"}
  local 模型名称范围={"妖王护法"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,3 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*15+500,气血=等级*等级*6,灵力=等级*10+500,速度=等级*4,防御=等级*4,法防=等级*4,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  end
  模型范围={"黑熊精"}
  local 模型名称范围={"妖护卫"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=4,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*15+500,气血=等级*等级*6,灵力=等级*10+500,速度=等级*4,防御=等级*4,法防=等级*4,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取魔域魔兵信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,伤害=4000,气血=300000,灵力=0,速度=0,防御=1000,法防=0,躲闪=等级*8,魔法=2000,等级=等级,技能={"高级连击","高级吸血","高级必杀"},主动技能={"横扫千军","善恶有报","浪涌","天雷斩"}}
  模型范围={"毗舍童子"}
  local 模型名称范围={"魔域副将"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"浪涌"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,3 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=1700,气血=20000,灵力=1700,速度=0,防御=1000,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级魔之心"},主动技能={"飞砂走石","龙卷雨击","三昧真火","落叶萧萧"}}
  end
  return 战斗单位
end

function 战斗准备类:取捣乱的年兽信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*18+500
,气血=等级*等级*4+15000
,灵力=等级*15
,速度=等级*2
,防御=等级*6
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="赤金蛟龙"
,模型="蛟龙"
,变异=true
,伤害=等级*18+300
,气血=等级*等级*2+10000
,灵力=等级*8
,速度=等级*5
,防御=等级*5
,法防=等级*3
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
 战斗单位[3]={
 名称="赤金蛟龙"
,模型="蛟龙"
,变异=true
,伤害=等级*18+30
,气血=等级*等级*2+10000
,灵力=等级*8
,速度=等级*5
,防御=等级*5
,法防=等级*3
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
  战斗单位[4]={
 名称="碧玉王八"
,模型="龙龟"
,变异=true
,伤害=等级*8
,气血=等级*等级*2+10000
,灵力=等级*15
,速度=等级*2
,防御=等级*3
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级魔之心"}
,主动技能=Q_门派法术["魔王寨"]
}
  战斗单位[5]={
 名称="碧玉王八"
,模型="龙龟"
,变异=true
,伤害=等级*8
,气血=等级*等级*2+10000
,灵力=等级*15
,速度=等级*2
,防御=等级*3
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级魔之心"}
,主动技能=Q_门派法术["龙宫"]
}
  战斗单位[6]={
 名称="闹事妖精"
,模型="兔子怪"
,变异=true
,伤害=等级*12+300
,气血=等级*等级*2+10000
,灵力=等级*8
,速度=等级*4
,防御=等级*5
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="闹事妖精"
,模型="兔子怪"
,变异=true
,伤害=等级*12+300
,气血=等级*等级*2+10000
,灵力=等级*8
,速度=等级*4
,防御=等级*5
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="闹事妖精"
,模型="兔子怪"
,变异=true
,伤害=等级*12+300
,气血=等级*等级*2+10000
,灵力=等级*8
,速度=等级*4
,防御=等级*5
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[9]={
 名称="闹事妖精"
,模型="兔子怪"
,变异=true
,伤害=等级*12+300
,气血=等级*等级*2+10000
,灵力=等级*8
,速度=等级*4
,防御=等级*5
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[10]={
 名称="闹事妖精"
,模型="兔子怪"
,变异=true
,伤害=等级*12+300
,气血=等级*等级*2
,灵力=等级*8
,速度=等级*4
,防御=等级*5
,法防=等级*5
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  return 战斗单位
 end

 function 战斗准备类:取年兽王信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*18+1000
,气血=等级*等级*8+35000
,灵力=等级*15
,速度=等级*4
,防御=等级*7
,法防=等级*7
,躲闪=等级*6
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="福瑞灵兽"
,模型="毗舍童子"
,变异=true
,伤害=等级*18+800
,气血=等级*等级*6+30000
,灵力=等级*10
,速度=等级*5
,防御=等级*6
,法防=等级*3
,躲闪=等级*5
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
 战斗单位[3]={
 名称="福瑞灵兽"
,模型="毗舍童子"
,变异=true
,伤害=等级*18+800
,气血=等级*等级*6+30000
,灵力=等级*10
,速度=等级*5
,防御=等级*6
,法防=等级*4
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
  战斗单位[4]={
 名称="福祉灵兽"
,模型="炎魔神"
,变异=true
,伤害=等级*10+800
,气血=等级*等级*6+30000
,灵力=等级*15
,速度=等级*2
,防御=等级*3
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能=Q_门派法术["魔王寨"]
}
  战斗单位[5]={
 名称="福祉灵兽"
,模型="炎魔神"
,变异=true
,伤害=等级*10+800
,气血=等级*等级*6+30000
,灵力=等级*15
,速度=等级*2
,防御=等级*3
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能=Q_门派法术["龙宫"]
}
  战斗单位[6]={
 名称="护宝灵使"
,模型="大力金刚"
,变异=true
,伤害=等级*10+800
,气血=等级*等级*5+15000
,灵力=等级*10
,速度=等级*3
,防御=等级*4
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="护宝灵使"
,模型="大力金刚"
,变异=true
,伤害=等级*12+800
,气血=等级*等级*5+15000
,灵力=等级*10
,速度=等级*3
,防御=等级*4
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="护宝灵使"
,模型="大力金刚"
,变异=true
,伤害=等级*12+800
,气血=等级*等级*5+15000
,灵力=等级*10
,速度=等级*3
,防御=等级*4
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[9]={
 名称="护宝灵使"
,模型="大力金刚"
,变异=true
,伤害=等级*16+800
,气血=等级*等级*5+15000
,灵力=等级*10
,速度=等级*3
,防御=等级*4
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[10]={
 名称="护宝灵使"
,模型="大力金刚"
,变异=true
,伤害=等级*16+800
,气血=等级*等级*5+15000
,灵力=等级*10
,速度=等级*3
,防御=等级*4
,法防=等级*6
,躲闪=等级*10
,魔法=等级*10
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  return 战斗单位
end

function 战斗准备类:取怨灵幻影信息(任务id,玩家id)
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  local 战斗单位={}
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,变异=true
,伤害=等级*12*2+800
,气血=等级*等级*5*2+45000
,灵力=等级*8*2
,速度=等级*3.5*2
,防御=等级*5*2
,法防=等级*5*2
,躲闪=等级*6*2
,魔法=等级*6*2
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="怨灵幻影"
,模型="超级神龙"
,变异=true
,伤害=等级*10*2+800
,气血=等级*等级*4*2+30000
,灵力=等级*3*2
,速度=等级*3.5*2
,防御=等级*4*2
,法防=等级*2*2
,躲闪=等级*4*2
,魔法=等级*4*2
,等级=等级
,技能={"高级感知"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
 战斗单位[3]={
 名称="怨灵幻影"
,模型="超级神兔"
,变异=true
,伤害=等级*10*2+800
,气血=等级*等级*4*2+30000
,灵力=等级*3*2
,速度=等级*3.5*2
,防御=等级*4*2
,法防=等级*2*2
,躲闪=等级*4*2
,魔法=等级*4*2
,等级=等级
,技能={"高级感知"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
  战斗单位[4]={
 名称="怨灵幻影"
,模型="超级神羊"
,变异=true
,伤害=等级*5*2
,气血=等级*等级*4*2+30000
,灵力=等级*8*2+300
,速度=等级*1.5*2
,防御=等级*2*2
,法防=等级*4*2
,躲闪=等级*4*2
,魔法=等级*4*2
,等级=等级
,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"三昧真火","地狱烈火","飞砂走石"}
}
     战斗单位[5]={
 名称="怨灵幻影"
,模型="超级神牛"
,变异=true
,伤害=等级*5*2
,气血=等级*等级*4*2+30000
,灵力=等级*8*2+300
,速度=等级*1.5*2
,防御=等级*2*2
,法防=等级*4*2
,躲闪=等级*4*2
,魔法=等级*4*2
,等级=等级
,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"龙卷雨击","龙腾","龙吟","二龙戏珠"}
}
战斗单位[6]={
 名称="怨灵幻影"
,模型="超级神猴"
,变异=true
,伤害=等级*5*2
,气血=等级*等级*4*2+30000
,灵力=等级*8*2+300
,速度=等级*1.5*2
,防御=等级*2*2
,法防=等级*4*2
,躲闪=等级*4*2
,魔法=等级*4*2
,等级=等级
,技能={"高级神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"落叶萧萧","雷击","奔雷咒"}
}
 战斗单位[7]={
 名称="怨灵幻影"
,模型="超级人参娃娃"
,变异=true
,伤害=等级*5*2
,气血=等级*等级*4*2+20000
,灵力=等级*8*2
,速度=等级*5*2
,防御=等级*3*2
,法防=等级*4*2
,躲闪=等级*5*2
,魔法=等级*5*2
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
 战斗单位[8]={
 名称="怨灵幻影"
,模型="超级土地公公"
,变异=true
,伤害=等级*5*2
,气血=等级*等级*4*2+20000
,灵力=等级*8*2
,速度=等级*5*2
,防御=等级*3*2
,法防=等级*4*2
,躲闪=等级*5*2
,魔法=等级*5*2
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
 战斗单位[9]={
 名称="怨灵幻影"
,模型="超级神蛇"
,变异=true
,伤害=等级*5*2
,气血=等级*等级*8*2+20000
,灵力=等级*8*2
,速度=等级*2.5*2
,防御=等级*8*2
,法防=等级*6*2
,躲闪=等级*8*2
,魔法=等级*5*2
,等级=等级
,技能={"高级神佑复生"}
,愤怒=99999
,主动技能={"推气过宫","金刚护体","普渡众生","金刚护法","晶清诀","罗汉金钟","四海升平"}
}
 战斗单位[10]={
 名称="怨灵幻影"
,模型="超级麒麟"
,变异=true
,伤害=等级*12*2+1000
,气血=等级*等级*4*2+20000
,灵力=等级*4*2
,速度=等级*3.5*2
,防御=等级*4*2
,法防=等级*3*2
,躲闪=等级*5*2
,魔法=等级*5*2
,等级=等级
,技能={"高级隐身","高级神佑复生"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
  return 战斗单位
end

function 战斗准备类:取灵感分身信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+20
  战斗单位[1]={
名称="灵感分身"
,模型="神天兵"
,角色=true
,武器=取武器数据("雷神",100)
,伤害=等级*12+500
,气血=等级*1000
,灵力=等级*7+500
,速度=等级*4.5
,防御=等级*4
,法防=等级*0.8
,躲闪=等级*4
,魔法=200
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  return 战斗单位
end

function 战斗准备类:取通天河妖信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*7+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"蚌精","鲛人","碧水夜叉","大海龟","章鱼","虾兵","蟹将","海星"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称="河妖",模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取通天散财童子信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*7+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"净瓶女娲"}
  local 名称范围={"炎上","润下","稼穑"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取通天黑熊精信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*7+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"净瓶女娲"}
  local 名称范围={"炎上","润下","稼穑"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取通天五色竹条信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称="竹精",模型="泡泡",显示饰品=任务数据[任务id].显示饰品,伤害=等级*7+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"泡泡"}
  local 名称范围={"竹精"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取通天金鱼将军1信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称="红色鱼精",模型="野鬼",显示饰品=任务数据[任务id].显示饰品,变异=true,伤害=等级*7+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"蚌精","龟丞相"}
  local 名称范围={"通天妖将","通天师爷"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取通天金鱼将军2信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称="黄色鱼精",模型="地狱战神",显示饰品=任务数据[任务id].显示饰品,变异=true,伤害=等级*7+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"虾兵","龟丞相"}
  local 名称范围={"通天妖将","通天师爷"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取通天金鱼将军3信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称="黑色鱼精",模型="鬼将",显示饰品=任务数据[任务id].显示饰品,变异=true,伤害=等级*7+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"虾兵","龟丞相"}
  local 名称范围={"通天妖将","通天师爷"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取通天金鱼将军4信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称="白色鱼精",模型="鲛人",显示饰品=任务数据[任务id].显示饰品,变异=true,伤害=等级*7+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"蟹将","龟丞相"}
  local 名称范围={"通天妖将","通天师爷"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取通天金鱼将军5信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称="蓝色鱼精",模型="蚌精",显示饰品=任务数据[任务id].显示饰品,变异=true,伤害=等级*7+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"蟹将","龟丞相"}
  local 名称范围={"通天妖将","通天师爷"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取通天灵感大王信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+20
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,角色=true,武器=取武器数据("雷神",100),显示饰品=任务数据[任务id].显示饰品,变异=true,伤害=等级*7+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  for i=2,5 do
      战斗单位[i]={
    名称="灵感分身"
    ,模型="神天兵"
    ,角色=true
    ,武器=取武器数据("雷神",100)
    ,伤害=等级*12+500
    ,气血=等级*1000
    ,灵力=等级*7+500
    ,速度=等级*4.5
    ,防御=等级*4
    ,法防=等级*0.8
    ,躲闪=等级*4
    ,魔法=200
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能=取随机法术(5)
    }
  end
  等级=等级-10
  local 模型范围={"蟹将","龟丞相"}
  local 名称范围={"通天妖将","通天师爷"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=6,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取魔族先锋信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,变异=true,伤害=等级*7+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"鼠先锋","野猪精","百足将军","鲛人","碧水夜叉"}
  local 名称范围={"魔族先锋"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,7 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取魔族头目信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,变异=true,伤害=等级*7+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"鼠先锋","野猪精","百足将军","鲛人","碧水夜叉"}
  local 名称范围={"魔族勇士"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取魔族将军信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,变异=true,伤害=等级*7+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"鼠先锋","野猪精","百足将军","鲛人","碧水夜叉"}
  local 名称范围={"魔族亲兵"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取魔族BOSS信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,变异=true,伤害=等级*7+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"进阶曼珠沙华","进阶蝎子精"}
  local 名称范围={"魔族军师"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,3 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  模型范围={"进阶琴仙","进阶千年蛇魅"}
  名称范围={"魔族将军"}
  模型=模型范围[取随机数(1,#模型范围)]
  名称=名称范围[取随机数(1,#名称范围)]
  技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  技能随机=技能范围[取随机数(1,#技能范围)]
  for i=4,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  模型范围={"进阶碧水夜叉","进阶锦毛貂精","进阶龙龟","进阶夜罗刹","进阶野猪精","进阶吸血鬼"}
  名称范围={"魔族亲兵"}
  模型=模型范围[取随机数(1,#模型范围)]
  名称=名称范围[取随机数(1,#名称范围)]
  技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  技能随机=技能范围[取随机数(1,#技能范围)]
  for i=6,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取商人的鬼魂信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=10
  战斗单位[1]={名称="商人的鬼魂",模型="野鬼",显示饰品=true,变异=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=8
  local 模型范围={"虾兵","蟹将","海毛虫"}
  local 模型名称范围={"喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取妖风信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=10
  战斗单位[1]={名称="妖风",模型="吸血鬼",显示饰品=true,变异=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=8
  local 模型范围={"虾兵","蟹将","海毛虫"}
  local 模型名称范围={"喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取僵尸虎子信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=10
  战斗单位[1]={名称="僵尸虎子",模型="僵尸",显示饰品=true,变异=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=8
  local 模型范围={"幽灵","骷髅怪"}
  local 模型名称范围={"海边妖怪","海边恶灵"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,3 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取白鹿精信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=25
  战斗单位[1]={名称="白鹿精",模型="赌徒",显示饰品=true,变异=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=23
  local 模型范围={"狐狸精"}
  local 模型名称范围={"玉面狐狸"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,2 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  local 模型范围={"赌徒","强盗","狐狸精"}
  local 模型名称范围={"帮凶"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=3,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取玉面狐狸信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=25
  战斗单位[1]={名称="玉面狐狸",模型="狐狸精",显示饰品=true,变异=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=23
  local 模型范围={"赌徒"}
  local 模型名称范围={"白鹿精"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,2 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  local 模型范围={"赌徒","强盗","狐狸精"}
  local 模型名称范围={"帮凶"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=3,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取酒肉和尚1信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=25
  战斗单位[1]={名称="酒肉和尚",模型="雨师",显示饰品=true,变异=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=23
  local 模型范围={"强盗","赌徒"}
  local 模型名称范围={"恶僧帮凶"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,3 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取守门天将信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=25
  战斗单位[1]={名称="守门天将",模型="天兵",显示饰品=true,变异=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=23
  local 模型范围={"天兵"}
  local 模型名称范围={"守门天兵"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,7 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取白琉璃信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=25
  战斗单位[1]={名称="白琉璃",模型="星灵仙子",显示饰品=true,变异=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=23
  local 模型范围={"星灵仙子","雨师","强盗","赌徒","山贼"}
  local 模型名称范围={"帮凶"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,7 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取酒肉和尚信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=25
  战斗单位[1]={名称="酒肉和尚",模型="雨师",显示饰品=true,变异=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=23
  local 模型范围={"雨师"}
  local 模型名称范围={"恶僧帮凶"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取幽冥鬼信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=40
  战斗单位[1]={名称="幽冥鬼",模型="巡游天神",显示饰品=true,变异=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=35
  local 模型范围={"僵尸","骷髅怪"}
  local 模型名称范围={"喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取衙门守卫信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=40
  战斗单位[1]={名称="衙门守卫",模型="护卫",显示饰品=true,变异=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=35
  local 模型范围={"护卫"}
  local 模型名称范围={"衙门守卫"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取虾兵信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=40
  战斗单位[1]={名称="虾兵",模型="虾兵",显示饰品=true,变异=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=35
  local 模型范围={"虾兵","蟹将"}
  local 模型名称范围={"小喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取山神信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=40
  战斗单位[1]={名称="山神",模型="雨师",显示饰品=true,变异=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=35
  local 模型范围={"虾兵","蟹将","雨师"}
  local 模型名称范围={"小喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取蟹将军信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=40
  战斗单位[1]={名称="蟹将军",模型="蟹将",显示饰品=true,变异=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=35
  local 模型范围={"虾兵","蟹将"}
  local 模型名称范围={"水族侍卫"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取假刘洪信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=40
  战斗单位[1]={名称="刘洪",模型="护卫",显示饰品=true,变异=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=35
  local 模型范围={"护卫"}
  local 模型名称范围={"衙役"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取假李彪信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=40
  战斗单位[1]={名称="李彪",模型="强盗",显示饰品=true,变异=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=35
  local 模型范围={"强盗","山贼","赌徒"}
  local 模型名称范围={"喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取李彪信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=40
  战斗单位[1]={名称="李彪",模型="骷髅怪",显示饰品=true,变异=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=35
  local 模型范围={"野鬼"}
  local 模型名称范围={"野鬼喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取天兵飞剑信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=55
  战斗单位[1]={名称="天兵飞剑",模型="天兵",显示饰品=true,变异=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=50
  local 模型范围={"天兵"}
  local 模型名称范围={"天兵天将"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,6 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取卷帘大将心魔信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=55
  战斗单位[1]={名称="卷帘大将（心魔）",模型="沙僧",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=50
  local 模型范围={"天兵"}
  local 模型名称范围={"天兵喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,6 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取卷帘大将心魔必败信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=55
  战斗单位[1]={名称="卷帘大将（心魔）",模型="沙僧",伤害=9999999,气血=1000000000000,灵力=99999999,速度=99999999,防御=999999999,法防=99999999,躲闪=99999999,魔法=2000,等级=等级,技能={"高级魔之心","高级法术连击","高级法术暴击"},主动技能={"龙卷雨击","飞砂走石","三昧真火"}}
  等级=50
  local 模型范围={"天兵"}
  local 模型名称范围={"天兵喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,6 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=9999999,气血=1000000000000,灵力=99999999,速度=99999999,防御=999999999,法防=99999999,躲闪=99999999,魔法=2000,等级=等级,技能={"高级魔之心","高级法术连击","高级法术暴击"},主动技能={"龙卷雨击","飞砂走石","三昧真火"}}
  end
  return 战斗单位
end

function 战斗准备类:取路人甲信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=55
  战斗单位[1]={名称="路人甲",模型="赌徒",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=50
  local 模型范围={"赌徒"}
  local 模型名称范围={"帮凶"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,6 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取哪吒信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=55
  战斗单位[1]={名称="哪吒",模型="小毛头",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=50
  local 模型范围={"天兵"}
  local 模型名称范围={"天兵天将"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,7 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取心魔守门天将信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=55
  战斗单位[1]={名称="守门天将",模型="天兵",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=50
  local 模型范围={"天兵"}
  local 模型名称范围={"天兵天将"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取龙孙信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=55
  战斗单位[1]={名称="龙孙",模型="蛟龙",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=50
  local 模型范围={"虾兵","蟹将"}
  local 模型名称范围={"虾兵蟹将"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取龙女信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=55
  战斗单位[1]={名称="小龙女",模型="小龙女",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=50
  local 模型范围={"虾兵","蟹将"}
  local 模型名称范围={"虾兵蟹将"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取卷帘大将真心魔信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=55
  战斗单位[1]={名称="卷帘大将",模型="沙僧",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=50
  local 模型范围={"天兵"}
  local 模型名称范围={"天兵喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取女妖信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=55
  战斗单位[1]={名称="女妖",模型="芙蓉仙子",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=50
  local 模型范围={"芙蓉仙子"}
  local 模型名称范围={"芙蓉仙子喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,7 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取金琉璃信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=55
  战斗单位[1]={名称="金琉璃",模型="如意仙子",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=50
  local 模型范围={"芙蓉仙子"}
  local 模型名称范围={"芙蓉仙子喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取翻天怪信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=60
  战斗单位[1]={名称="翻天怪",模型="地狱战神",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=50
  local 模型范围={"白熊","古代瑞兽","地狱战神","黑山老妖"}
  local 模型名称范围={"喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取姚太尉信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=60
  战斗单位[1]={名称="姚太尉",模型="天兵",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=50
  local 模型范围={"天兵"}
  local 模型名称范围={"天兵喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取王母凤凰信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=60
  战斗单位[1]={名称="王母的凤凰",模型="凤凰",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=50
  local 模型范围={"凤凰"}
  local 模型名称范围={"凤凰喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取小白龙信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=75
  战斗单位[1]={名称="小白龙",模型="蛟龙",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=70
  local 模型范围={"小龙女"}
  local 模型名称范围={"小龙女喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取梦之魅信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=75
  战斗单位[1]={名称="梦之魅",模型="僵尸",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=70
  local 模型范围={"僵尸","骷髅怪"}
  local 模型名称范围={"喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取血之魅信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=75
  战斗单位[1]={名称="血之魅",模型="僵尸",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=70
  local 模型范围={"僵尸","骷髅怪"}
  local 模型名称范围={"喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取森之魅信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=75
  战斗单位[1]={名称="森之魅",模型="僵尸",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=70
  local 模型范围={"僵尸","骷髅怪"}
  local 模型名称范围={"喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取奔波儿灞信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=75
  战斗单位[1]={名称="奔波儿灞",模型="蛤蟆精",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=70
  local 模型范围={"蛤蟆精","虾兵","蟹将"}
  local 模型名称范围={"喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取蟹将军1信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=75
  战斗单位[1]={名称="蟹将军",模型="蟹将",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=70
  local 模型范围={"蛤蟆精","虾兵","蟹将"}
  local 模型名称范围={"喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取虾将军信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=75
  战斗单位[1]={名称="虾将军",模型="虾兵",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=70
  local 模型范围={"蛤蟆精","虾兵","蟹将"}
  local 模型名称范围={"喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取龙须草战斗信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=75
  战斗单位[1]={名称="天兵天将",模型="天兵",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=70
  local 模型范围={"天兵"}
  local 模型名称范围={"天兵天将"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取万圣公主信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=75
  战斗单位[1]={名称="万圣公主",模型="小龙女",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=70
  local 模型范围={"蛤蟆精","虾兵","蟹将"}
  local 模型名称范围={"喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取牛魔王亲卫信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=75
  战斗单位[1]={名称="牛魔亲卫",模型="牛妖",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=70
  local 模型范围={"牛妖"}
  local 模型名称范围={"牛魔亲兵"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取九头精怪信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=75
  战斗单位[1]={名称="九头精怪",模型="九头精怪",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=70
  local 模型范围={"蛤蟆精"}
  local 模型名称范围={"精怪喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取玉帝亲兵信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=75
  战斗单位[1]={名称="天兵天将",模型="天兵",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=70
  local 模型范围={"天兵"}
  local 模型名称范围={"天兵天将"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取千年怨鬼信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=80
  战斗单位[1]={名称="千年怨鬼",模型="幽灵",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=75
  local 模型范围={"吸血鬼","黑山老妖","鬼将","僵尸"}
  local 模型名称范围={"天兵天将"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型.."喽啰",模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取春十三娘信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=80
  战斗单位[1]={名称="春十三娘",模型="蜘蛛精",变异=true,显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=75
  local 模型范围={"骷髅怪","黑山老妖","蜘蛛精"}
  local 模型名称范围={"天兵天将"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型.."喽啰",模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取康太尉信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=80
  战斗单位[1]={名称="康太尉",模型="天兵",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=75
  local 模型范围={"天兵"}
  local 模型名称范围={"天兵天将"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取高小姐信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=80
  战斗单位[1]={名称="家丁",模型="强盗",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=75
  local 模型范围={"强盗"}
  local 模型名称范围={"家丁"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取冤魂信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=80
  战斗单位[1]={名称="冤魂",模型="僵尸",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=75
  local 模型范围={"骷髅怪","僵尸"}
  local 模型名称范围={"喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取杨戬信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=80
  战斗单位[1]={名称="哮天犬",模型="哮天犬",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=75
  local 模型范围={"天兵"}
  local 模型名称范围={"天兵天将"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取龙神信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=80
  战斗单位[1]={名称="龙神",模型="蛟龙",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=75
  local 模型范围={"蛟龙"}
  local 模型名称范围={"喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取吊死鬼信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=90
  战斗单位[1]={名称="吊死鬼",模型="野鬼",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=85
  local 模型范围={"野鬼","僵尸","骷髅怪"}
  local 模型名称范围={"喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取青玄仙子信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=90
  战斗单位[1]={名称="青玄仙子",模型="星灵仙子",显示饰品=true,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  等级=85
  local 模型范围={"星灵仙子"}
  local 模型名称范围={"喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=0,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

return 战斗准备类