--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2020-09-20 21:11:35
-- 梦幻西游游戏资源破解 baidwwy@vip.qq.com(313738139) 老毕   和 C++PrimerPlus 717535046 这俩位大神破解所以资源
--======================================================================--
local 商店处理类 = class()

function 商店处理类:初始化()
	local n = {}
		n[1] = {"红缨枪","曲尖枪","锯齿矛","乌金三叉戟","火焰枪","墨杆金钩","玄铁矛","金蛇信","丈八点钢矛","暗夜","梨花","霹雳","刑天之逆","五虎断魂","飞龙在天","天龙破城","弑皇"}
		n[2] = {"青铜斧","开山斧","双面斧","双弦钺","精钢禅钺","黄金钺","乌金鬼头镰","狂魔镰","恶龙之齿","破魄","肃魂","无敌","五丁开山","元神禁锢","护法灭魔","碧血干戚","裂天"}
		n[3] = {"青铜短剑","铁齿剑","吴越剑","青锋剑","龙泉剑","黄金剑","游龙剑","北斗七星剑","碧玉剑","鱼肠","倚天","湛卢","魏武青虹","灵犀神剑","四法青云","霜冷九州","擒龙"}
		n[4] = {"双短剑","镔铁双剑","龙凤双剑","竹节双剑","狼牙双剑","鱼骨双剑","赤焰双剑","墨玉双剑","梅花双剑","阴阳","月光双剑","灵蛇","金龙双剪","连理双树","祖龙对剑","紫电青霜","浮犀"}
		n[5] = {"五色缎带","幻彩银纱","金丝彩带","无极丝","天蚕丝带","云龙绸带","七彩罗刹","缚神绫","九天仙绫","彩虹","流云","碧波","秋水落霞","晃金仙绳","此最相思","揽月摘星","九霄"}
		n[6] = {"铁爪","天狼爪","幽冥鬼爪","青龙牙","勾魂爪","玄冰刺","青刚刺","华光刺","龙鳞刺","撕天","毒牙","胭脂","九阴勾魂","雪蚕之刺","贵霜之牙","忘川三途","离钩"}
		n[7] = {"折扇","铁骨扇","精钢扇","铁面扇","百折扇","劈水扇","神火扇","阴风扇","风云雷电","太极","玉龙","秋风","画龙点睛","秋水人家","逍遥江湖","浩气长舒","星瀚"}
		n[8] = {"细木棒","金丝魔棒","玉如意","点金棒","云龙棒","幽路引魂","满天星","水晶棒","日月光华","沧海","红莲","盘龙","降魔玉杵","青藤玉树","墨玉骷髅","丝萝乔木","醍醐"}
		n[9] = {"松木锤","镔铁锤","八棱金瓜","狼牙锤","烈焰锤","破甲战锤","震天锤","巨灵神锤","天崩地裂","八卦","鬼牙","雷神","混元金锤","九瓣莲花","鬼王蚀日","狂澜碎岳","碎寂"}
		n[10] = {"牛皮鞭","牛筋鞭","乌龙鞭","钢结鞭","蛇骨鞭","玉竹金铃","青藤柳叶鞭","雷鸣嗜血鞭","混元金钩","龙筋","百花","吹雪","游龙惊鸿","仙人指路","血之刺藤","牧云清歌","霜陨"}
		n[11] = {"黄铜圈","精钢日月圈","离情环","金刺轮","风火圈","赤炎环","蛇形月","子母双月","斜月狼牙","如意","乾坤","月光双环","别情离恨","金玉双环","九天金线","无关风月","朝夕"}
		n[12] = {"柳叶刀","苗刀","夜魔弯刀","金背大砍刀","雁翅刀","破天宝刀","狼牙刀","龙鳞宝刀","黑炎魔刀","冷月","屠龙","血刃","偃月青龙","晓风残月","斩妖泣血","业火三灾","鸣鸿"}
		n[13] = {"曲柳杖","红木杖","白椴杖","墨铁拐","玄铁牛角杖","鹰眼法杖","腾云杖","引魂杖","碧玺杖","业焰","玉辉","鹿鸣","庄周梦蝶","凤翼流珠","雪蟒霜寒","碧海潮生","弦月"}
		n[14] = {"硬木弓","铁胆弓","紫檀弓","宝雕长弓","錾金宝弓","玉腰弯弓","连珠神弓","游鱼戏珠","灵犀望月","非攻","幽篁","百鬼","冥火薄天","龙鸣寒水","太极流光","九霄风雷","若木"}
		n[15] = {"琉璃珠","水晶珠","珍宝珠","翡翠珠","莲华珠","夜灵珠","如意宝珠","沧海明珠","无量玉璧","离火","飞星","月华","回风舞雪","紫金葫芦","裂云啸日","云雷万里","赤明"}
		n[16] = {"钝铁重剑","桃印铁刃","赭石巨剑","壁玉长铗","青铜古剑","金错巨刃","惊涛雪","醉浮生","沉戟天戊","鸦九","昆吾","弦歌","墨骨枯麟","腾蛇郁刃","秋水澄流","百辟镇魂","长息"}
		n[18] = {"素纸灯","竹骨灯","红灯笼","鲤鱼灯","芙蓉花灯","如意宫灯","玲珑盏","玉兔盏","冰心盏","蟠龙","云鹤","风荷","金风玉露","凰火燎原","月露清愁","夭桃秾李","荒尘"}
		n[17] = {"油纸伞","红罗伞","紫竹伞","锦绣椎","幽兰帐","琳琅盖","孔雀羽","金刚伞","落梅伞","鬼骨","云梦","枕霞","碧火琉璃","雪羽穿云","月影星痕","浮生归梦","晴雪"}
		n[19] = {{"方巾","簪子"},{"布帽","玉钗",},{"面具","梅花簪子"},{"纶巾","珍珠头带"},{"缨络丝带","凤头钗"},{"羊角盔","媚狐头饰"},{"水晶帽","玉女发冠"},{"乾坤帽","魔女发冠"},{"黑魔冠","七彩花环"},{"白玉龙冠","凤翅金翎"},{"水晶夔帽","寒雉霜蚕"},{"翡翠曜冠","曜月嵌星"},{"金丝黑玉冠","郁金流苏簪"},{"白玉琉璃冠","玉翼附蝉翎"},{"兽鬼珐琅面","鸾羽九凤冠"},{"紫金磐龙冠","金珰紫焰冠"},{"浑天玄火盔","乾元鸣凤冕"}}
		n[20] = {"护身符","五色飞石","珍珠链",{"骷髅吊坠","苍魂珠"},{"江湖夜雨","九宫坠"},{"荧光坠子","高速之星"},{"风月宝链","八卦坠"},{"碧水青龙","鬼牙攫魂"},{"万里卷云","疾风之铃"},"七彩玲珑","黄玉琉佩","鸾飞凤舞","衔珠金凤佩","七璜珠玉佩","鎏金点翠佩","紫金碧玺佩","落霞陨星坠"}
		n[21] = {{"布裙","布衣"},{"丝绸长裙","皮衣"},{"五彩裙","鳞甲"},{"龙鳞羽衣","锁子甲"},{"天香披肩","紧身衣"},{"金缕羽衣","钢甲"},{"霓裳羽衣","夜魔披风"},{"流云素裙","龙骨甲"},{"七宝天衣","死亡斗篷"},{"飞天羽衣","神谕披风"},{"穰花翠裙","珊瑚玉衣"},{"金蚕丝裙","金蚕披风"},{"紫香金乌裙","乾坤护心甲"},{"碧霞彩云衣","蝉翼金丝甲"},{"金丝蝉翼衫","金丝鱼鳞甲"},{"五彩凤翅衣","紫金磐龙甲"},{"鎏金浣月衣","混元一气甲"}}
		n[22] = {"腰带","缎带","银腰带",{"水晶腰带","玉树腰带"},{"琥珀腰链","白面狼牙"},{"乱牙咬","魔童大牙"},{"攫魂铃","双魂引"},{"兽王腰带","百窜云"},{"八卦锻带","圣王坠"},"幻彩玉带","珠翠玉环","金蟾含珠","乾坤紫玉带","琉璃寒玉带","蝉翼鱼佩带","磐龙凤翔带","紫霄云芒带"}
		n[23] = {"布鞋","牛皮靴","马靴","侠客履","神行靴","绿靴","追星踏月","九州履","万里追云履","踏雪无痕","平步青云","追云逐电","乾坤天罡履","七星逐月靴","碧霞流云履","金丝逐日履","辟尘分光履"}
		n[24] = {"竹编护腕","皮腕","针腕","骨镯","青铜护腕","玛瑙护腕","琉璃护腕","镂空银镯","笼玉镯","嵌宝金腕","玳瑁护腕","七星宝腕","缚龙筋","凤翎护腕","织锦彩带","冰蚕丝带"}
		n[25] = {"竹编脖环","钢圈","荆棘环","骨环","青铜颈环","玛瑙石环","琉璃环","九曲环","笼玉环","嵌宝金环","玳瑁环","七星宝环","缚龙圈","鸾尾环","织锦颈圈","冰蚕丝圈"}
		n[26] = {"竹藤甲","皮甲","刺甲","骨排甲","青铜披甲","玛瑙软甲","琉璃罩甲","连环铠甲","笼玉甲","嵌宝金甲","玳瑁衣","七星宝甲","缚龙甲","凤凰彩衣","织锦软褡","冰蚕织甲"}
		n[27] = {"商品棉布","商品佛珠","商品扇子","商品武器"}
		n[28] = {"商品纸钱","商品夜明珠","商品首饰","商品珍珠"}
		n[29] = {"商品帽子","商品盐","商品蜡烛","商品酒"}
		n[30] = {"商品木材","商品鹿茸","商品面粉","商品符"}
		n[31] = {"商品人参","商品铃铛","商品香油","商品麻线"}
		n[32] = {"光芒石","月亮石","太阳石","红玛瑙","星辉石","舍利子","黑宝石","神秘石"}
	self.商品列表={}
		self.商品列表[1]={"方巾*500","簪子*500","布衣*500","布裙*500","布鞋*500","护身符*500","腰带*500","布帽*1000","玉钗*1000","皮衣*1000","丝绸长裙*1000","牛皮靴*1000","五色飞石*1000","缎带*1000"} --建邺城防具店
		self.商品列表[2]={"四叶花*40","紫丹罗*40","血色茶花*150","熊胆*200","丁香水*150","麝香*150","金创药*3000","佛光舍利子*25000"} --建邺城药店
		self.商品列表[3]={"折扇*500","红缨枪*500","牛皮鞭*500","曲柳杖*500","铁爪*500","松木锤*500","琉璃珠*500","双短剑*500","青铜短剑*500","柳叶刀*500","青铜斧*500","五色缎带*500","黄铜圈*500","硬木弓*500","细木棒*500","钝铁重剑*500","素纸灯*500","油纸伞*500"} --建邺城药店
		self.商品列表[4]={"铁骨扇*1000","曲尖枪*1000","牛筋鞭*1000","红木杖*1000","天狼爪*1000","镔铁锤*1000","水晶珠*1000","镔铁双剑*1000","铁齿剑*1000","苗刀*1000","开山斧*1000","幻彩银纱*1000","精钢日月圈*1000","铁胆弓*1000","金丝魔棒*1000","桃印铁刃*1000","竹骨灯*1000","红罗伞*1000"} --建邺城药店
		self.商品列表[5]={"摄妖香*1000","洞冥草*500","飞行符*500"}
		self.商品列表[6]={"飞行符*500","乾坤袋*7000"}
		self.商品列表[7]={"面具*5000","梅花簪子*5000","鳞甲*5000","五彩裙*5000","马靴*5000"}
		self.商品列表[8]={"精钢扇*5000","锯齿矛*5000","乌龙鞭*5000","白椴杖*5000","幽冥鬼爪*5000","八棱金瓜*5000","珍宝珠*5000","龙凤双剑*5000","吴越剑*5000","夜魔弯刀*5000","双面斧*5000","金丝彩带*5000","离情环*5000","紫檀弓*5000","玉如意*5000","赭石巨剑*5000","红灯笼*5000","紫竹伞*5000"}
		self.商品列表[9]={"包子*100"}
		self.商品列表[10]={"乌金三叉戟*9000","双弦钺*9000","青锋剑*9000","竹节双剑*9000","无极丝*9000","青龙牙*9000","铁面扇*9000","点金棒*9000","狼牙锤*9000","钢结鞭*9000","金刺轮*9000","金背大砍刀*9000","墨铁拐*9000","宝雕长弓*9000","翡翠珠*9000","壁玉长铗*9000","鲤鱼灯*9000","锦绣椎*9000"}
		self.商品列表[11]={"纶巾*9000","珍珠头带*9000","水晶腰带*9000","玉树腰带*9000","侠客履*9000","龙鳞羽衣*9000","锁子甲*9000","骷髅吊坠*9000","苍魂珠*9000"}
		self.商品列表[12]={"白玉骨头*200","天青地白*200","龙须草*140"}
		self.商品列表[13]={"摄妖香*1000","洞冥草*500"}
		self.商品列表[14]={"女儿红*500"}
		self.商品列表[15]={"九宫坠*14000","白面狼牙*14000","江湖夜雨*14000","凤头钗*14000","缨络丝带*14000","神行靴*14000","琥珀腰链*14000","紧身衣*14000","天香披肩*14000"}
		self.商品列表[16]={}
		self.商品列表[17]={"灵脂*200","曼陀罗花*275","鬼切草*200","佛手*80"}
		self.商品列表[18]={"秘制红罗羹*50000","秘制绿罗羹*50000"}
		self.商品列表[19]={"香叶*140","百色花*140","鬼切草*200","佛手*80"}
		self.商品列表[20]={"银腰带*5000","珍珠链*5000","腰带*500","护身符*500"}
		self.商品列表[24]={"高级魔兽要诀*15000000","魔兽要诀*4000000","灵饰指南书*8000000","元灵晶石*5000000"}
		self.商品列表[42]={"光芒石*150000","月亮石*150000","太阳石*150000","红玛瑙*150000","星辉石*150000","舍利子*150000","黑宝石*150000","神秘石*150000","精炼石*150000"}
		if 老唐定制 then
		    self.商品列表[24]={"高级魔兽要诀*40000000","魔兽要诀*4000000","灵饰指南书*8000000","元灵晶石*5000000"}
		end
		if 烹饪三药定制 then
		    self.商品列表[25]={"珍露酒*1","虎骨酒*1","醉生梦死*1","蛇胆酒*1", "百味酒*1","梅花酒*1","长寿面*1","豆斋果*1","金香玉*1","小还丹*1","千年保心丹*1","十香返生丸*1","风水混元丹*1","定神香*1","蛇蝎美人*1","九转回魂丹*1","五龙丹*1","孔雀红*1","地狱灵芝*1","六道轮回*1","凤凰尾*1","火凤之睛*1","龙之心屑*1","白露为霜*1","紫石英*1"}
		end
		if 二级药品定制 then
		    self.商品列表[19]={"香叶*140","百色花*140","鬼切草*200","佛手*80","孔雀红*2000","鹿茸*2000","仙狐涎*2000","地狱灵芝*2000","六道轮回*2000","凤凰尾*2000","火凤之睛*2000","龙之心屑*2000","紫石英*2000","白露为霜*2000","熊胆*2000","血色茶花*2000","丁香水*2000","麝香*2000","餐风饮露*2000"}
		end
		if 让海啸席卷 then
			self.商品列表[24]={"高级魔兽要诀*15000000","魔兽要诀*4000000","灵饰指南书*8000000","元灵晶石*5000000","随机百炼精铁*25000000","随机制造指南书*35000000"}
		end
	--21 23 为珍品商人
	for i=1,17 do
		self.商品列表[16][i]=n[i][5].."*14000"
	end
end

function 商店处理类:刷新跑商商品买入价格()
	self.商品列表[27] = {"商品棉布*"..取随机数(3200,3800),"商品佛珠*"..取随机数(6200,8000),"商品扇子*"..取随机数(3500,4200),"商品武器*"..取随机数(3600,4500)}
	self.商品列表[28] = {"商品棉布*"..取随机数(3200,3800),"商品佛珠*"..取随机数(6200,8000),"商品扇子*"..取随机数(3500,4200),"商品武器*"..取随机数(3600,4500)}
	self.商品列表[29] = {"商品纸钱*"..取随机数(2600,3400),"商品夜明珠*"..取随机数(7600,9000),"商品首饰*"..取随机数(3600,4800),"商品珍珠*"..取随机数(5000,6000)}
	self.商品列表[30] = {"商品纸钱*"..取随机数(2600,3400),"商品夜明珠*"..取随机数(7600,9000),"商品首饰*"..取随机数(3600,4800),"商品珍珠*"..取随机数(5000,6000)}
	self.商品列表[31] = {"商品帽子*"..取随机数(3000,4000),"商品盐*"..取随机数(4800,6000),"商品蜡烛*"..取随机数(1500,2500),"商品酒*"..取随机数(3200,4500)}
	self.商品列表[32] = {"商品帽子*"..取随机数(3000,4000),"商品盐*"..取随机数(4800,6000),"商品蜡烛*"..取随机数(1500,2500),"商品酒*"..取随机数(3200,4500)}
	self.商品列表[33] = {"商品木材*"..取随机数(3200,5000),"商品鹿茸*"..取随机数(6800,8500),"商品面粉*"..取随机数(2500,3500),"商品符*"..取随机数(4500,6000)}
	self.商品列表[34] = {"商品木材*"..取随机数(3200,5000),"商品鹿茸*"..取随机数(6800,8500),"商品面粉*"..取随机数(2500,3500),"商品符*"..取随机数(4500,6000)}
	self.商品列表[35] = {"商品人参*"..取随机数(6500,9000),"商品铃铛*"..取随机数(3200,4800),"商品香油*"..取随机数(3200,5000),"商品麻线*"..取随机数(2000,3800)}
	self.商品列表[36] = {"商品人参*"..取随机数(6500,9000),"商品铃铛*"..取随机数(3200,4800),"商品香油*"..取随机数(3200,5000),"商品麻线*"..取随机数(2000,3800)}
end

function 商店处理类:刷新跑商商品卖出价格()
	self.商品列表[37] = {"商品棉布*"..取随机数(3200,3800),"商品佛珠*"..取随机数(6200,8000),"商品扇子*"..取随机数(3500,4200),"商品武器*"..取随机数(3600,4500)}
	self.商品列表[38] = {"商品纸钱*"..取随机数(2600,3400),"商品夜明珠*"..取随机数(7600,9000),"商品首饰*"..取随机数(3600,4800),"商品珍珠*"..取随机数(5000,6000)}
	self.商品列表[39] = {"商品帽子*"..取随机数(3000,4000),"商品盐*"..取随机数(4800,6000),"商品蜡烛*"..取随机数(1500,2500),"商品酒*"..取随机数(3200,4500)}
	self.商品列表[40] = {"商品木材*"..取随机数(3200,5000),"商品鹿茸*"..取随机数(6800,8500),"商品面粉*"..取随机数(2500,3500),"商品符*"..取随机数(4500,6000)}
	self.商品列表[41] = {"商品人参*"..取随机数(6500,9000),"商品铃铛*"..取随机数(3200,4800),"商品香油*"..取随机数(3200,5000),"商品麻线*"..取随机数(2000,3800)}
end

function 商店处理类:设置神秘宝箱(id)
 	神秘宝箱[id]={}
 	local 名称=""
 	local 参数={}
 	local 备注=""
 	local 奖励=取随机数(1,250)
 	local 说明=""
 	if 奖励<=25 then
	    中奖=5
	elseif 奖励<=43 then
		中奖=11
	elseif 奖励<=68 then
		中奖=8
	elseif 奖励<=76 then
		中奖=20
	elseif 奖励<=83 then
		中奖=17
	elseif 奖励<=87 then
		中奖=9
	elseif 奖励<=90 then
		中奖=4
	elseif 奖励<=93 then
		中奖=1
	elseif 奖励<=120 then
		中奖=3
	elseif 奖励<=135 then
		中奖=6
	elseif 奖励<=150 then
		中奖=7
	elseif 奖励<=165 then
		中奖=10
	elseif 奖励<=180 then
		中奖=12
	elseif 奖励<=195 then
		中奖=13
	elseif 奖励<=225 then
		中奖=15
	elseif 奖励<=240 then
		中奖=18
	else
		中奖=23
	end
  	神秘宝箱[id]={
  		[1]={
  			名称="星辉石",
 			说明="如星光一样璀璨的宝石，散发出耀眼的光芒。用于强化灵饰效果。",
 			备注="随机11-14级宝石"
  		},
  		[2]={
  			名称="100点卡",
 			说明="经典点卡，可兑换一定的点数。",
 			备注="100点点卡"
  		},
  		[3]={
  			名称="光芒石",
 			说明="聚天地之精华而成的宝石，通体散发着夺目的光彩，令人不敢直视。是用来合成装备的神奇矿石。",
 			备注="随机11-16级宝石"
  		},
  		[4]={
  			名称="高级武器",
 			说明="随机160级本角色使用武器，属性偏高。",
 			备注="随机160级本角色使用武器，属性偏高。"
  		},
  		[5]={
  			名称="30点卡",
 			说明="经典点卡，可兑换一定的点数。",
 			备注="30点点卡"
  		},
  		[6]={
  			名称="太阳石",
 			说明="从上古时期流传至今的“太阳之石”，附有神力。是用来合成装备的神奇矿石。",
 			备注="随机11-16级宝石"
  		},
  		[7]={
  			名称="舍利子",
 			说明="佛的舍利子是合成装备的神秘材料。",
 			备注="随机11-16级宝石"
  		},
  		[8]={
  			名称="50点卡",
 			说明="经典点卡，可兑换一定的点数。",
 			备注="50点点卡"
  		},
  		[9]={
  			名称="高级装备",
 			说明="随机160级本角色使用装备，属性偏高。",
 			备注="随机160级本角色使用装备，属性偏高。"
  		},
  		[10]={
  			名称="黑宝石",
 			说明="坚硬无比的宝石；表面看起来毫不起眼，实际上却蕴涵着巨大的力量。",
 			备注="随机11-16级宝石"
  		},
  		[11]={
  			名称="80点卡",
 			说明="经典点卡，可兑换一定的点数。",
 			备注="80点点卡"
  		},
  		[12]={
  			名称="月亮石",
 			说明="由月宫中流落到人间的宝石，吸取了月光之精华，能起到鼓舞和提神的作用。是用来合成装备的神奇矿石。",
 			备注="随机11-16级宝石"
  		},
  		[13]={
  			名称="红玛瑙",
 			说明="红色的玛瑙石，是合成装备的神秘材料。",
 			备注="随机11-16级宝石"
  		},
  		[14]={
  			名称="120点卡",
 			说明="经典点卡，可兑换一定的点数。",
 			备注="120点点卡"
  		},
  		[15]={
  			名称="随机法宝",
 			说明="随机一级法宝。",
 			备注="随机获得一个一级法宝。"
  		},
  		[16]={
  			名称="200点卡",
 			说明="经典点卡，可兑换一定的点数。",
 			备注="200点点卡"
  		},
  		[17]={
  			名称="武器",
 			说明="随机160级本角色使用武器。",
 			备注="随机160级本角色使用武器。"
  		},

  		[18]={
  			名称="高级兽决",
 			说明="随机高级兽诀或特殊魔兽要诀一本。",
 			备注="随机高级兽诀或特殊魔兽要诀一本。"
  		},
  		[19]={
  			名称="500点卡",
 			说明="经典点卡，可兑换一定的点数。",
 			备注="500点点卡"
  		},
  		[20]={
  			名称="装备",
 			说明="随机160级本角色使用装备。",
 			备注="随机获取160级装备一件。"
  		},
  		[21]={
  			名称="1000点卡",
 			说明="经典点卡，可兑换一定的点数。",
 			备注="1000点点卡"
  		},
  		[22]={
  			名称="金砖",
 			说明="获得一定量的银子。",
 			备注="一亿两银子"
  		},
  		[23]={
  			名称="仙丹",
 			说明="获得一定量的经验。",
 			备注="一亿点经验"
  		},
  		[24]={
  			名称="2000点卡",
 			说明="经典点卡，可兑换一定的点数。",
 			备注="2000点点卡"
  		},
  		中奖=中奖,
	}
end

function 商店处理类:刷新珍品()
	local 等级范围={5,5,6,7,6,7,6,7,8,6,5,7,8,6,6,7,7,7}
	for n=21,23 do
		self.商品列表[n]={}
		for i=1,取随机数(8,10) do
			local 等级=等级范围[取随机数(1,#等级范围)]
			local 名称=取随机装备名称(等级)
			local 价格=0
			if 等级==5 then
				价格=50000
			elseif 等级==6 then
				价格=100000
			elseif 等级==7 then
				价格=200000
			elseif 等级==8 then
				价格=350000
			end
			self.商品列表[n][i]=名称.."*"..价格
		end
	end
end

function 商店处理类:设置仙玉神秘宝箱(id)
 	神秘宝箱[id]={}
 	local 名称=""
 	local 参数={}
 	local 备注=""
 	local 奖励=取随机数(1,561)
 	local 说明=""
 	if 奖励<=30 then
	    中奖=23
	elseif 奖励<=60 then
		中奖=5
	elseif 奖励<=90 then
		中奖=15
	elseif 奖励<=140 then
		中奖=11
	elseif 奖励<=180 then
		中奖=10
	elseif 奖励<=220 then
		中奖=6
	elseif 奖励<=260 then
		中奖=13
	elseif 奖励<=300 then
		中奖=12
	elseif 奖励<=340 then
		中奖=3
	elseif 奖励<=380 then
		中奖=7
	elseif 奖励<=420 then
		中奖=1
	elseif 奖励<=450 then
		中奖=22
	elseif 奖励<=480 then
		中奖=8
	elseif 奖励<=500 then
		中奖=18
	elseif 奖励<=510 then
		中奖=2
	elseif 奖励<=525 then
		中奖=14
	elseif 奖励<=529 then
		中奖=16
	elseif 奖励<=532 then
		中奖=19
	elseif 奖励<=542 then
		中奖=20
	elseif 奖励<=550 then
		中奖=17
	elseif 奖励<=554 then
		中奖=9
	elseif 奖励<=558 then
		中奖=4
	elseif 奖励<=560 then
		中奖=21
	elseif 奖励<=561 then
		中奖=24
	end
  	神秘宝箱[id]={
  		[1]={
  			名称="星辉石",
 			说明="如星光一样璀璨的宝石，散发出耀眼的光芒。用于强化灵饰效果。",
 			备注="随机11-14级宝石"
  		},
  		[2]={
  			名称="100点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="100点点卡"
  		},
  		[3]={
  			名称="光芒石",
 			说明="聚天地之精华而成的宝石，通体散发着夺目的光彩，令人不敢直视。是用来合成装备的神奇矿石。",
 			备注="随机11-16级宝石"
  		},
  		[4]={
  			名称="高级武器",
 			说明="随机160级本角色使用武器，属性偏高。",
 			备注="随机160级本角色使用武器，属性偏高。"
  		},
  		[5]={
  			名称="储备",
 			说明="获得一定量的储备。",
 			备注="获得一亿的储备金"
  		},
  		[6]={
  			名称="太阳石",
 			说明="从上古时期流传至今的“太阳之石”，附有神力。是用来合成装备的神奇矿石。",
 			备注="随机11-16级宝石"
  		},
  		[7]={
  			名称="舍利子",
 			说明="佛的舍利子是合成装备的神秘材料。",
 			备注="随机11-16级宝石"
  		},
  		[8]={
  			名称="超级金柳露",
 			说明="一种非常难得的仙露，据说有着令万物回归到原始状态的奇效。可以把怪物变成0级，是用来炼妖的神奇物品。",
 			备注="超级金柳露"
  		},
  		[9]={
  			名称="高级装备",
 			说明="随机160级本角色使用装备，属性偏高。",
 			备注="随机160级本角色使用装备，属性偏高。"
  		},
  		[10]={
  			名称="黑宝石",
 			说明="坚硬无比的宝石；表面看起来毫不起眼，实际上却蕴涵着巨大的力量。",
 			备注="随机11-16级宝石"
  		},
  		[11]={
  			名称="储备",
 			说明="获得一定量的储备。",
 			备注="获得一亿的储备金。"
  		},
  		[12]={
  			名称="月亮石",
 			说明="由月宫中流落到人间的宝石，吸取了月光之精华，能起到鼓舞和提神的作用。是用来合成装备的神奇矿石。",
 			备注="随机11-16级宝石"
  		},
  		[13]={
  			名称="红玛瑙",
 			说明="红色的玛瑙石，是合成装备的神秘材料。",
 			备注="随机11-16级宝石"
  		},
  		[14]={
  			名称="120点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="120点点卡"
  		},
  		[15]={
  			名称="随机法宝",
 			说明="随机一级法宝。",
 			备注="随机获得一个一级法宝。"
  		},
  		[16]={
  			名称="200点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="200点点卡"
  		},
  		[17]={
  			名称="武器",
 			说明="随机160级本角色使用武器。",
 			备注="随机160级本角色使用武器。"
  		},

  		[18]={
  			名称="高级兽决",
 			说明="随机高级兽诀或特殊魔兽要诀一本。",
 			备注="随机高级兽诀或特殊魔兽要诀一本。"
  		},
  		[19]={
  			名称="500点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="500点点卡"
  		},
  		[20]={
  			名称="装备",
 			说明="随机160级本角色使用装备。",
 			备注="随机获取160级装备一件。"
  		},
  		[21]={
  			名称="1000点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="1000点点卡"
  		},
  		[22]={
  			名称="金砖",
 			说明="获得一定量的银子。",
 			备注="5000W两银子"
  		},
  		[23]={
  			名称="仙丹",
 			说明="获得一定量的经验。",
 			备注="一亿点经验"
  		},
  		[24]={
  			名称="2000点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="2000点点卡"
  		},
  		中奖=中奖,
	}
end

function 商店处理类:设置海啸仙玉神秘宝箱(id)
 	神秘宝箱[id]={}
 	local 名称=""
 	local 参数={}
 	local 备注=""
 	local 奖励=取随机数(1,561)
 	local 说明=""
 	if 奖励<=30 then
	    中奖=23
	elseif 奖励<=60 then
		中奖=5
	elseif 奖励<=90 then
		中奖=15
	elseif 奖励<=140 then
		中奖=11
	elseif 奖励<=180 then
		中奖=10
	elseif 奖励<=220 then
		中奖=6
	elseif 奖励<=260 then
		中奖=13
	elseif 奖励<=300 then
		中奖=12
	elseif 奖励<=340 then
		中奖=3
	elseif 奖励<=380 then
		中奖=7
	elseif 奖励<=420 then
		中奖=1
	elseif 奖励<=450 then
		中奖=22
	elseif 奖励<=455 then
		中奖=8
	elseif 奖励<=480 then
		中奖=18
	elseif 奖励<=510 then
		中奖=2
	elseif 奖励<=525 then
		中奖=14
	elseif 奖励<=529 then
		中奖=16
	elseif 奖励<=555 then
		中奖=19
	elseif 奖励<=556 then
		中奖=20
	elseif 奖励<=557 then
		中奖=17
	elseif 奖励<=558 then
		中奖=9
	elseif 奖励<=559 then
		中奖=4
	elseif 奖励<=560 then
		中奖=21
	elseif 奖励<=561 then
		中奖=24
	end
  	神秘宝箱[id]={
  		[1]={
  			名称="星辉石",
 			说明="如星光一样璀璨的宝石，散发出耀眼的光芒。用于强化灵饰效果。",
 			备注="随机5-12级宝石"
  		},
  		[2]={
  			名称="百炼精铁",
 			说明="140级随机书铁",
 			备注="140级随机书铁"
  		},
  		[3]={
  			名称="光芒石",
 			说明="聚天地之精华而成的宝石，通体散发着夺目的光彩，令人不敢直视。是用来合成装备的神奇矿石。",
 			备注="随机5-12级宝石"
  		},
  		[4]={
  			名称="高级武器",
 			说明="随机160级本角色使用武器，属性偏高。",
 			备注="随机160级本角色使用武器，属性偏高。"
  		},
  		[5]={
  			名称="储备",
 			说明="获得一定量的储备。",
 			备注="获得一亿的储备金"
  		},
  		[6]={
  			名称="太阳石",
 			说明="从上古时期流传至今的“太阳之石”，附有神力。是用来合成装备的神奇矿石。",
 			备注="随机11-16级宝石"
  		},
  		[7]={
  			名称="舍利子",
 			说明="佛的舍利子是合成装备的神秘材料。",
 			备注="随机11-16级宝石"
  		},
  		[8]={
  			名称="神兜兜",
 			说明="获得一个或者99个神兜兜",
 			备注="获得一个或者99个神兜兜"
  		},
  		[9]={
  			名称="高级装备",
 			说明="随机160级本角色使用装备，属性偏高。",
 			备注="随机160级本角色使用装备，属性偏高。"
  		},
  		[10]={
  			名称="黑宝石",
 			说明="坚硬无比的宝石；表面看起来毫不起眼，实际上却蕴涵着巨大的力量。",
 			备注="随机5-12级宝石"
  		},
  		[11]={
  			名称="魔兽残卷",
 			说明="获得3个魔兽残卷",
 			备注="获得3个魔兽残卷"
  		},
  		[12]={
  			名称="月亮石",
 			说明="由月宫中流落到人间的宝石，吸取了月光之精华，能起到鼓舞和提神的作用。是用来合成装备的神奇矿石。",
 			备注="随机5-12级宝石"
  		},
  		[13]={
  			名称="红玛瑙",
 			说明="红色的玛瑙石，是合成装备的神秘材料。",
 			备注="随机5-12级宝石"
  		},
  		[14]={
  			名称="制造指南书",
 			说明="150级随机书铁",
 			备注="150级随机书铁"
  		},
  		[15]={
  			名称="随机法宝",
 			说明="随机一级法宝。",
 			备注="随机获得一个一级法宝。"
  		},
  		[16]={
  			名称="20点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="20点点卡"
  		},
  		[17]={
  			名称="武器",
 			说明="随机160级本角色使用武器。",
 			备注="随机160级本角色使用武器。"
  		},

  		[18]={
  			名称="高级兽决",
 			说明="随机高级兽诀或特殊魔兽要诀一本。",
 			备注="随机高级兽诀或特殊魔兽要诀一本。"
  		},
  		[19]={
  			名称="50点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="50点点卡"
  		},
  		[20]={
  			名称="装备",
 			说明="随机160级本角色使用装备。",
 			备注="随机获取160级装备一件。"
  		},
  		[21]={
  			名称="100点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="100点点卡"
  		},
  		[22]={
  			名称="金砖",
 			说明="获得一定量的银子。",
 			备注="5000W两银子"
  		},
  		[23]={
  			名称="仙丹",
 			说明="获得一定量的经验。",
 			备注="一亿点经验"
  		},
  		[24]={
  			名称="200点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="200点点卡"
  		},
  		中奖=中奖,
	}
end

function 商店处理类:设置钥匙神秘宝箱(id)
 	神秘宝箱[id]={}
 	local 名称=""
 	local 参数={}
 	local 备注=""
 	local 奖励=取随机数(1,1000)
 	local 说明=""
 	if 奖励<=30 then
	    中奖=1
	elseif 奖励<=170 then
		中奖=2
	elseif 奖励<=210 then
		中奖=3
	elseif 奖励<=215 then
		中奖=4
	elseif 奖励<=245 then
		中奖=5
	elseif 奖励<=285 then
		中奖=6
	elseif 奖励<=325 then
		中奖=7
	elseif 奖励<=425 then
		中奖=8
	elseif 奖励<=430 then
		中奖=9
	elseif 奖励<=470 then
		中奖=10
	elseif 奖励<=510 then
		中奖=11
	elseif 奖励<=550 then
		中奖=12
	elseif 奖励<=590 then
		中奖=13
	elseif 奖励<=690 then
		中奖=14
	elseif 奖励<=700 then
		中奖=15
	elseif 奖励<=740 then
		中奖=16
	elseif 奖励<=750 then
		中奖=17
	elseif 奖励<=850 then
		中奖=18
	elseif 奖励<=880 then
		中奖=19
	elseif 奖励<=890 then
		中奖=20
	elseif 奖励<=920 then
		中奖=21
	elseif 奖励<=940 then
		中奖=22
	elseif 奖励<=980 then
		中奖=23
	else
		中奖=24
	end
  	神秘宝箱[id]={
  		[1]={
  			名称="星辉石",
 			说明="如星光一样璀璨的宝石，散发出耀眼的光芒。用于强化灵饰效果。",
 			备注="随机3-10级宝石"
  		},
  		[2]={
  			名称="200点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="200点点卡"
  		},
  		[3]={
  			名称="光芒石",
 			说明="聚天地之精华而成的宝石，通体散发着夺目的光彩，令人不敢直视。是用来合成装备的神奇矿石。",
 			备注="随机4-12级宝石"
  		},
  		[4]={
  			名称="高级武器",
 			说明="随机160级本角色使用武器。",
 			备注="随机160级本角色使用武器。"
  		},
  		[5]={
  			名称="储备",
 			说明="获得一定量的储备。",
 			备注="获得6666W的储备金"
  		},
  		[6]={
  			名称="太阳石",
 			说明="从上古时期流传至今的“太阳之石”，附有神力。是用来合成装备的神奇矿石。",
 			备注="随机4-12级宝石"
  		},
  		[7]={
  			名称="舍利子",
 			说明="佛的舍利子是合成装备的神秘材料。",
 			备注="随机4-12级宝石"
  		},
  		[8]={
  			名称="超级金柳露",
 			说明="一种非常难得的仙露，据说有着令万物回归到原始状态的奇效。可以把怪物变成0级，是用来炼妖的神奇物品。",
 			备注="超级金柳露"
  		},
  		[9]={
  			名称="高级装备",
 			说明="随机160级本角色使用装备。",
 			备注="随机160级本角色使用装备。"
  		},
  		[10]={
  			名称="黑宝石",
 			说明="坚硬无比的宝石；表面看起来毫不起眼，实际上却蕴涵着巨大的力量。",
 			备注="随机4-12级宝石"
  		},
  		[11]={
  			名称="储备",
 			说明="获得一定量的储备。",
 			备注="获得6666W的储备金。"
  		},
  		[12]={
  			名称="月亮石",
 			说明="由月宫中流落到人间的宝石，吸取了月光之精华，能起到鼓舞和提神的作用。是用来合成装备的神奇矿石。",
 			备注="随机4-12级宝石"
  		},
  		[13]={
  			名称="红玛瑙",
 			说明="红色的玛瑙石，是合成装备的神秘材料。",
 			备注="随机4-12级宝石"
  		},
  		[14]={
  			名称="300点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="300点点卡"
  		},
  		[15]={
  			名称="随机法宝",
 			说明="随机一级法宝。",
 			备注="随机获得一个一级法宝。"
  		},
  		[16]={
  			名称="400点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="400点点卡"
  		},
  		[17]={
  			名称="武器",
 			说明="随机150级本角色使用武器。",
 			备注="随机150级本角色使用武器。"
  		},

  		[18]={
  			名称="高级兽决",
 			说明="随机高级兽诀一本。",
 			备注="随机高级兽诀一本。"
  		},
  		[19]={
  			名称="600点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="600点点卡"
  		},
  		[20]={
  			名称="装备",
 			说明="随机150级本角色使用装备。",
 			备注="随机获取150级装备一件。"
  		},
  		[21]={
  			名称="1000点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="1000点点卡"
  		},
  		[22]={
  			名称="金砖",
 			说明="获得一定量的银子。",
 			备注="4000W两银子"
  		},
  		[23]={
  			名称="仙丹",
 			说明="获得一定量的经验。",
 			备注="4000W点经验"
  		},
  		[24]={
  			名称="2500点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="2500点点卡"
  		},
  		中奖=中奖,
	}
end

function 商店处理类:设置老唐宝箱(id)
 	神秘宝箱[id]={}
 	local 名称=""
 	local 参数={}
 	local 备注=""
 	local 奖励=取随机数(1,1000)
 	local 说明=""
 	if 奖励<=10 then
	    中奖=1
	elseif 奖励<=15 then
		中奖=2
	elseif 奖励<=16 then
		中奖=3
	elseif 奖励<=316 then
		中奖=4
	elseif 奖励<=416 then
		中奖=5
	elseif 奖励<=426 then
		中奖=6
	elseif 奖励<=431 then --召唤兽装备
		中奖=7
	elseif 奖励<=436 then --灵饰兑换
		中奖=8
	elseif 奖励<=438 then
		中奖=9
	elseif 奖励<=439 then
		中奖=10
	elseif 奖励<=444 then
		中奖=11
	elseif 奖励<=454 then
		中奖=12
	elseif 奖励<=504 then
		中奖=13
	elseif 奖励<=507 then
		中奖=14
	elseif 奖励<=512 then
		中奖=15
	elseif 奖励<=562 then
		中奖=16
	elseif 奖励<=612 then
		中奖=17
	elseif 奖励<=712 then
		中奖=18
	elseif 奖励<=812 then
		中奖=19
	elseif 奖励<=817 then
		中奖=20
	elseif 奖励<=818 then
		中奖=21
	elseif 奖励<=828 then
		中奖=22
	elseif 奖励<=978 then
		中奖=23
	else
		中奖=24
	end
  	神秘宝箱[id]={
  		[1]={
  			名称="10点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="10点点卡"
  		},
  		[2]={
  			名称="50点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="50点点卡"
  		},
  		[3]={
  			名称="100点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="100点点卡"
  		},
  		[4]={
  			名称="金砖1",
 			说明="获得一定量的银子。",
 			备注="500W两银子"
  		},
  		[5]={
  			名称="金砖2",
 			说明="获得一定量的银子。",
 			备注="1000W两银子"
  		},
  		[6]={
  			名称="特殊兽诀",
 			说明="获得特殊兽诀一本。",
 			备注="特殊兽诀"
  		},
  		[7]={
  			名称="特殊兽诀",
 			说明="获得特殊兽诀一本。",
 			备注="特殊兽诀"
  		},
  		[8]={
  			名称="特殊兽诀",
 			说明="获得特殊兽诀一本。",
 			备注="特殊兽诀"
  		},
  		[9]={
  			名称="特殊兽诀",
 			说明="获得特殊兽诀一本。",
 			备注="特殊兽诀"
  		},
  		[10]={
  			名称="特殊兽诀",
 			说明="获得特殊兽诀一本。",
 			备注="特殊兽诀"
  		},
  		[11]={
  			名称="160级装备礼包",
 			说明="内含一套160级无级别装备,属性随机。",
 			备注="160级装备礼包"
  		},
  		[12]={
  			名称="150级装备礼包",
 			说明="内含一套150级无级别装备,属性随机。",
 			备注="150级装备礼包"
  		},
  		[13]={
  			名称="星辉石",
 			说明="如星光一样璀璨的宝石，散发出耀眼的光芒。用于强化灵饰效果。",
 			备注="星辉石"
  		},
  		[14]={
  			名称="特殊兽诀",
 			说明="获得特殊兽诀一本。",
 			备注="特殊兽诀"
  		},
  		[15]={
  			名称="特殊兽诀",
 			说明="获得特殊兽诀一本。",
 			备注="特殊兽诀"
  		},
  		[16]={
  			名称="九转金丹",
 			说明="太上老君八卦炉中炼制的灵丹，服用之后可以增加人物的修炼经验。不同火候炼制的丹药，效果自然也不相同。",
 			备注="500品九转金丹"
  		},
  		[17]={
  			名称="特殊兽诀",
 			说明="获得特殊兽诀一本。",
 			备注="特殊兽诀"
  		},
  		[18]={
  			名称="元灵晶石",
 			说明="140级元灵晶石。",
 			备注="元灵晶石。"
  		},
  		[19]={
  			名称="灵饰指南书",
 			说明="140级灵饰指南书。",
 			备注="灵饰指南书。"
  		},
  		[20]={
  			名称="融合石",
 			说明="具有神秘而强大的力量，可在熔合失败时保护装备不会损坏。",
 			备注="融合石"
  		},
  		[21]={
  			名称="观照万象",
 			说明="特殊兽决观照万象。",
 			备注="观照万象。"
  		},
  		[22]={
  			名称="特殊兽诀",
 			说明="获得特殊兽诀一本。",
 			备注="特殊兽诀"
  		},
  		[23]={
  			名称="随机5级宝石",
 			说明="随机5级宝石",
 			备注="随机5级宝石"
  		},
  		[24]={
  			名称="高级兽决",
 			说明="随机高级魔兽要诀一本。",
 			备注="高级兽决"
  		},
  		中奖=中奖,
	}
end

function 商店处理类:设置钥匙星级神秘宝箱(id)
 	神秘宝箱[id]={}
 	local 名称=""
 	local 参数={}
 	local 备注=""
 	local 奖励=取随机数(1,561)
 	local 说明=""
 	if 奖励<=30 then
	    中奖=23
	elseif 奖励<=60 then
		中奖=5
	elseif 奖励<=90 then
		中奖=15
	elseif 奖励<=140 then
		中奖=11
	elseif 奖励<=180 then
		中奖=10
	elseif 奖励<=220 then
		中奖=6
	elseif 奖励<=260 then
		中奖=13
	elseif 奖励<=300 then
		中奖=12
	elseif 奖励<=340 then
		中奖=3
	elseif 奖励<=380 then
		中奖=7
	elseif 奖励<=420 then
		中奖=1
	elseif 奖励<=450 then
		中奖=22
	elseif 奖励<=480 then
		中奖=8
	elseif 奖励<=500 then
		中奖=18
	elseif 奖励<=510 then
		中奖=2
	elseif 奖励<=525 then
		中奖=14
	elseif 奖励<=529 then
		中奖=16
	elseif 奖励<=532 then
		中奖=19
	elseif 奖励<=542 then
		中奖=20
	elseif 奖励<=550 then
		中奖=17
	elseif 奖励<=554 then
		中奖=9
	elseif 奖励<=558 then
		中奖=4
	elseif 奖励<=560 then
		中奖=21
	elseif 奖励<=561 then
		中奖=24
	end
  	神秘宝箱[id]={
  		[1]={
  			名称="星辉石",
 			说明="如星光一样璀璨的宝石，散发出耀眼的光芒。用于强化灵饰效果。",
 			备注="随机11-14级宝石"
  		},
  		[2]={
  			名称="100点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="100点点卡"
  		},
  		[3]={
  			名称="光芒石",
 			说明="聚天地之精华而成的宝石，通体散发着夺目的光彩，令人不敢直视。是用来合成装备的神奇矿石。",
 			备注="随机11-16级宝石"
  		},
  		[4]={
  			名称="高级武器",
 			说明="随机160级本角色使用武器，属性偏高。",
 			备注="随机160级本角色使用武器，属性偏高。"
  		},
  		[5]={
  			名称="储备",
 			说明="获得一定量的储备。",
 			备注="获得一亿的储备金"
  		},
  		[6]={
  			名称="太阳石",
 			说明="从上古时期流传至今的“太阳之石”，附有神力。是用来合成装备的神奇矿石。",
 			备注="随机11-16级宝石"
  		},
  		[7]={
  			名称="舍利子",
 			说明="佛的舍利子是合成装备的神秘材料。",
 			备注="随机11-16级宝石"
  		},
  		[8]={
  			名称="超级金柳露",
 			说明="一种非常难得的仙露，据说有着令万物回归到原始状态的奇效。可以把怪物变成0级，是用来炼妖的神奇物品。",
 			备注="超级金柳露"
  		},
  		[9]={
  			名称="高级装备",
 			说明="随机160级本角色使用装备，属性偏高。",
 			备注="随机160级本角色使用装备，属性偏高。"
  		},
  		[10]={
  			名称="黑宝石",
 			说明="坚硬无比的宝石；表面看起来毫不起眼，实际上却蕴涵着巨大的力量。",
 			备注="随机11-16级宝石"
  		},
  		[11]={
  			名称="储备",
 			说明="获得一定量的储备。",
 			备注="获得一亿的储备金。"
  		},
  		[12]={
  			名称="月亮石",
 			说明="由月宫中流落到人间的宝石，吸取了月光之精华，能起到鼓舞和提神的作用。是用来合成装备的神奇矿石。",
 			备注="随机11-16级宝石"
  		},
  		[13]={
  			名称="红玛瑙",
 			说明="红色的玛瑙石，是合成装备的神秘材料。",
 			备注="随机11-16级宝石"
  		},
  		[14]={
  			名称="120点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="120点点卡"
  		},
  		[15]={
  			名称="随机法宝",
 			说明="随机一级法宝。",
 			备注="随机获得一个一级法宝。"
  		},
  		[16]={
  			名称="200点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="200点点卡"
  		},
  		[17]={
  			名称="武器",
 			说明="随机160级本角色使用武器。",
 			备注="随机160级本角色使用武器。"
  		},

  		[18]={
  			名称="高级兽决",
 			说明="随机高级兽诀或特殊魔兽要诀一本。",
 			备注="随机高级兽诀或特殊魔兽要诀一本。"
  		},
  		[19]={
  			名称="500点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="500点点卡"
  		},
  		[20]={
  			名称="装备",
 			说明="随机160级本角色使用装备。",
 			备注="随机获取160级装备一件。"
  		},
  		[21]={
  			名称="1000点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="1000点点卡"
  		},
  		[22]={
  			名称="金砖",
 			说明="获得一定量的银子。",
 			备注="5000W两银子"
  		},
  		[23]={
  			名称="仙丹",
 			说明="获得一定量的经验。",
 			备注="一亿点经验"
  		},
  		[24]={
  			名称="2000点卡",
 			说明="经典点卡，可兑换一定的仙玉。",
 			备注="2000点点卡"
  		},
  		中奖=中奖,
	}
end

function 商店处理类:更新(dt) end
function 商店处理类:显示(x,y) end

return 商店处理类