--======================================================================--

--======================================================================--
local 商城处理类 = class()

function 商城处理类:初始化()
	self.购买组号=nil
	self.购买编号=nil
	self.购买数量=nil
	self.购买分类=nil
end

function 商城处理类:加载商品()
	self.商品组 = {}
	self.商品组[18] = {杂货={},仙玉={},积分={},折扣={},宝宝={},法宝={},锦衣祥瑞={},锦衣={},祥瑞={},足迹={},足印={},比武积分={},种族积分={},副本积分={},妖魔积分={}}
	self.商品组[19] = {活跃兑换={}}
	self.商品组[18]["杂货"]={
		{可叠加=false,总类=11,xy={[2]={y=11,x=495},[5]={y=273,x=12},[3]={y=117,x=457},[7]={y=105,x=192},[1]={y=7,x=312},[4]={y=167,x=362},[6]={y=240,x=277},[8]={y=276,x=527}},地图=1001,子类=50,y=7,x=312,价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","红色合成旗")+0,分类=2,次数=70,名称="红色合成旗"},
		{可叠加=false,总类=11,xy={[1]={y=13,x=13},[2]={y=55,x=29},[3]={y=120,x=55},[4]={y=133,x=167},[5]={y=13,x=209}},地图=1092,子类=50,y=7,x=312,价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","黄色合成旗")+0,分类=2,次数=70,名称="黄色合成旗"},
		{可叠加=false,总类=11,xy={[1]={y=203,x=141},[2]={y=183,x=33},[3]={y=74,x=52},[4]={y=14,x=107}},地图=1070,子类=50,y=7,x=312,价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","蓝色合成旗")+0,分类=2,次数=70,名称="蓝色合成旗"},
		{可叠加=false,名称="红色导标旗",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","红色导标旗")+0,总类=11,分类=1},
		{可叠加=false,名称="绿色导标旗",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","绿色导标旗")+0,总类=11,分类=1},
		{可叠加=false,名称="蓝色导标旗",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","蓝色导标旗")+0,总类=11,分类=1},
		{可叠加=false,名称="白色导标旗",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","白色导标旗")+0,总类=11,分类=1},
		{可叠加=false,名称="黄色导标旗",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","黄色导标旗")+0,总类=11,分类=1},
		{可叠加=false,名称="珍珠",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","160级珍珠")+0,总类=5,分类=6,级别限制=160},
		{可叠加=true,总类=4,名称="天眼通符",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","天眼通符")+0,分类=2,子类=0},
		{子类=1,总类=3,名称="超级金柳露",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","超级金柳露")+0,分类=2},
		{子类=0,总类=3,名称="金柳露",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","金柳露")+0,分类=2},
		{可叠加=true,子类=1,总类=5,名称="青龙石",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","青龙石")+0,分类=4},
		{可叠加=true,子类=2,总类=5,名称="白虎石",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","白虎石")+0,分类=4},
		{可叠加=true,子类=3,总类=5,名称="朱雀石",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","朱雀石")+0,分类=4},
		{可叠加=true,子类=4,总类=5,名称="玄武石",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","玄武石")+0,分类=4},
		{可叠加=true,总类=9,名称="飞行符",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","飞行符")+0,分类=1,子类=1},
		{可叠加=true,名称="秘制红罗羹",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","秘制红罗羹")+0},
		{可叠加=true,名称="秘制绿罗羹",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","秘制绿罗羹")+0},
		{可叠加=true,名称="洞冥草",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","洞冥草")+0},
		{可叠加=true,名称="高级宠物口粮",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","洞冥草")+0},
		{可叠加=true,名称="摄妖香",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","摄妖香")+0},
		{可叠加=true,名称="月华露",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","月华露")+0,阶品=500},
		{可叠加=true,名称="修炼果",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","修炼果")+0,阶品=500},
		{可叠加=true,名称="九转金丹",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","九转金丹")+0,阶品=500},
		{可叠加=true,名称="易经丹",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","易经丹")+0},
		{可叠加=true,名称="吸附石",五行="水",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","易经丹")+0},
		{可叠加=true,名称="分解符",总类=5,分类=3,价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","易经丹")+0},
		{可叠加=true,名称="玉葫灵髓",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","玉葫灵髓")+0},
		{可叠加=true,名称="清灵净瓶",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","清灵净瓶")+0},
		{可叠加=true,名称="海马",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","海马")+0},
		{可叠加=true,名称="彩果",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","彩果")+0},
		{可叠加=true,名称="金银锦盒",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","金银锦盒")+0},
		{可叠加=true,名称="空白强化符",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","空白强化符")+0},
		{可叠加=false,名称="星辉石",总类=5,分类=6,子类=8,价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","星辉石")+0,级别限制=1},
		-- {可叠加=true,总类=9,名称="灵箓",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","飞行符")+0,分类=1,子类=1},
		{可叠加=false,名称="光芒石",总类=5,分类=6,子类=1,价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","光芒石")+0,级别限制=1},
		{可叠加=false,名称="月亮石",总类=5,分类=6,子类=2,价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","月亮石")+0,级别限制=1},
		{可叠加=false,名称="太阳石",总类=5,分类=6,子类=3,价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","太阳石")+0,级别限制=1},
		{可叠加=false,名称="舍利子",总类=5,分类=6,子类=4,价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","舍利子")+0,级别限制=1},
		{可叠加=false,名称="红玛瑙",总类=5,分类=6,子类=5,价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","红玛瑙")+0,级别限制=1},
		{可叠加=false,名称="黑宝石",总类=5,分类=6,子类=6,价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","黑宝石")+0,级别限制=1},
		{可叠加=false,名称="神秘石",总类=5,分类=6,子类=7,价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","神秘石")+0,级别限制=1},
		{可叠加=false,名称="点化石",总类=5,分类=8,子类=1,附带技能="善恶有报",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","神秘石")+0},
		{可叠加=false,名称="天眼珠",总类=3,分类=11,子类=1,灵气=100,级别限制=75,价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","神秘石")+0},
		{可叠加=false,名称="上古锻造图策",总类=3,分类=10,子类=1,级别限制=75,种类="项圈",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","神秘石")+0},
		{可叠加=false,名称="上古锻造图策",总类=3,分类=10,子类=1,级别限制=75,种类="护腕",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","神秘石")+0},
		{可叠加=false,名称="上古锻造图策",总类=3,分类=10,子类=1,级别限制=75,种类="铠甲",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","神秘石")+0},
		{可叠加=false,名称="精魄灵石",总类=5,分类=6,子类=10,级别限制=1,特效="伤害",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","神秘石")+0},
		{可叠加=false,名称="精魄灵石",总类=5,分类=6,子类=10,级别限制=1,特效="气血",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","神秘石")+0},
		{可叠加=false,名称="精魄灵石",总类=5,分类=6,子类=10,级别限制=1,特效="防御",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","神秘石")+0},
		{可叠加=false,名称="精魄灵石",总类=5,分类=6,子类=10,级别限制=1,特效="命中",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","神秘石")+0},
		{可叠加=false,名称="精魄灵石",总类=5,分类=6,子类=10,级别限制=1,特效="灵力",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","神秘石")+0},
		{可叠加=false,名称="精魄灵石",总类=5,分类=6,子类=10,级别限制=1,特效="速度",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","神秘石")+0},
		{可叠加=false,名称="碎星锤",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","碎星锤")+0},
		{可叠加=false,名称="60级随机灵饰指南书",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","60级随机灵饰指南书")+0},
		{可叠加=false,名称="80级随机灵饰指南书",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","80级随机灵饰指南书")+0},
		{可叠加=false,名称="100级随机灵饰指南书",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","100级随机灵饰指南书")+0},
		{可叠加=false,名称="60级元灵晶石",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","60级元灵晶石")+0},
		{可叠加=false,名称="80级元灵晶石",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","80级元灵晶石")+0},
		{可叠加=false,名称="100级元灵晶石",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","100级元灵晶石")+0},
		-- {可叠加=false,名称="含沙射影",耐久=100,价格=100,分类=60,总类=2000}
	}

	self.商品组[18]["仙玉"]={
		{可叠加=false,名称="小额银票",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","小额银票")+0},
		{可叠加=false,名称="大额银票",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","大额银票")+0},
		{可叠加=false,名称="附魔宝珠",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","附魔宝珠")+0},
		-- {可叠加=false,名称="内丹",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","内丹",价)+0,总类=1001},
		-- {可叠加=false,名称="天蚕丝",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","天蚕丝")+0,总类=1001},
		-- {可叠加=false,名称="玄龟板",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","玄龟板")+0,总类=1001},
		-- {可叠加=false,名称="阴沉木",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","阴沉木")+0,总类=1001},
		-- {可叠加=false,名称="麒麟血",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","麒麟血")+0,总类=1001},
		-- {可叠加=false,名称="金凤羽",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","金凤羽")+0,总类=1001},
		-- {可叠加=false,名称="补天石",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","补天石")+0,总类=1001},
		-- {可叠加=false,名称="龙筋",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","龙筋")+0,总类=1001},
		{可叠加=false,名称="90级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","90级装备礼包")+0},
		{可叠加=false,名称="100级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","100级装备礼包")+0},
		{可叠加=false,名称="120级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","120级装备礼包")+0},
		{可叠加=false,名称="130级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","130级装备礼包")+0},
		{可叠加=false,名称="140级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","140级装备礼包")+0},
		{可叠加=false,名称="150级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","150级装备礼包")+0},
		{可叠加=false,名称="160级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","160级装备礼包")+0},
		{可叠加=false,名称="一级未激活符石",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","一级未激活符石")+0},
		{可叠加=false,名称="二级未激活符石",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","二级未激活符石")+0},
		{可叠加=false,名称="三级未激活符石",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","三级未激活符石")+0},
		{可叠加=false,名称="符石卷轴",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","符石卷轴")+0},
		{可叠加=false,名称="高级召唤兽内丹",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","高级召唤兽内丹")+0},
		{可叠加=false,名称="召唤兽内丹",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","召唤兽内丹")+0},
		{可叠加=false,名称="特赦令牌",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","特赦令牌")+0},
		{可叠加=false,名称="120级随机灵饰指南书",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","120级随机灵饰指南书")+0},
		{可叠加=false,名称="140级随机灵饰指南书",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","140级随机灵饰指南书")+0},
		{可叠加=false,名称="120级元灵晶石",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","120级元灵晶石")+0},
		{可叠加=false,名称="140级元灵晶石",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","140级元灵晶石")+0},
		{可叠加=true,总类=9,名称="初级神魂丹",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","初级神魂丹")+0,分类=1,子类=1},
		{可叠加=true,总类=9,名称="中级神魂丹",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","中级神魂丹")+0,分类=1,子类=1},
		{可叠加=true,总类=9,名称="高级神魂丹",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","高级神魂丹")+0,分类=1,子类=1},
		{可叠加=true,总类=9,名称="坐骑内丹",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","坐骑内丹")+0,分类=1,子类=1},
		-- {可叠加=false,名称="摇钱树苗",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","小额银票")+0},
		{可叠加=true,名称="元宵",食材="芝麻沁香",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","攻资元宵")+0},
		{可叠加=true,名称="元宵",食材="桂花酒酿",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","防御元宵")+0},
		{可叠加=true,名称="元宵",食材="细磨豆沙",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","速度元宵")+0},
		{可叠加=true,名称="元宵",食材="蜜糖腰果",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","躲避元宵")+0},
		{可叠加=true,名称="元宵",食材="山楂拔丝",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","体力元宵")+0},
		{可叠加=true,名称="元宵",食材="滑玉莲蓉",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","法力元宵")+0},
		{可叠加=true,名称="炼兽真经",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","炼兽真经")+0},
		{可叠加=true,名称="一倍经验丹",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","一倍经验丹")+0},
		{可叠加=true,名称="双倍经验丹",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","双倍经验丹")+0},

		{可叠加=false,名称="红木短剑",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","大额银票")+0},
		{可叠加=false,名称="竹马",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","大额银票")+0},
		{可叠加=false,名称="山海经",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","大额银票")+0},
		{可叠加=false,名称="搜神记",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","大额银票")+0},
		{可叠加=false,名称="论语",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","大额银票")+0},
		{可叠加=false,名称="瑶池蟠桃",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","大额银票")+0},
		{可叠加=false,名称="玉灵果",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","大额银票")+0},
		{可叠加=false,名称="逍遥镜",不可交易=true,价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","大额银票")+0},
		{可叠加=false,名称="孤儿名册",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","大额银票")+0},
		{可叠加=false,名称="还魂秘术",附带技能="还魂秘术",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","大额银票")+0},
		{可叠加=false,名称="蚩尤武诀",附带技能="蚩尤之搏",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","大额银票")+0},
		{可叠加=false,名称="黄帝内经",附带技能="黄帝内经",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","大额银票")+0},
		{可叠加=false,名称="奇异果",附带技能="潜能激发",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","大额银票")+0},
		{可叠加=false,名称="六艺修行",附带技能="仙人指路",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","大额银票")+0},
		{可叠加=false,名称="六艺修行",附带技能="峰回路转",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","大额银票")+0},
		{可叠加=false,名称="六艺修行",附带技能="开门见山",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","大额银票")+0},
		{可叠加=false,名称="六艺修行",附带技能="张弛有道",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","大额银票")+0},
		{可叠加=false,名称="六艺修行",附带技能="四面埋伏",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","大额银票")+0},
		{可叠加=false,名称="六艺修行",附带技能="千锤百炼",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","大额银票")+0},
		{可叠加=false,名称="六艺修行",附带技能="赴汤蹈火",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","大额银票")+0},


		{可叠加=false,名称="超级碎星锤",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","超级碎星锤")+0},
		{可叠加=false,名称="展翅高飞",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","展翅高飞")+0,总类="坐骑饰品"},
		{可叠加=false,名称="旗开得胜",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","旗开得胜")+0,总类="坐骑饰品"},
		{可叠加=false,名称="霸王雄风",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","霸王雄风")+0,总类="坐骑饰品"},
		{可叠加=false,名称="独眼观天",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","独眼观天")+0,总类="坐骑饰品"},
		{可叠加=false,名称="威武不屈",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","威武不屈")+0,总类="坐骑饰品"},
		{可叠加=false,名称="深藏不露",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","深藏不露")+0,总类="坐骑饰品"},
		{可叠加=false,名称="异域浓情",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","异域浓情")+0,总类="坐骑饰品"},
		{可叠加=false,名称="流星天马",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","流星天马")+0,总类="坐骑饰品"},
		{可叠加=false,名称="威猛将军",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","威猛将军")+0,总类="坐骑饰品"},
		{可叠加=false,名称="知情达理",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","知情达理")+0,总类="坐骑饰品"},
		{可叠加=false,名称="气宇轩昂",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","气宇轩昂")+0,总类="坐骑饰品"},
		{可叠加=false,名称="如花似玉",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","如花似玉")+0,总类="坐骑饰品"},
		{可叠加=false,名称="傲视天下",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","傲视天下")+0,总类="坐骑饰品"},
		{可叠加=false,名称="铁血豪情",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","铁血豪情")+0,总类="坐骑饰品"},
		{可叠加=false,名称="唯我独尊",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","唯我独尊")+0,总类="坐骑饰品"},
		{可叠加=false,名称="叱咤风云",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","叱咤风云")+0,总类="坐骑饰品"},
		{可叠加=false,名称="异域风情",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","异域风情")+0,总类="坐骑饰品"},
		{可叠加=false,名称="假面勇者",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","假面勇者")+0,总类="坐骑饰品"},
		{可叠加=false,名称="霓裳魅影",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","霓裳魅影")+0,总类="坐骑饰品"},
		{可叠加=false,名称="披星戴月",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","披星戴月")+0,总类="坐骑饰品"},
		{可叠加=false,名称="烈焰燃情",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","烈焰燃情")+0,总类="坐骑饰品"},
		{可叠加=false,名称="天雨流芳",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","天雨流芳")+0,总类="坐骑饰品"},
		{可叠加=false,名称="灵光再现",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","灵光再现")+0,总类="坐骑饰品"},
		{可叠加=false,名称="倾国倾城",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","倾国倾城")+0,总类="坐骑饰品"},
	}
	if 释怀定制 then
	    table.insert(self.商品组[18]["仙玉"], {可叠加=false,名称="160级高级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","160级高级装备礼包")+0})
	    table.insert(self.商品组[18]["仙玉"], {可叠加=false,名称="跨服专属礼包",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","跨服专属礼包")+0})
	end
	if 老七定制 then
	    table.insert(self.商品组[18]["仙玉"], {可叠加=true,名称="神秘钥匙",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","神秘钥匙")+0})
	end
	if 老唐定制 then
	    table.insert(self.商品组[18]["仙玉"], {可叠加=true,名称="神秘钥匙",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","神秘钥匙")+0})
	    table.insert(self.商品组[18]["仙玉"], {可叠加=false,名称="融合石",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","融合石")+0,总类=5,分类=6,子类=9})
	end
	if 让海啸席卷 then
	    table.insert(self.商品组[18]["仙玉"], {可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=140,价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","140级百炼精铁")+0})
	    table.insert(self.商品组[18]["仙玉"], {可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=150,价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","150级百炼精铁")+0})
	    table.insert(self.商品组[18]["仙玉"], {可叠加=false,名称="140级随机指南书",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","140级随机指南书")+0})
	    table.insert(self.商品组[18]["仙玉"], {可叠加=false,名称="150级随机指南书",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","150级随机指南书")+0})
	end
	if 老八定制 then
		table.insert(self.商品组[18]["仙玉"],{可叠加=false,名称="钟灵石",总类=5,分类=6,子类=8,价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","心源")+0,级别限制=1,附加特性="心源"})
		table.insert(self.商品组[18]["仙玉"],{可叠加=false,名称="钟灵石",总类=5,分类=6,子类=8,价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","狂浪滔天")+0,级别限制=1,附加特性="狂浪滔天"})
		table.insert(self.商品组[18]["仙玉"],{可叠加=false,名称="钟灵石",总类=5,分类=6,子类=8,价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","固若金汤")+0,级别限制=1,附加特性="固若金汤"})
		table.insert(self.商品组[18]["仙玉"],{可叠加=false,名称="钟灵石",总类=5,分类=6,子类=8,价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","锐不可当")+0,级别限制=1,附加特性="锐不可当"})
		table.insert(self.商品组[18]["仙玉"],{可叠加=false,名称="钟灵石",总类=5,分类=6,子类=8,价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","通真达灵")+0,级别限制=1,附加特性="通真达灵"})
		table.insert(self.商品组[18]["仙玉"],{可叠加=false,名称="钟灵石",总类=5,分类=6,子类=8,价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","血气方刚")+0,级别限制=1,附加特性="血气方刚"})
		table.insert(self.商品组[18]["仙玉"],{可叠加=false,名称="钟灵石",总类=5,分类=6,子类=8,价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","健步如飞")+0,级别限制=1,附加特性="健步如飞"})
	end
	self.商品组[18]["积分"]={
		{可叠加=true,子类=1,总类=5,名称="青龙石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","青龙石")+0,分类=4},
		{可叠加=true,子类=2,总类=5,名称="白虎石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","白虎石")+0,分类=4},
		{可叠加=true,子类=3,总类=5,名称="朱雀石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","朱雀石")+0,分类=4},
		{可叠加=true,子类=4,总类=5,名称="玄武石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","玄武石")+0,分类=4},
		{可叠加=true,名称="秘制红罗羹",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","秘制红罗羹")+0},
		{可叠加=true,名称="秘制绿罗羹",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","秘制绿罗羹")+0},
		{可叠加=true,名称="月华露",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","月华露")+0,阶品=500},
		{可叠加=true,名称="修炼果",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","修炼果")+0,阶品=500},
		{可叠加=true,名称="九转金丹",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","九转金丹")+0,阶品=500},
		{可叠加=true,名称="易经丹",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","易经丹")+0},
		{可叠加=true,名称="玉葫灵髓",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","玉葫灵髓")+0},
		{可叠加=true,名称="清灵净瓶",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","清灵净瓶")+0},
		{可叠加=true,名称="海马",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","海马")+0},
		{可叠加=true,名称="彩果",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","彩果")+0},
		{可叠加=false,名称="星辉石",总类=5,分类=6,子类=8,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","星辉石")+0,级别限制=1},
		{可叠加=false,名称="光芒石",总类=5,分类=6,子类=1,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","光芒石")+0,级别限制=1},
		{可叠加=false,名称="月亮石",总类=5,分类=6,子类=2,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","月亮石")+0,级别限制=1},
		{可叠加=false,名称="太阳石",总类=5,分类=6,子类=3,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","太阳石")+0,级别限制=1},
		{可叠加=false,名称="舍利子",总类=5,分类=6,子类=4,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","舍利子")+0,级别限制=1},
		{可叠加=false,名称="红玛瑙",总类=5,分类=6,子类=5,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","红玛瑙")+0,级别限制=1},
		{可叠加=false,名称="黑宝石",总类=5,分类=6,子类=6,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","黑宝石")+0,级别限制=1},
		{可叠加=false,名称="神秘石",总类=5,分类=6,子类=7,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","神秘石")+0,级别限制=1},
		{可叠加=false,名称="60级随机灵饰指南书",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","60级随机灵饰指南书")+0},
		{可叠加=false,名称="80级随机灵饰指南书",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","80级随机灵饰指南书")+0},
		{可叠加=false,名称="100级随机灵饰指南书",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","100级随机灵饰指南书")+0},
		{可叠加=false,名称="60级元灵晶石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","60级元灵晶石")+0},
		{可叠加=false,名称="80级元灵晶石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","80级元灵晶石")+0},
		{可叠加=false,名称="100级元灵晶石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","100级元灵晶石")+0},
		{可叠加=false,名称="附魔宝珠",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","附魔宝珠")+0},
		{可叠加=false,名称="90级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","90级装备礼包")+0},
		{可叠加=false,名称="100级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","100级装备礼包")+0},
		{可叠加=false,名称="120级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","120级装备礼包")+0},
		{可叠加=false,名称="130级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","130级装备礼包")+0},
		{可叠加=false,名称="140级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","140级装备礼包")+0},
		{可叠加=false,名称="150级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","150级装备礼包")+0},
		{可叠加=false,名称="一级未激活符石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","一级未激活符石")+0},
		{可叠加=false,名称="二级未激活符石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","二级未激活符石")+0},
		{可叠加=false,名称="三级未激活符石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","三级未激活符石")+0},
		{可叠加=false,名称="符石卷轴",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","符石卷轴")+0},
		{可叠加=false,名称="高级召唤兽内丹",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","高级召唤兽内丹")+0},
		{可叠加=false,名称="召唤兽内丹",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","召唤兽内丹")+0},
		{可叠加=false,名称="特赦令牌",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","特赦令牌")+0},
		{可叠加=false,名称="120级随机灵饰指南书",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","120级随机灵饰指南书")+0},
		{可叠加=false,名称="140级随机灵饰指南书",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","140级随机灵饰指南书")+0},
		{可叠加=false,名称="120级元灵晶石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","120级元灵晶石")+0},
		{可叠加=false,名称="140级元灵晶石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","140级元灵晶石")+0},
		{可叠加=false,名称="展翅高飞",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","展翅高飞")+0,总类="坐骑饰品"},
		{可叠加=false,名称="旗开得胜",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","旗开得胜")+0,总类="坐骑饰品"},
		{可叠加=false,名称="霸王雄风",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","霸王雄风")+0,总类="坐骑饰品"},
		{可叠加=false,名称="独眼观天",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","独眼观天")+0,总类="坐骑饰品"},
		{可叠加=false,名称="威武不屈",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","威武不屈")+0,总类="坐骑饰品"},
		{可叠加=false,名称="深藏不露",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","深藏不露")+0,总类="坐骑饰品"},
		{可叠加=false,名称="异域浓情",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","异域浓情")+0,总类="坐骑饰品"},
		{可叠加=false,名称="流星天马",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","流星天马")+0,总类="坐骑饰品"},
		{可叠加=false,名称="威猛将军",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","威猛将军")+0,总类="坐骑饰品"},
		{可叠加=false,名称="知情达理",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","知情达理")+0,总类="坐骑饰品"},
		{可叠加=false,名称="气宇轩昂",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","气宇轩昂")+0,总类="坐骑饰品"},
		{可叠加=false,名称="如花似玉",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","如花似玉")+0,总类="坐骑饰品"},
		{可叠加=false,名称="傲视天下",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","傲视天下")+0,总类="坐骑饰品"},
		{可叠加=false,名称="铁血豪情",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","铁血豪情")+0,总类="坐骑饰品"},
		{可叠加=false,名称="唯我独尊",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","唯我独尊")+0,总类="坐骑饰品"},
		{可叠加=false,名称="叱咤风云",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","叱咤风云")+0,总类="坐骑饰品"},
		{可叠加=false,名称="异域风情",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","异域风情")+0,总类="坐骑饰品"},
		{可叠加=false,名称="假面勇者",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","假面勇者")+0,总类="坐骑饰品"},
		{可叠加=false,名称="霓裳魅影",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","霓裳魅影")+0,总类="坐骑饰品"},
		{可叠加=false,名称="披星戴月",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","披星戴月")+0,总类="坐骑饰品"},
		{可叠加=false,名称="烈焰燃情",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","烈焰燃情")+0,总类="坐骑饰品"},
		{可叠加=false,名称="天雨流芳",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","天雨流芳")+0,总类="坐骑饰品"},
		{可叠加=false,名称="灵光再现",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","灵光再现")+0,总类="坐骑饰品"},
		{可叠加=false,名称="倾国倾城",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","倾国倾城")+0,总类="坐骑饰品"},
		{名称="碧华锦凝雪",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","碧华锦凝雪")+0,锦衣=true,子类=1},
		{名称="夜影",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","夜影")+0,锦衣=true,子类=1},
		{名称="夏日清凉",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","夏日清凉")+0,锦衣=true,子类=1},
		{名称="华风汉雅",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","华风汉雅")+0,锦衣=true,子类=1},
		{名称="萌萌小厨",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","萌萌小厨")+0,锦衣=true,子类=1},
		{名称="浩瀚星河",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","浩瀚星河")+0,锦衣=true,子类=2},
		{名称="烈焰澜翻",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","烈焰澜翻")+0,锦衣=true,子类=2},
		{名称="水墨游龙",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","水墨游龙")+0,锦衣=true,子类=2},
		{名称="星光熠熠",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","星光熠熠")+0,锦衣=true,子类=2},
		{名称="双鲤寄情",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","双鲤寄情")+0,锦衣=true,子类=2},
		{名称="凌波微步",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","凌波微步")+0,锦衣=true,子类=2},
		{名称="荷塘涟漪",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","荷塘涟漪")+0,锦衣=true,子类=2},
		{名称="雪花飘落",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","雪花飘落")+0,锦衣=true,子类=2},
		{名称="月影婆娑",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","月影婆娑")+0,锦衣=true,子类=2},
		{名称="祥云瑞气",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","祥云瑞气")+0,锦衣=true,子类=2},
		{名称="花的海洋",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","花的海洋")+0,锦衣=true,子类=2},
		{名称="爱的光影",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","爱的光影")+0,锦衣=true,子类=2},
		{名称="珠落玉盘",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","珠落玉盘")+0,锦衣=true,子类=2},
		{名称="红叶随风",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","红叶随风")+0,锦衣=true,子类=2},
		{名称="龙卷风足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","龙卷风足迹")+0,锦衣=true,子类=3},
		{名称="皮球足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","皮球足迹")+0,锦衣=true,子类=3},
		{名称="雀屏足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","雀屏足迹")+0,锦衣=true,子类=3},
		{名称="旋律足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","旋律足迹")+0,锦衣=true,子类=3},
		{名称="枫叶足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","枫叶足迹")+0,锦衣=true,子类=3},
		{名称="飞天足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","飞天足迹")+0,锦衣=true,子类=3},
		{名称="两心相悦足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","两心相悦足迹")+0,锦衣=true,子类=3},
		{名称="心花怒放",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","心花怒放")+0,锦衣=true,子类=3},
		{名称="雷电足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","雷电足迹")+0,锦衣=true,子类=3},
		{名称="寒冰足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","寒冰足迹")+0,锦衣=true,子类=3},
		{名称="星星祈愿",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","星星祈愿")+0,锦衣=true,子类=3},
		{名称="地狱焰火",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","地狱焰火")+0,锦衣=true,子类=3},
		{名称="元宝足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","元宝足迹")+0,锦衣=true,子类=3},
		{名称="光剑足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","光剑足迹")+0,锦衣=true,子类=3},
		{名称="雪花足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","雪花足迹")+0,锦衣=true,子类=3},
	-- 	{名称="魔骨战熊",总类="祥瑞",分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","魔骨战熊"),子类=2},
	-- 	{名称="青霄天麟",总类="祥瑞",分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","青霄天麟"),子类=2},
	-- 	{名称="莽林猛犸",总类="祥瑞",分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","莽林猛犸"),子类=2},
	-- 	{名称="琉璃宝象",总类="祥瑞",分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","琉璃宝象"),子类=2},
	-- 	{名称="踏雪灵熊",总类="祥瑞",分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","踏雪灵熊"),子类=2},
	-- 	{名称="玄火神驹",总类="祥瑞",分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","玄火神驹"),子类=2},
	-- 	{名称="沉星寒犀",总类="祥瑞",分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","沉星寒犀"),子类=2},
	}
	self.商品组[18]["比武积分"]={
		{可叠加=true,子类=1,总类=5,名称="青龙石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","青龙石")+0,分类=4},
		{可叠加=true,子类=2,总类=5,名称="白虎石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","白虎石")+0,分类=4},
		{可叠加=true,子类=3,总类=5,名称="朱雀石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","朱雀石")+0,分类=4},
		{可叠加=true,子类=4,总类=5,名称="玄武石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","玄武石")+0,分类=4},
		{可叠加=true,名称="秘制红罗羹",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","秘制红罗羹")+0},
		{可叠加=true,名称="秘制绿罗羹",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","秘制绿罗羹")+0},
		{可叠加=true,名称="月华露",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","月华露")+0,阶品=500},
		{可叠加=true,名称="修炼果",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","修炼果")+0,阶品=500},
		{可叠加=true,名称="九转金丹",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","九转金丹")+0,阶品=500},
		{可叠加=true,名称="易经丹",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","易经丹")+0},
		{可叠加=true,名称="玉葫灵髓",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","玉葫灵髓")+0},
		{可叠加=true,名称="清灵净瓶",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","清灵净瓶")+0},
		{可叠加=true,名称="海马",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","海马")+0},
		{可叠加=true,名称="彩果",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","彩果")+0},
		{可叠加=false,名称="星辉石",总类=5,分类=6,子类=8,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","星辉石")+0,级别限制=1},
		{可叠加=false,名称="光芒石",总类=5,分类=6,子类=1,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","光芒石")+0,级别限制=1},
		{可叠加=false,名称="月亮石",总类=5,分类=6,子类=2,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","月亮石")+0,级别限制=1},
		{可叠加=false,名称="太阳石",总类=5,分类=6,子类=3,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","太阳石")+0,级别限制=1},
		{可叠加=false,名称="舍利子",总类=5,分类=6,子类=4,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","舍利子")+0,级别限制=1},
		{可叠加=false,名称="红玛瑙",总类=5,分类=6,子类=5,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","红玛瑙")+0,级别限制=1},
		{可叠加=false,名称="黑宝石",总类=5,分类=6,子类=6,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","黑宝石")+0,级别限制=1},
		{可叠加=false,名称="神秘石",总类=5,分类=6,子类=7,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","神秘石")+0,级别限制=1},
		{可叠加=false,名称="60级随机灵饰指南书",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","60级随机灵饰指南书")+0},
		{可叠加=false,名称="80级随机灵饰指南书",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","80级随机灵饰指南书")+0},
		{可叠加=false,名称="100级随机灵饰指南书",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","100级随机灵饰指南书")+0},
		{可叠加=false,名称="60级元灵晶石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","60级元灵晶石")+0},
		{可叠加=false,名称="80级元灵晶石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","80级元灵晶石")+0},
		{可叠加=false,名称="100级元灵晶石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","100级元灵晶石")+0},
		{可叠加=false,名称="附魔宝珠",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","附魔宝珠")+0},
		{可叠加=false,名称="90级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","90级装备礼包")+0},
		{可叠加=false,名称="100级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","100级装备礼包")+0},
		{可叠加=false,名称="120级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","120级装备礼包")+0},
		{可叠加=false,名称="130级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","130级装备礼包")+0},
		{可叠加=false,名称="140级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","140级装备礼包")+0},
		{可叠加=false,名称="150级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","150级装备礼包")+0},
		{可叠加=false,名称="一级未激活符石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","一级未激活符石")+0},
		{可叠加=false,名称="二级未激活符石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","二级未激活符石")+0},
		{可叠加=false,名称="三级未激活符石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","三级未激活符石")+0},
		{可叠加=false,名称="符石卷轴",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","符石卷轴")+0},
		{可叠加=false,名称="高级召唤兽内丹",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","高级召唤兽内丹")+0},
		{可叠加=false,名称="召唤兽内丹",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","召唤兽内丹")+0},
		{可叠加=false,名称="特赦令牌",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","特赦令牌")+0},
		{可叠加=false,名称="120级随机灵饰指南书",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","120级随机灵饰指南书")+0},
		{可叠加=false,名称="140级随机灵饰指南书",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","140级随机灵饰指南书")+0},
		{可叠加=false,名称="120级元灵晶石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","120级元灵晶石")+0},
		{可叠加=false,名称="140级元灵晶石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","140级元灵晶石")+0},
		{可叠加=false,名称="展翅高飞",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","展翅高飞")+0,总类="坐骑饰品"},
		{可叠加=false,名称="旗开得胜",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","旗开得胜")+0,总类="坐骑饰品"},
		{可叠加=false,名称="霸王雄风",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","霸王雄风")+0,总类="坐骑饰品"},
		{可叠加=false,名称="独眼观天",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","独眼观天")+0,总类="坐骑饰品"},
		{可叠加=false,名称="威武不屈",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","威武不屈")+0,总类="坐骑饰品"},
		{可叠加=false,名称="深藏不露",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","深藏不露")+0,总类="坐骑饰品"},
		{可叠加=false,名称="异域浓情",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","异域浓情")+0,总类="坐骑饰品"},
		{可叠加=false,名称="流星天马",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","流星天马")+0,总类="坐骑饰品"},
		{可叠加=false,名称="威猛将军",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","威猛将军")+0,总类="坐骑饰品"},
		{可叠加=false,名称="知情达理",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","知情达理")+0,总类="坐骑饰品"},
		{可叠加=false,名称="气宇轩昂",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","气宇轩昂")+0,总类="坐骑饰品"},
		{可叠加=false,名称="如花似玉",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","如花似玉")+0,总类="坐骑饰品"},
		{可叠加=false,名称="傲视天下",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","傲视天下")+0,总类="坐骑饰品"},
		{可叠加=false,名称="铁血豪情",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","铁血豪情")+0,总类="坐骑饰品"},
		{可叠加=false,名称="唯我独尊",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","唯我独尊")+0,总类="坐骑饰品"},
		{可叠加=false,名称="叱咤风云",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","叱咤风云")+0,总类="坐骑饰品"},
		{可叠加=false,名称="异域风情",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","异域风情")+0,总类="坐骑饰品"},
		{可叠加=false,名称="假面勇者",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","假面勇者")+0,总类="坐骑饰品"},
		{可叠加=false,名称="霓裳魅影",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","霓裳魅影")+0,总类="坐骑饰品"},
		{可叠加=false,名称="披星戴月",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","披星戴月")+0,总类="坐骑饰品"},
		{可叠加=false,名称="烈焰燃情",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","烈焰燃情")+0,总类="坐骑饰品"},
		{可叠加=false,名称="天雨流芳",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","天雨流芳")+0,总类="坐骑饰品"},
		{可叠加=false,名称="灵光再现",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","灵光再现")+0,总类="坐骑饰品"},
		{可叠加=false,名称="倾国倾城",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","倾国倾城")+0,总类="坐骑饰品"},
		{名称="碧华锦凝雪",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","碧华锦凝雪")+0,锦衣=true,子类=1},
		{名称="夜影",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","夜影")+0,锦衣=true,子类=1},
		{名称="夏日清凉",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","夏日清凉")+0,锦衣=true,子类=1},
		{名称="华风汉雅",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","华风汉雅")+0,锦衣=true,子类=1},
		{名称="萌萌小厨",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","萌萌小厨")+0,锦衣=true,子类=1},
		{名称="浩瀚星河",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","浩瀚星河")+0,锦衣=true,子类=2},
		{名称="烈焰澜翻",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","烈焰澜翻")+0,锦衣=true,子类=2},
		{名称="水墨游龙",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","水墨游龙")+0,锦衣=true,子类=2},
		{名称="星光熠熠",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","星光熠熠")+0,锦衣=true,子类=2},
		{名称="双鲤寄情",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","双鲤寄情")+0,锦衣=true,子类=2},
		{名称="凌波微步",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","凌波微步")+0,锦衣=true,子类=2},
		{名称="荷塘涟漪",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","荷塘涟漪")+0,锦衣=true,子类=2},
		{名称="雪花飘落",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","雪花飘落")+0,锦衣=true,子类=2},
		{名称="月影婆娑",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","月影婆娑")+0,锦衣=true,子类=2},
		{名称="祥云瑞气",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","祥云瑞气")+0,锦衣=true,子类=2},
		{名称="花的海洋",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","花的海洋")+0,锦衣=true,子类=2},
		{名称="爱的光影",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","爱的光影")+0,锦衣=true,子类=2},
		{名称="珠落玉盘",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","珠落玉盘")+0,锦衣=true,子类=2},
		{名称="红叶随风",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","红叶随风")+0,锦衣=true,子类=2},
		{名称="龙卷风足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","龙卷风足迹")+0,锦衣=true,子类=3},
		{名称="皮球足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","皮球足迹")+0,锦衣=true,子类=3},
		{名称="雀屏足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","雀屏足迹")+0,锦衣=true,子类=3},
		{名称="旋律足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","旋律足迹")+0,锦衣=true,子类=3},
		{名称="枫叶足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","枫叶足迹")+0,锦衣=true,子类=3},
		{名称="飞天足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","飞天足迹")+0,锦衣=true,子类=3},
		{名称="两心相悦足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","两心相悦足迹")+0,锦衣=true,子类=3},
		{名称="心花怒放",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","心花怒放")+0,锦衣=true,子类=3},
		{名称="雷电足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","雷电足迹")+0,锦衣=true,子类=3},
		{名称="寒冰足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","寒冰足迹")+0,锦衣=true,子类=3},
		{名称="星星祈愿",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","星星祈愿")+0,锦衣=true,子类=3},
		{名称="地狱焰火",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","地狱焰火")+0,锦衣=true,子类=3},
		{名称="元宝足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","元宝足迹")+0,锦衣=true,子类=3},
		{名称="光剑足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","光剑足迹")+0,锦衣=true,子类=3},
		{名称="雪花足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","雪花足迹")+0,锦衣=true,子类=3},
	-- 	{名称="魔骨战熊",总类="祥瑞",分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","魔骨战熊"),子类=2},
	-- 	{名称="青霄天麟",总类="祥瑞",分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","青霄天麟"),子类=2},
	-- 	{名称="莽林猛犸",总类="祥瑞",分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","莽林猛犸"),子类=2},
	-- 	{名称="琉璃宝象",总类="祥瑞",分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","琉璃宝象"),子类=2},
	-- 	{名称="踏雪灵熊",总类="祥瑞",分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","踏雪灵熊"),子类=2},
	-- 	{名称="玄火神驹",总类="祥瑞",分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","玄火神驹"),子类=2},
	-- 	{名称="沉星寒犀",总类="祥瑞",分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","沉星寒犀"),子类=2},
	}
	self.商品组[18]["种族积分"]={
		{可叠加=false,名称="特赦令牌",价格=500000}
	}
	self.商品组[18]["副本积分"]={
		{可叠加=false,名称="特赦令牌",价格=500000}
	}
	self.商品组[18]["妖魔积分"]={
		{可叠加=false,名称="特赦令牌",价格=500000}
	}
	self.商品组[18]["折扣"]={
		{可叠加=false,名称="特赦令牌",价格=500000}
	}
	self.商品组[18]["锦衣祥瑞"]={
		{名称="碧华锦凝雪",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","碧华锦凝雪")+0,锦衣=true,子类=1},

		{名称="夜影",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","夜影")+0,锦衣=true,子类=1},
		{名称="夏日清凉",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","夏日清凉")+0,锦衣=true,子类=1},
		{名称="华风汉雅",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","华风汉雅")+0,锦衣=true,子类=1},
		{名称="萌萌小厨",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","萌萌小厨")+0,锦衣=true,子类=1},
	}
	self.商品组[18]["锦衣"]={
		{名称="碧华锦凝雪",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","碧华锦凝雪")+0,锦衣=true,子类=1},

		{名称="夜影",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","夜影")+0,锦衣=true,子类=1},
		{名称="夏日清凉",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","夏日清凉")+0,锦衣=true,子类=1},
		{名称="华风汉雅",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","华风汉雅")+0,锦衣=true,子类=1},
		{名称="萌萌小厨",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","萌萌小厨")+0,锦衣=true,子类=1},
	}
	self.商品组[18]["祥瑞"]={
		{名称="魔骨战熊",总类="祥瑞",分类=16,价格=9999999999999,子类=2},--f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","魔骨战熊")+0,子类=2},
		-- {名称="青霄天麟",总类="祥瑞",分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","青霄天麟")+0,子类=2},
		-- {名称="莽林猛犸",总类="祥瑞",分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","莽林猛犸")+0,子类=2},
		-- {名称="琉璃宝象",总类="祥瑞",分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","琉璃宝象")+0,子类=2},
		-- {名称="踏雪灵熊",总类="祥瑞",分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","踏雪灵熊")+0,子类=2},
		-- {名称="玄火神驹",总类="祥瑞",分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","玄火神驹")+0,子类=2},
		-- {名称="沉星寒犀",总类="祥瑞",分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","沉星寒犀")+0,子类=2},
	}
	self.商品组[18]["足迹"]={
		{名称="龙卷风足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","龙卷风足迹")+0,锦衣=true,子类=3},
		{名称="皮球足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","皮球足迹")+0,锦衣=true,子类=3},
		{名称="雀屏足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","雀屏足迹")+0,锦衣=true,子类=3},
		{名称="旋律足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","旋律足迹")+0,锦衣=true,子类=3},
		{名称="枫叶足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","枫叶足迹")+0,锦衣=true,子类=3},
		{名称="飞天足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","飞天足迹")+0,锦衣=true,子类=3},
		{名称="两心相悦足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","两心相悦足迹")+0,锦衣=true,子类=3},
		{名称="心花怒放",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","心花怒放")+0,锦衣=true,子类=3},
		{名称="雷电足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","雷电足迹")+0,锦衣=true,子类=3},
		{名称="寒冰足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","寒冰足迹")+0,锦衣=true,子类=3},
		{名称="星星祈愿",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","星星祈愿")+0,锦衣=true,子类=3},
		{名称="地狱焰火",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","地狱焰火")+0,锦衣=true,子类=3},
		{名称="元宝足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","元宝足迹")+0,锦衣=true,子类=3},
		{名称="光剑足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","光剑足迹")+0,锦衣=true,子类=3},
		{名称="雪花足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","雪花足迹")+0,锦衣=true,子类=3},
	}

	self.商品组[18]["足印"]={
		{名称="浩瀚星河",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","浩瀚星河")+0,锦衣=true,子类=2},
		{名称="烈焰澜翻",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","烈焰澜翻")+0,锦衣=true,子类=2},
		{名称="水墨游龙",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","水墨游龙")+0,锦衣=true,子类=2},
		{名称="星光熠熠",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","星光熠熠")+0,锦衣=true,子类=2},
		{名称="双鲤寄情",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","双鲤寄情")+0,锦衣=true,子类=2},
		{名称="凌波微步",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","凌波微步")+0,锦衣=true,子类=2},
		{名称="荷塘涟漪",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","荷塘涟漪")+0,锦衣=true,子类=2},

		{名称="雪花飘落",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","雪花飘落")+0,锦衣=true,子类=2},
		{名称="月影婆娑",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","月影婆娑")+0,锦衣=true,子类=2},
		{名称="祥云瑞气",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","祥云瑞气")+0,锦衣=true,子类=2},
		{名称="花的海洋",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","花的海洋")+0,锦衣=true,子类=2},
		{名称="爱的光影",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","爱的光影")+0,锦衣=true,子类=2},
		{名称="珠落玉盘",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","珠落玉盘")+0,锦衣=true,子类=2},
		{名称="红叶随风",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","红叶随风")+0,锦衣=true,子类=2},
	}

	if 让海啸席卷 then
	    table.insert(self.商品组[18]["足印"], {名称="白色精灵",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","白色精灵")+0,锦衣=true,子类=2})
	    table.insert(self.商品组[18]["足印"], {名称="黑色精灵",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","黑色精灵")+0,锦衣=true,子类=2})
	    table.insert(self.商品组[18]["足印"], {名称="蓝色精灵",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","蓝色精灵")+0,锦衣=true,子类=2})
	    table.insert(self.商品组[18]["足印"], {名称="海豚精灵",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","海豚精灵")+0,锦衣=true,子类=2})
	end

	self.商品组[18]["宝宝"]={
		{模型="超级神龙",名称="超级神龙",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级神龙")+0},
		{模型="超级土地公公",名称="超级土地公公",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级土地公公")+0},
		{模型="超级六耳猕猴",名称="超级六耳猕猴",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级六耳猕猴")+0},
		{模型="超级神鸡",名称="超级神鸡",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级神鸡")+0},
		{模型="超级玉兔",名称="超级玉兔",类型="神兽",饰品=true,价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级玉兔")+0},
		{模型="超级神猴",名称="超级神猴",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级神猴")+0},
		{模型="超级神马",名称="超级神马",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级神马")+0},
		{模型="超级神羊",名称="超级神羊",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级神羊")+0},
		{模型="超级孔雀",名称="超级孔雀",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级孔雀")+0},
		{模型="超级灵狐",名称="超级灵狐",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级灵狐")+0},
		{模型="超级筋斗云",名称="超级筋斗云",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级筋斗云")+0},
		{模型="超级麒麟",名称="超级麒麟",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级麒麟")+0},
		{模型="超级大鹏",名称="超级大鹏",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级大鹏")+0},
		{模型="超级赤焰兽",名称="超级赤焰兽",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级赤焰兽")+0},
		{模型="超级白泽",名称="超级白泽",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级白泽")+0},
		{模型="超级灵鹿",名称="超级灵鹿",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级灵鹿")+0},
		{模型="超级大象",名称="超级大象",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级大象")+0},
		{模型="超级金猴",名称="超级金猴",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级金猴")+0},
		{模型="超级大熊猫",名称="超级大熊猫",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级大熊猫")+0},
		{模型="超级泡泡",名称="超级泡泡",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级泡泡")+0},
		{模型="超级神兔",名称="超级神兔",类型="神兽",饰品=true,价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级神兔")+0},
		{模型="超级神虎",名称="超级神虎",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级神虎")+0},
		{模型="超级神牛",名称="超级神牛",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级神牛")+0},
		-- {模型="超级海豚",名称="超级海豚",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级海豚")+0},
		{模型="超级人参娃娃",名称="超级人参娃娃",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级人参娃娃")+0},
		{模型="超级青鸾",名称="超级青鸾",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级青鸾")+0},
		{模型="超级腾蛇",名称="超级腾蛇",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级腾蛇")+0},
		{模型="超级神蛇",名称="超级神蛇",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级神蛇")+0},

		{模型="贪狼",名称="贪狼",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","贪狼")+0},
		{模型="谛听",名称="谛听",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","谛听")+0},
		{模型="进阶谛听",名称="进阶谛听",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","进阶谛听")+0},
		{模型="超级飞天",名称="超级飞天",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级飞天")+0},
		{模型="超级神狗",名称="超级神狗",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级神狗")+0},
		{模型="超级神鼠",名称="超级神鼠",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级神鼠")+0},
		{模型="超级神猪",名称="超级神猪",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级神猪")+0},
		{模型="超级小白龙",名称="超级小白龙",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级小白龙")+0},
		{模型="超级猪小戒",名称="超级猪小戒",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级猪小戒")+0},
		{模型="狐不归",名称="狐不归",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","狐不归")+0},
		{模型="进阶狐不归",名称="进阶狐不归",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","进阶狐不归")+0},
		{模型="花灵",名称="花灵",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","花灵")+0},
		{模型="进阶花灵",名称="进阶花灵",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","进阶花灵")+0},
		{模型="涂山雪",名称="涂山雪",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","涂山雪")+0},
		{模型="进阶涂山雪",名称="进阶涂山雪",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","进阶涂山雪")+0},
		{模型="月魅",名称="月魅",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","月魅")+0},
		{模型="进阶月魅",名称="进阶月魅",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","进阶月魅")+0},
		{模型="月影仙",名称="月影仙",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","月影仙")+0},
		{模型="进阶月影仙",名称="进阶月影仙",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","进阶月影仙")+0},
		{模型="云游火",名称="云游火",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","云游火")+0},
		{模型="进阶云游火",名称="进阶云游火",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","进阶云游火")+0},
		{模型="超级白泽兽",名称="超级白泽兽",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级白泽兽")+0},
		{模型="日游神",名称="日游神",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","日游神")+0},
		{模型="蚩尤童子",名称="蚩尤童子",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","蚩尤童子")+0},
		{模型="赤胆忠魂",名称="赤胆忠魂",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","赤胆忠魂")+0},
		{模型="雪精灵",名称="雪精灵",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","雪精灵")+0},
		{模型="开明兽",名称="开明兽",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","开明兽")+0},
		{模型="大浪淘沙",名称="大浪淘沙",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","大浪淘沙")+0},
	}

	self.商品组[18]["法宝"]={}
	local 名称={"碧玉葫芦","五色旗盒","飞剑","拭剑石","金甲仙衣","惊魂铃","嗜血幡","风袋","清心咒","九黎战鼓","盘龙壁","神行飞剑","汇灵盏","天师符","织女扇"}
	for i=1,#名称 do
		table.insert(self.商品组[18]["法宝"], self:商城取法宝(名称[i],1))
	end
	名称={"发瘟匣","断线木偶","五彩娃娃","七杀","金刚杵","兽王令","摄魂","附灵玉"}
	if 老八定制 then
	    名称={"发瘟匣","断线木偶","五彩娃娃","七杀","金刚杵","兽王令","摄魂"}
	end
	for i=1,#名称 do
		table.insert(self.商品组[18]["法宝"], self:商城取法宝(名称[i],2))
	end
	名称={"失心钹","五火神焰印","九幽","普渡","鬼泣","月光宝盒","混元伞","无魂傀儡","苍白纸人","聚宝盆","乾坤玄火塔","无尘扇","无字经","干将莫邪","慈悲","救命毫毛","伏魔天书","镇海珠","奇门五行令","月影"}
	if 老八定制 then
	    名称={"失心钹","五火神焰印","九幽","普渡","鬼泣","月光宝盒","混元伞","无魂傀儡","苍白纸人","聚宝盆","乾坤玄火塔","无尘扇","无字经","干将莫邪","慈悲","救命毫毛","伏魔天书","镇海珠","奇门五行令"}
	end
	for i=1,#名称 do
		table.insert(self.商品组[18]["法宝"], self:商城取法宝(名称[i],3))
	end
	名称={"流影云笛","宿幕星河","蟠龙玉璧","落星飞鸿","归元圣印","千斗金樽"}
	if 老八定制 then
	    名称={}
	end
	for i=1,#名称 do
		table.insert(self.商品组[18]["法宝"], self:商城取法宝(名称[i],4))
	end
	self.商品组[19]["活跃兑换"]={
		{可叠加=false,名称="特赦令牌",价格=500000},
	}
end

function 商城处理类:商城取法宝(名称,等级)
  local 识别码=os.time().."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  随机序列=随机序列+1
  local 法宝数据={}
  local 道具 = 取物品数据(名称)
  法宝数据.名称=名称
  法宝数据.总类=1000
  法宝数据.分类=道具[3]
  法宝数据.使用=道具[5]
  法宝数据.特技=道具[6]
  法宝数据.气血=0
  法宝数据.魔法=取灵气上限(道具[3])
  法宝数据.角色限制=道具[7] or 0
  法宝数据.五行=取五行()
  法宝数据.伤害=道具[8] or 0
  法宝数据.当前经验=0
  法宝数据.升级经验=法宝经验[法宝数据.分类][1]
  法宝数据.识别码=识别码
  法宝数据.价格=等级*(f函数.读配置(程序目录.."Shopping.ini","法宝","法宝")+0)
  return 法宝数据
end

function 商城处理类:数据处理(id,内容)
	self.允许购买 = true
	self.购买组号 = 内容.组号 + 0
	self.购买编号 = 内容.编号
	self.购买数量 = 内容.数量
	self.购买分类 = 内容.分类
	local 仙玉=f函数.读配置(程序目录..[[data\]]..玩家数据[id].账号..[[\账号信息.txt]],"账号配置","仙玉")+0
	local 银子=玩家数据[id].角色.数据.银子
	local 积分=玩家数据[id].角色.数据.比武积分.当前积分
	local 当前活跃=玩家数据[id].角色.数据.累积活跃.当前活跃
	if self.购买数量 > 99 then
		发送数据(玩家数据[id].连接id, 7, "#y/您的购买的数量超过99个!")
		return 0
	end
	if self.购买数量 == nil or self.购买分类== "宝宝" then
		self.购买数量 = 1
	elseif self.购买数量 == nil or (self.购买数量 ~= nil and self.购买数量 < 1) then
		self.购买数量 = 1
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 then
		self.购买总量 = 内容.数量
		self.购买数量 = 1
	else
		self.购买数量 = self.购买数量 + 0
	end
	local 购买价格 = self.商品组[self.购买组号][self.购买分类][self.购买编号].价格
	local 购买总价 = self.商品组[self.购买组号][self.购买分类][self.购买编号].价格*内容.数量
	if self.购买分类== "宝宝" then
		if #玩家数据[id].召唤兽.数据 >= 7 then
			发送数据(玩家数据[id].连接id, 7, "#y/您当前无法携带更多的召唤兽了")
			self.允许购买 = false
			return 0
		elseif 仙玉 < 购买总价 then
			发送数据(玩家数据[id].连接id, 7, "#y/您的仙玉不足")
			self.允许购买 = false
			return 0
		else
			self:扣除仙玉(仙玉,购买价格,id)
			玩家数据[id].召唤兽:添加召唤兽(self.商品组[self.购买组号][self.购买分类][self.购买编号].模型,nil,nil,true,0,内容.物法)
		    发送数据(玩家数据[id].连接id, 7, "#y/您花费了#R/" .. 购买价格 .. "#Y/点仙玉购买了1个#R/" .. self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
		end
	elseif self.购买分类== "法宝" then
		if 仙玉 < 购买价格 then
			发送数据(玩家数据[id].连接id, 7, "#y/您的仙玉不足")
			self.允许购买 = false
		end
		if self.允许购买 then
			self:扣除仙玉(仙玉,购买价格,id)
			玩家数据[id].道具:给予法宝(id,self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
			发送数据(玩家数据[id].连接id, 7, "#y/您花费了#R/" .. 购买价格 .. "#Y/点仙玉购买了1个#R/" .. self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
		end
	elseif self.购买分类 == "杂货" then
		for n = 1, self.购买数量 do
			self.临时格子 = 玩家数据[id].角色:取道具格子()
			if self.临时格子 == 0 then
				发送数据(玩家数据[id].连接id, 7, "#y/您身上似乎没有多余的道具存放空间")
				self.允许购买 = false
			end
			if  银子 <= 购买总价 then
				发送数据(玩家数据[id].连接id, 7, "#y/您的银子不足")
				self.允许购买 = false
			end
			if self.允许购买 then
				if self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 then
				    玩家数据[id].角色:扣除银子(购买总价,0,0,"商店购买",1)
				else
					玩家数据[id].角色:扣除银子(购买价格,0,0,"商店购买",1)
				end
				if self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{6})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "80级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{8})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "100级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{10})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{6})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "80级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{8})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "100级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{10})
				else
					self.道具编号 = 玩家数据[id].道具:取新编号()
					玩家数据[id].道具.数据[self.道具编号] = table.loadstring(table.tostring(self.商品组[self.购买组号][self.购买分类][self.购买编号]))
					玩家数据[id].道具.数据[self.道具编号].识别码=id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
					if self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 then
					    玩家数据[id].道具.数据[self.道具编号].数量=内容.数量
					end
					玩家数据[id].角色.数据.道具[self.临时格子]=self.道具编号
					if 玩家数据[id].道具.数据[self.道具编号].名称 == "高级魔兽要诀" then--可以参考 道具处理类:给予道具 函数
					 	玩家数据[id].道具.数据[self.道具编号].附带技能=取高级要诀()
					elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "魔兽要诀" then
					 	玩家数据[id].道具.数据[self.道具编号].附带技能=取低级要诀()
					elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "召唤兽内丹" then
					 	玩家数据[id].道具.数据[self.道具编号].附带技能=取内丹()
					elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "高级召唤兽内丹" then
					 	玩家数据[id].道具.数据[self.道具编号].附带技能=取内丹("高级")
					end
				end
			end
		end
		发送数据(玩家数据[id].连接id, 7, "#y/您花费了#R/" .. 购买总价 .. "#Y/两银子购买了#R/"..内容.数量.."个" .. self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
	elseif self.购买分类 == "积分" then
		for n = 1, self.购买数量 do
			self.临时格子 = 玩家数据[id].角色:取道具格子()
			if self.临时格子 == 0 then
				发送数据(玩家数据[id].连接id, 7, "#y/您身上似乎没有多余的道具存放空间")
				self.允许购买 = false
			end
			if  积分 <= 购买总价 then
				发送数据(玩家数据[id].连接id, 7, "#y/您的积分不足")
				self.允许购买 = false
			end
			if self.允许购买 then
				if self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 then
				    玩家数据[id].角色:扣除积分(购买总价,"积分商城",1)
				else
					玩家数据[id].角色:扣除积分(购买价格,0,0,"积分商城",1)
				end
				if self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{6})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "80级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{8})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "100级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{10})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{6})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "80级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{8})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "100级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{10})
				else
					self.道具编号 = 玩家数据[id].道具:取新编号()
					玩家数据[id].道具.数据[self.道具编号] = table.loadstring(table.tostring(self.商品组[self.购买组号][self.购买分类][self.购买编号]))
					玩家数据[id].道具.数据[self.道具编号].识别码=id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
					if self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 then
					    玩家数据[id].道具.数据[self.道具编号].数量=内容.数量
					end
					玩家数据[id].角色.数据.道具[self.临时格子]=self.道具编号
					if 玩家数据[id].道具.数据[self.道具编号].名称 == "高级魔兽要诀" then--可以参考 道具处理类:给予道具 函数
					 	玩家数据[id].道具.数据[self.道具编号].附带技能=取高级要诀()
					elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "魔兽要诀" then
					 	玩家数据[id].道具.数据[self.道具编号].附带技能=取低级要诀()
					elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "召唤兽内丹" then
					 	玩家数据[id].道具.数据[self.道具编号].附带技能=取内丹()
					elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "高级召唤兽内丹" then
					 	玩家数据[id].道具.数据[self.道具编号].附带技能=取内丹("高级")
					end
				end
			end
		end
		发送数据(玩家数据[id].连接id, 7, "#y/您花费了#R/" .. 购买总价 .. "#Y/点积分购买了#R/"..内容.数量.."个" .. self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
	elseif self.购买分类=="活跃兑换" then
		for n = 1, self.购买数量 do
			self.临时格子 = 玩家数据[id].角色:取道具格子()
			if self.临时格子 == 0 then
				发送数据(玩家数据[id].连接id, 7, "#y/您身上似乎没有多余的道具存放空间")
				self.允许购买 = false
			end
			if  当前活跃 <= 购买总价 then
				发送数据(玩家数据[id].连接id, 7, "#y/您的可用活跃不足")
				self.允许购买 = false
			end
			if self.允许购买 then
				if self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 then
				    玩家数据[id].角色:扣除活跃(购买总价,"活跃兑换",1)
				else
					玩家数据[id].角色:扣除活跃(购买价格,0,0,"活跃兑换",1)
				end
				if self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{6})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "80级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{8})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "100级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{10})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{6})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "80级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{8})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "100级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{10})
				else
					self.道具编号 = 玩家数据[id].道具:取新编号()
					玩家数据[id].道具.数据[self.道具编号] = table.loadstring(table.tostring(self.商品组[self.购买组号][self.购买分类][self.购买编号]))
					玩家数据[id].道具.数据[self.道具编号].识别码=id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
					if self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 then
					    玩家数据[id].道具.数据[self.道具编号].数量=内容.数量
					end
					玩家数据[id].角色.数据.道具[self.临时格子]=self.道具编号
					if 玩家数据[id].道具.数据[self.道具编号].名称 == "高级魔兽要诀" then--可以参考 道具处理类:给予道具 函数
					 	玩家数据[id].道具.数据[self.道具编号].附带技能=取高级要诀()
					elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "魔兽要诀" then
					 	玩家数据[id].道具.数据[self.道具编号].附带技能=取低级要诀()
					elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "召唤兽内丹" then
					 	玩家数据[id].道具.数据[self.道具编号].附带技能=取内丹()
					elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "高级召唤兽内丹" then
					 	玩家数据[id].道具.数据[self.道具编号].附带技能=取内丹("高级")
					end
				end
			end
		end
		发送数据(玩家数据[id].连接id, 7, "#y/您花费了#R/" .. 购买总价 .. "#Y/点可用活跃购买了#R/"..内容.数量.."个" .. self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
	else
		for n = 1, self.购买数量 do
			self.临时格子 = 玩家数据[id].角色:取道具格子()
			if self.临时格子 == 0 then
				发送数据(玩家数据[id].连接id, 7, "#y/您身上似乎没有多余的道具存放空间")
				self.允许购买 = false
			end
			if 仙玉 < 购买总价 then
				发送数据(玩家数据[id].连接id, 7, "#y/您的仙玉不足")
				self.允许购买 = false
			end
			if self.允许购买 then
				self:扣除仙玉(仙玉,购买总价,id)
				if self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "小额银票" then
				    玩家数据[id].角色:添加银子(100000000,"商城购买",1)
				    常规提示(id,"#Y/恭喜你从商城购买了#R/一亿两银子#Y/。")
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "大额银票" then
					玩家数据[id].角色:添加银子(200000000,"商城购买",1)
					常规提示(id,"#Y/恭喜你从商城购买了#R/两亿两银子#Y/。")
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "120级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{12})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "140级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{14})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "120级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{12})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "140级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{14})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "140级随机指南书" then
					玩家数据[id].道具:给予书铁(id,{14,14},"指南书")
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "150级随机指南书" then
					玩家数据[id].道具:给予书铁(id,{15,15},"指南书")
				else
					self.道具编号 = 玩家数据[id].道具:取新编号()
					玩家数据[id].道具.数据[self.道具编号] = table.loadstring(table.tostring(self.商品组[self.购买组号][self.购买分类][self.购买编号]))--复制物品(self.商品组[self.购买组号][self.购买分类][self.购买编号])--
					玩家数据[id].道具.数据[self.道具编号].识别码=id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
					if self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 then
					    玩家数据[id].道具.数据[self.道具编号].数量=内容.数量
					end
					if self.商品组[self.购买组号][self.购买分类][self.购买编号].总类 == 1001 then
						玩家数据[id].道具.数据[self.道具编号].不可交易=true
						玩家数据[id].道具.数据[self.道具编号].专用=true
					end
					if self.商品组[self.购买组号][self.购买分类][self.购买编号].总类 == "祥瑞" then
					    if 玩家数据[id].角色.数据.坐骑列表~= nil and #玩家数据[id].角色.数据.坐骑列表==7 then
					      常规提示(id,"#Y/购买[#R/"..self.商品组[self.购买组号][self.购买分类][self.购买编号].名称.."#Y/]坐骑失败!携带坐骑数量已上限.")
					      return false
					    else
					      常规提示(id,"#Y/恭喜你购买了[#R/"..self.商品组[self.购买组号][self.购买分类][self.购买编号].名称.."#Y/]坐骑!")
					      全局坐骑资料:获取坐骑(id,self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
					      发送数据(玩家数据[id].连接id,61,玩家数据[id].角色.数据.坐骑列表)
					    end
					else
						玩家数据[id].角色.数据.道具[self.临时格子]=self.道具编号
						if 玩家数据[id].道具.数据[self.道具编号].名称 == "高级魔兽要诀" then--可以参考 道具处理类:给予道具 函数
							玩家数据[id].道具.数据[self.道具编号].附带技能=取高级要诀()
						elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "魔兽要诀" then
							玩家数据[id].道具.数据[self.道具编号].附带技能=取低级要诀()
						elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "召唤兽内丹" then
							玩家数据[id].道具.数据[self.道具编号].附带技能=取内丹()
						elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "高级召唤兽内丹" then
						 	玩家数据[id].道具.数据[self.道具编号].附带技能=取内丹("高级")
						elseif 玩家数据[id].道具.数据[self.道具编号].总类 == "坐骑饰品" then
							local 坐骑饰品 = 取物品数据(玩家数据[id].道具.数据[self.道具编号].名称)
							玩家数据[id].道具.数据[self.道具编号].子类=坐骑饰品[4]
						end
					end
				end
			end
		end
		发送数据(玩家数据[id].连接id, 7, "#y/您花费了#R/" .. 购买总价 .. "#Y/点仙玉购买了#R/"..内容.数量.."个" .. self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
	end
end

function 内存加密(内容)
	return 内容
end

function 商城处理类:扣除仙玉(仙玉,扣除价格,id)
   仙玉=仙玉-扣除价格
   f函数.写配置(程序目录..[[data\]]..玩家数据[id].账号..[[\账号信息.txt]],"账号配置","仙玉",仙玉)
end

function 商城处理类:取商品组数据(id, 序号,积分商城)
	self.发送消息 = {}
	序号 = 序号 + 0
	local 妖魔兑换积分=0
	local 副本积分=0
	local 种族积分=0
	local 累积活跃=0
	local 当前活跃=0
	if 玩家数据[id].角色.数据.副本积分~=nil then
	    副本积分=玩家数据[id].角色.数据.副本积分
	end
	if 妖魔积分~=nil and 妖魔积分[id]~=nil then
		妖魔兑换积分=妖魔积分[id].当前
	end
	if 玩家数据[id].角色.数据.累积活跃~=nil then
	    累积活跃=玩家数据[id].角色.数据.累积活跃.总积分
	    当前活跃=玩家数据[id].角色.数据.累积活跃.当前积分
	end
	self.商品组[序号].银子 = 玩家数据[id].角色.数据.银子
	self.商品组[序号].积分数 = {比武积分=玩家数据[id].角色.数据.比武积分.当前积分,种族积分=种族积分,副本积分=副本积分,妖魔积分=妖魔兑换积分,累积活跃=累积活跃,当前活跃=当前活跃}
	self.商品组[序号].组号 = 序号
	self.商品组[序号].仙灵玉 = f函数.读配置(程序目录..[[data\]]..玩家数据[id].账号..[[\账号信息.txt]],"账号配置","仙玉")+0
	if 积分商城~=nil then
	    self.商品组[序号].序列=2
	else
		self.商品组[序号].序列=1
	end
	if 序号==18 then
		发送数据(玩家数据[id].连接id, 3700, self.商品组[序号])
	elseif 序号==19 then
		发送数据(玩家数据[id].连接id, 3701, self.商品组[序号])
	end

end
function 商城处理类:更新(dt) end
function 商城处理类:显示(x, y) end

return 商城处理类
