玩法介绍内容={}
--新手引导 10级以下
玩法介绍内容[1]=
[[
#P/[介绍]
#N/新手可以在出生地找新手使者领取一套20级装备。10级之间建议在建邺城挑战捣乱的水果赚取经验和不菲的储备金奖励；或者在建邺城衙门口领取新手任务然后去东海湾挂机#Y/(alt+Z)#N/杀怪。
#N/等级低时推荐全力加点，配合赠送的高等级无级别限制装备可以比较稳定打出伤害。长安城天台袁天罡处可以免费洗点一次，不用担心潜力点分配问题。
]]
--新手引导 10-50级
玩法介绍内容[2]=
[[
#P/[介绍]
#N/这个阶段赚取经验最好的方式就是在皇宫城门口领取双倍时间，然后去野外挂机#Y/(alt+Z)#N/杀怪。
#N/当然更重要的，是在10级的时候在长安南门口找门派传送人传送至你想加入的门派，拜个师傅。适当学习一些技能之后，开始你的梦幻征程。
#N/20级开始可以领取师门任务，经验奖励十分丰厚；30、40时同样可以挑战建邺城的捣乱的水果，50级时领取60级无级别装备后推荐尝试钟馗抓鬼。
]]
--日常挑战 捣乱的水果
玩法介绍内容[3]=
[[
#P/[活动介绍]
#N/捣乱的水果每小时刷新多次，出现地点有多个，根据系统频道提示的顺序难度依次提高。

#P/[挑战难度]
#N/怪物属性和挑战队伍的平均等级以及难度有关。

#P/[挑战奖励]
#N/战斗胜利后可获得较为丰厚的储备金奖励和一定人物经验，并有一定几率获得一级宝石和修炼丹。另外，难度越高，获得物品奖励的几率越大。
]]
--日常挑战 宝图任务
玩法介绍内容[4]=
[[
#P/[活动介绍]
#N/前往长安酒店找店小二花费少量银子就可以打听强盗所在地，战斗胜利后即有几率获得包含宝藏坐标的藏宝图。

#P/[挑战难度]
#N/怪物属性和挑战者的等级相关。

#P/[挑战奖励]
#N/战斗胜利后可100%或者一张藏宝图，并有几率同时获得一张额外的藏宝图；等级越高，获得额外藏宝图的几率越大。

#P/[挖宝图奖励]
#N/* 获得一定数量银子
#N/* 获得60-80级环装
#N/* 获得60-100级装备制造书或者百炼精铁
#N/* 获得65-115级炼妖石
#N/* 获得65-115级上古锻造图册
#N/* 获得金柳露或者超级金柳露
#N/* 获得60/80/100级灵饰指南书
#N/* 获得60/80/100级元灵晶石
#N/* 获得随机五宝
#N/* 获得随机低级魔兽要诀
#N/* 触发妖王活动
#N/* 触发封妖活动
]]
--师门任务
玩法介绍内容[5]=
[[
#P/[活动介绍]
#N/日常任务，每天前20个双倍经验和金钱奖励。
]]

--押镖活动
玩法介绍内容[6]=
[[
#P/[活动介绍]
#N/日常任务，每天50镖，阵法的主要产出，可获得大量的银子。
]]

--官职任务
玩法介绍内容[7]=
[[
#P/[活动介绍]
#N/日常任务，获得军功，每周可领取俸禄。

#P/[挑战难度]
#N/怪物属性和挑战队人物等级以及难度有关。

#P/[挑战奖励]
#N/可获得较为丰厚的储备金奖励和一定人物经验，并有一定几率获得阵法和一级宝石。
]]

--宝藏山
玩法介绍内容[8]=
[[
#P/[活动介绍]
#N/日常任务，每天上午11点和晚上8点开启。

#P/[挑战难度]
#N/怪物属性和挑战队伍的平均等级以及难度有关。

#P/[挑战奖励]
#N/可获得较为丰厚的储备金奖励和一定人物经验，并有一定几率获得强化石、月华露、20-60级书铁、金柳露、低级兽诀、五宝、超级金柳露。
]]

--幻域迷宫
玩法介绍内容[9]=
[[
#P/[活动介绍]
#N/日常任务，每天晚上9点开启幻域迷宫。

#P/[挑战难度]
#N/怪物属性和挑战队伍的平均等级以及难度有关。

#P/[挑战奖励]
#N/可获得较为丰厚的储备金奖励和一定人物经验，并有一定几率获得3-5级宝石、高级兽诀、修炼果、九转金丹、星辉石、60-80级灵饰书铁。
]]

--天庭叛逆
玩法介绍内容[10]=
[[
#P/[活动介绍]
#N/每小时刷新多次，出现在多个地图，根据系统提示挑战。

#P/[挑战难度]
#N/怪物属性和挑战队伍的平均等级以及难度有关。

#P/[挑战奖励]
#N/战斗胜利后可获得较为丰厚的银子奖励和一定人物经验，并有一定几率获得低级兽诀、九转金丹、2-3级宝石、1-2级星辉石。
]]

--妖魔
玩法介绍内容[11]=
[[
#P/[活动介绍]
#N/每小时的10分刷新活动怪，出现在多个地图，根据系统提示挑战。

#P/[挑战难度]
#N/怪物属性和挑战队伍的平均等级以及难度有关。

#P/[挑战奖励]
#N/战斗胜利后可获得较为丰厚的银子奖励和一定人物经验和妖魔积分。
]]

--游泳比赛
玩法介绍内容[12]=
[[
#P/[活动介绍]
#N/日常活动，每天的中午12点开启，晚上8点结束。

#P/[挑战难度]
#N/怪物属性和挑战队伍的平均等级以及难度有关。

#P/[挑战奖励]
#N/可获得较为丰厚的银子奖励和一定人物经验。
]]

--十五门派闯关
玩法介绍内容[13]=
[[
#P/[活动介绍]
#N/日常活动，每天下午5点开启，晚上7点结束。

#P/[挑战难度]
#N/怪物属性和挑战队伍的平均等级以及难度有关。

#P/[挑战奖励]
#N/战斗胜利后可获得较为丰厚的银子奖励和一定人物经验，并有一定几率获得二级药、金柳露、1-2级宝石、高级兽诀、低级兽诀、九转金丹、超级金柳露、五宝、星辉石。
]]

--镖王活动
玩法介绍内容[14]=
[[
#P/[活动介绍]
#N/日常活动，每天晚上的7点开启，晚上8点结束。

#P/[挑战难度]
#N/怪物属性和挑战队伍的平均等级以及难度有关。

#P/[挑战奖励]
#N/战斗胜利后可获得较为丰厚的银子奖励和一定人物经验，并有一定几率获得九转金丹、月华露、鬼谷子、高级兽诀、特赦令牌、修炼果、2-5级宝石。另外，难度越高，获得物品奖励的几率越大。
]]

--知了先锋
玩法介绍内容[15]=
[[
#P/[活动介绍]
#N/日常活动，每个整点的10分刷新。出现在多个地图，根据系统提示挑战。

#P/[挑战难度]
#N/怪物属性和挑战队伍的平均等级以及难度有关。

#P/[挑战奖励]
#N/战斗胜利后可获得较为丰厚的银子奖励和一定人物经验，并有一定几率获得彩果、金柳露、超级金柳露、低级兽诀、60-80级书铁、65-85炼妖石和上古锻造、60-80灵饰书铁、低级内丹、1-3级宝石。
]]

--小知了王
玩法介绍内容[16]=
[[
#P/[活动介绍]
#N/日常活动，每个整点的30分刷新。出现在多个地图，根据系统提示挑战。

#P/[挑战难度]
#N/怪物属性和挑战队伍的平均等级以及难度有关。

#P/[挑战奖励]
#N/战斗胜利后可获得较为丰厚的银子奖励和一定人物经验，并有一定几率获得超级金柳露、高级兽诀、80-100级书铁、一级未鉴定符石、修炼果、95-115炼妖石和上古锻造、100-120灵饰书铁、低级内丹、2-4级宝石。
]]

--知了王
玩法介绍内容[17]=
[[
#P/[活动介绍]
#N/日常活动，每个整点刷新。出现在多个地图，根据系统提示挑战。

#P/[挑战难度]
#N/怪物属性和挑战队伍的平均等级以及难度有关。

#P/[挑战奖励]
#N/战斗胜利后可获得较为丰厚的银子奖励和一定人物经验，并有一定几率获得3-5级宝石、8级变身卡、135-155上古锻造与炼妖石、高级兽诀、三级未激活符石、易经丹、高级内丹、120-140灵饰书铁、5级星辉石。
]]

--地煞星
玩法介绍内容[18]=
[[
#P/[活动介绍]
#N/日常活动，每个偶数整点的20分刷新。出现在多个地图，根据系统提示挑战。

#P/[挑战难度]
#N/怪物属性和挑战队伍的平均等级以及难度有关。
#N/初出茅庐地煞星：难度系数一颗星
#N/小有所成地煞星：难度系数二颗星
#N/伏虎斩妖地煞星：难度系数三颗星
#N/御风神行地煞星：难度系数四颗星
#N/履水吐焰地煞星：难度系数五颗星

#P/[挑战奖励]
#N/战斗胜利后可获得较为丰厚的储备金奖励和一定人物经验，并有一定几率获得高级兽诀、高级变身卡、九转金丹、低级内丹、修炼果、高级书铁、星辉石、未激活符石、宝石、灵饰书铁。另外，难度越高，获得物品奖励的几率越大。
]]

--英雄比武大会
玩法介绍内容[19]=
[[
#P/[活动介绍]
#N/周末活动，长安#R/比武大会主持人(120,173)#N/处报名；周六中午12点开启报名，周日下午3点结束报名并进入比武场，15分钟的准备时间，下午3点15正式开始，下午5点结束。

#P/[挑战难度]
#N/玩家之间分组进行比武，尽情的展现自己威武的一面吧。

#P/[等级分组]
#N/精锐组：50-69级
#N/勇武组：70-89级
#N/神威组：90-109级
#N/天科组：110-129级
#N/天启组：130-159级
#N/天元组：160级以上

#P/[比武称谓]
#N/江湖小虾							比武积分>=40		玩家等级>=50
#N/明日之星							比武积分>=80		玩家等级>=60
#N/武林高手							比武积分>=140		玩家等级>=70
#N/绝世奇才							比武积分>=200		玩家等级>=80
#N/威震三界							比武积分>=280		玩家等级>=90
#N/男：盖世英雄 女：绝代佳人		比武积分>=400		玩家等级>=100
#N/男：气吞山河 女：绝世独立		比武积分>=3000		玩家等级>=100
#N/男：战天斗地 女：姑射神人		比武积分>=5000		玩家等级>=155

#P/[挑战奖励]
#N/比武积分、经验、银子
#N/制造指南书、百炼精铁
#N/灵饰指南书、元灵晶石
#N/仙玉
]]

--青龙任务
玩法介绍内容[20]=
[[
#P/[活动介绍]
#N/帮派玩法，完成可提升帮派建筑升级的经验。

#P/[挑战难度]
#N/怪物属性和挑战队伍的平均等级以及难度有关。

#P/[挑战奖励]
#N/可获得帮派安定度、帮派建设升级经验、帮贡、经验、银子奖励。
]]

--厢房任务
玩法介绍内容[21]=
[[
#P/[活动介绍]
#N/帮派玩法，完成可获得帮派贡献。

#P/[挑战难度]
#N/怪物属性和挑战队伍的平均等级以及难度有关。

#P/[挑战奖励]
#N/可获得帮派安定度、帮贡、经验、银子奖励。
]]

--帮派跑商
玩法介绍内容[22]=
[[
#P/[活动介绍]
#N/帮派玩法，完成可获得帮派贡献、帮派资金。

#P/[跑商路线]
#N/长安==〉长寿村
#N/地府==〉北俱芦洲/长寿
#N/傲来国〈==〉长寿村
#N/北俱芦洲==〉地府

#P/[挑战奖励]
#N/可获得帮派安定度、帮贡、经验、银子奖励。
]]

--首席争霸
玩法介绍内容[23]=
[[
#P/[活动介绍]
#N/周末活动，长安国子监门口#R/首席争霸使者(306,79)#N/处报名；每周一中午12点到周六下午3点，为报名时间，周六下午3点开始入场，周六下午3点10分正式开始。

#P/[挑战难度]
#N/各门派玩家之间的角逐，争夺门派首席弟子之位，尽情的展现自己威武的一面吧。

#P/[挑战奖励]
#N/首席称谓
#N/经验、银子
#N/制造指南书、百炼精铁
#N/灵饰指南书、元灵晶石
#N/仙玉
]]

--生死劫
玩法介绍内容[24]=
[[
#P/[活动介绍]
#N/日常活动，找小雷音寺#R/丹青生(21,84)#N/处参与活动，每天可挑战三场战斗。

#P/[挑战难度]
#N/怪物属性和挑战队伍的平均等级以及难度有关。

#P/[挑战奖励]
#N/生死劫称谓
#N/经验、银子
#N/制造指南书、百炼精铁
#N/宝石、星辉石
#N/修炼果
]]

--世界BOSS
玩法介绍内容[25]=
[[
#P/[活动介绍]
#N/日常活动，每天的9点、12点、13点、16点、19点、22点刷新。出现在某个地图，根据系统提示挑战。

#P/[挑战难度]
#N/怪物属性和挑战队伍的平均等级以及难度有关。
#N/60级世界BOSS万年妖王可刷新在北俱芦洲、龙窟一层、凤窟一层
#N/100级世界BOSS万年鬼王可刷新在小西天、女娲神庙、无名鬼蜮
#N/150级世界BOSS罗刹王可刷新在小雷音寺、蓬莱仙岛、蟠桃园、比丘国

#P/[挑战奖励]
#N/战斗胜利后可获得较为丰厚的储备金奖励和一定人物经验，并有一定几率获得高级兽诀、特殊兽诀、高级变身卡、九转金丹、低级内丹、修炼果、高级书铁、星辉石、未激活符石、宝石、灵饰书铁。
]]

--天罡星辰
玩法介绍内容[26]=
[[
#P/[活动介绍]
#N/日常活动，每个偶数整点的40分刷新。出现在多个地图，根据系统提示挑战。

#P/[挑战难度]
#N/怪物属性和挑战队伍的平均等级以及难度有关。
#N/星君等级为120-170级

#P/[挑战奖励]
#N/战斗胜利后可获得较为丰厚的储备金奖励和一定人物经验，并有一定几率获得高级兽诀、特殊兽诀、高级变身卡、九转金丹、低级内丹、修炼果、高级书铁、星辉石、未激活符石、宝石、灵饰书铁。
]]