--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2020-10-09 19:59:30
-- 梦幻西游游戏资源破解 baidwwy@vip.qq.com(313738139) 老毕   和 C++PrimerPlus 717535046 这俩位大神破解所以资源
--======================================================================--
Q_游泳数据={
	{z=1092,x=208,y=19,f=1}
	,{z=1514,x=34,y=73,f=1}
	,{z=1514,x=101,y=103,f=0}
	,{z=1118,x=53,y=38,f=1}
	,{z=1119,x=52,y=22,f=1}
	,{z=1119,x=5,y=21,f=0}
	,{z=1532,x=58,y=37,f=1}
	,{z=1532,x=8,y=30,f=0}
	,{z=1121,x=8,y=7,f=0}
	,{z=1121,x=34,y=39,f=0}
	,{z=1120,x=8,y=32,f=0}
	,{z=1120,x=53,y=29,f=1}
	,{z=1118,x=26,y=39,f=0}
	,{z=1116,x=88,y=15,f=0}
	,{z=1116,x=206,y=61,f=1}
	,{z=1116,x=78,y=101,f=1}
	,{z=1506,x=113,y=6,f=0}
	,{z=1506,x=104,y=63,f=0}
	,{z=1092,x=132,y=142,f=0}
	,{z=1092,x=201,y=45,f=1}
}

镖王数据={
	{地图=1193,x=135,y=20,z=1}
	,{地图=1501,x=186,y=29,z=0}
	,{地图=1506,x=92,y=36,z=0}
	,{地图=1092,x=23,y=14,z=1}
	,{地图=1514,x=130,y=12,z=0}
	,{地图=1174,x=12,y=142,z=0}
}

function 切换场景(切换)
	local 当前地图
	local 角色坐标
	角色坐标 = {x=nil,y=nil}
	if 切换 ~= nil and 切换 ~= "" and 切换 ~= 0 then
		if 切换 == "建邺城进建邺杂货铺" then
			当前地图 = 1505
			角色坐标.x = 27
			角色坐标.y = 33
		elseif 切换 == "建邺城进建邺衙门" then
			当前地图 = 1537
			角色坐标.x = 14
			角色坐标.y = 29
		elseif 切换 == "建邺城进建邺合生记" then
			当前地图 = 1523
			角色坐标.x = 14
			角色坐标.y = 24
		elseif 切换 == "建邺城进建邺兵铁铺" then
			当前地图 = 1502
			角色坐标.x = 11
			角色坐标.y = 19
		elseif 切换 == "建邺城进建邺布庄" then
			当前地图 = 1503
			角色坐标.x = 14
			角色坐标.y = 21
		elseif 切换 == "建邺城进建邺回春堂" then
			当前地图 = 1504
			角色坐标.x = 22
			角色坐标.y = 25
		elseif 切换 == "建邺城进建邺钱庄" then
			当前地图 = 1524
			角色坐标.x = 24
			角色坐标.y = 28
		elseif 切换 == "建邺城进建邺周猎户家" then
			当前地图 = 1526
			角色坐标.x = 26
			角色坐标.y = 27
		elseif 切换 == "建邺城进东海湾新" then
			当前地图 = 1506
			角色坐标.x = 10
			角色坐标.y = 111
		elseif 切换 == "建邺城进东海湾旧" then
			当前地图 = 1506
			角色坐标.x = 11
			角色坐标.y = 37
		elseif 切换 == "建邺城进建邺普通民居" then
			当前地图 = 1525
			角色坐标.x = 15
			角色坐标.y = 18
		elseif 切换 == "建邺城进建邺李府" then
			当前地图 = 1527
			角色坐标.x = 29
			角色坐标.y = 27
		elseif 切换 == "建邺李府进建邺李善人家" then
			当前地图 = 1534
			角色坐标.x = 38
			角色坐标.y = 19
		elseif 切换 == "建邺杂货铺出建邺城" then
			当前地图 = 1501
			角色坐标.x = 118
			角色坐标.y = 18
		elseif 切换 == "建邺衙门出建邺城" then
			当前地图 = 1501
			角色坐标.x = 144
			角色坐标.y = 64
		elseif 切换 == "建邺合生记出建邺城" then
			当前地图 = 1501
			角色坐标.x = 125
			角色坐标.y = 106
		elseif 切换 == "建邺兵铁铺出建邺城" then
			当前地图 = 1501
			角色坐标.x = 74
			角色坐标.y = 134
		elseif 切换 == "建邺布庄出建邺城" then
			当前地图 = 1501
			角色坐标.x = 170
			角色坐标.y = 111
		elseif 切换 == "建邺回春堂出建邺城" then
			当前地图 = 1501
			角色坐标.x = 223
			角色坐标.y = 141
		elseif 切换 == "建邺钱庄出建邺城" then
			当前地图 = 1501
			角色坐标.x = 235
			角色坐标.y = 68
		elseif 切换 == "建邺周猎户家出建邺城" then
			当前地图 = 1501
			角色坐标.x = 247
			角色坐标.y = 126
		elseif 切换 == "建邺普通民居出建邺城" then
			当前地图 = 1501
			角色坐标.x = 255
			角色坐标.y = 58
		elseif 切换 == "建邺李府出建邺城" then
			当前地图 = 1501
			角色坐标.x = 8
			角色坐标.y = 64
		elseif 切换 == "建邺李善人家出建邺李府" then
			当前地图 = 1527
			角色坐标.x = 10
			角色坐标.y = 26
		-- 东海湾
		elseif 切换 == "东海湾进建邺城旧" then
			当前地图 = 1501
			角色坐标.x = 237
			角色坐标.y = 17
		elseif 切换 == "东海湾进建邺城新" then
			当前地图 = 1501
			角色坐标.x = 268
			角色坐标.y = 114
		-- 海底
		elseif 切换 == "东海岩洞出东海湾" then
			当前地图 = 1506
			角色坐标.x = 86
			角色坐标.y = 89
		elseif 切换 == "东海湾进东海海底" then
			当前地图 = 1507
			角色坐标.x = 11
			角色坐标.y = 19
		elseif 切换 == "东海海底进东海湾" then
			当前地图 = 1506
			角色坐标.x = 85
			角色坐标.y = 107
		elseif 切换 == "东海海底进沉船" then
			当前地图 = 1508
			角色坐标.x = 27
			角色坐标.y = 14
		elseif 切换 == "东海湾到桃源镇" then
			当前地图 = 1003
			角色坐标.x = 26
			角色坐标.y = 92
		elseif 切换 == "桃源镇到东海湾" then
			当前地图 = 1506
			角色坐标.x = 26
			角色坐标.y = 10
		-- 龙宫
		elseif 切换 == "龙宫进水晶宫" then
			当前地图 = 1117
			角色坐标.x = 20
			角色坐标.y = 33
		elseif 切换 == "龙宫进水晶宫1" then
			当前地图 = 1117
			角色坐标.x = 47
			角色坐标.y = 32
		elseif 切换 == "水晶宫出龙宫" then
			当前地图 = 1116
			角色坐标.x = 109
			角色坐标.y = 57
		elseif 切换 == "水晶宫出龙宫1" then
			当前地图 = 1116
			角色坐标.x = 137
			角色坐标.y = 56
		elseif 切换 == "龙宫进海底迷宫一层" then
			当前地图 = 1118
			角色坐标.x = 10
			角色坐标.y = 39
		-- 海底
		elseif 切换 == "海底迷宫一层进龙宫" then
			当前地图 = 1116
			角色坐标.x = 199
			角色坐标.y = 9
		elseif 切换 == "海底迷宫一层进海底迷宫二层" then
			当前地图 = 1119
			角色坐标.x = 11
			角色坐标.y = 40
		elseif 切换 == "海底迷宫一层进海底迷宫三层" then
			当前地图 = 1120
			角色坐标.x = 53
			角色坐标.y = 36
		elseif 切换 == "海底迷宫二层进海底迷宫五层" then
			当前地图 = 1532
			角色坐标.x = 22
			角色坐标.y = 40
		elseif 切换 == "海底迷宫二层进海底迷宫一层" then
			当前地图 = 1118
			角色坐标.x = 53
			角色坐标.y = 12
		elseif 切换 == "海底迷宫三层进海底迷宫一层" then
			当前地图 = 1118
			角色坐标.x = 12
			角色坐标.y = 14
		elseif 切换 == "海底迷宫三层进海底迷宫四层" then
			当前地图 = 1121
			角色坐标.x = 11
			角色坐标.y = 36
		elseif 切换 == "海底迷宫四层进海底迷宫三层" then
			当前地图 = 1120
			角色坐标.x = 52
			角色坐标.y = 10
		elseif 切换 == "海底迷宫四层进海底迷宫五层" then
			当前地图 = 1532
			角色坐标.x = 10
			角色坐标.y = 10
		elseif 切换 == "海底迷宫五层进海底迷宫二层" then
			当前地图 = 1119
			角色坐标.x = 47
			角色坐标.y = 11
		elseif 切换 == "海底迷宫五层进海底迷宫四层" then
			当前地图 = 1121
			角色坐标.x = 50
			角色坐标.y = 37
		-- 沉船
		elseif 切换 == "沉船出东海海底" then
			当前地图 = 1507
			角色坐标.x = 85
			角色坐标.y = 10
		elseif 切换 == "沉船进沉船内室" then
			当前地图 = 1509
			角色坐标.x = 14
			角色坐标.y = 18
		elseif 切换 == "沉船内室出沉船" then
			当前地图 = 1508
			角色坐标.x = 70
			角色坐标.y = 65
		-- 野外
		elseif 切换 == "江南野外传送建邺城" then
			当前地图 = 1501
			角色坐标.x = 9
			角色坐标.y = 141
		elseif 切换 == "江南野外传送长安" then
			当前地图 = 1001
			角色坐标.x = 508
			角色坐标.y = 275
		-- 长安
		elseif 切换 == "长安传送江南野外" then
			当前地图 = 1193
			角色坐标.x = 22
			角色坐标.y = 16
		elseif 切换 == "长安传送长安酒店一楼" then
			当前地图 = 1028
			角色坐标.x = 17
			角色坐标.y = 38
		elseif 切换 == "长安酒店一楼传送长安" then
			当前地图 = 1001
			角色坐标.x = 458
			角色坐标.y = 116
		elseif 切换 == "长安酒店一楼传送长安酒店二楼" then
			当前地图 = 1029
			角色坐标.x = 41
			角色坐标.y = 18
		elseif 切换 == "长安酒店二楼传送长安酒店一楼" then
			当前地图 = 1028
			角色坐标.x = 29
			角色坐标.y = 20
		elseif 切换 == "长安传送化生寺" then
			当前地图 = 1002
			角色坐标.x = 10
			角色坐标.y = 88
		elseif 切换 == "化生寺传送长安" then
			当前地图 = 1001
			角色坐标.x = 492
			角色坐标.y = 14
		elseif 切换 == "化生寺传送光华殿" then
			当前地图 = 1528
			角色坐标.x = 18
			角色坐标.y = 26
		elseif 切换 == "光华殿传送化生寺" then
			当前地图 = 1002
			角色坐标.x = 61
			角色坐标.y = 61
		elseif 切换 == "化生寺传送藏经阁" then
			当前地图 = 1043
			角色坐标.x = 11
			角色坐标.y = 16
		elseif 切换 == "藏经阁传送化生寺" then
			当前地图 = 1002
			角色坐标.x = 88
			角色坐标.y = 45
		elseif 切换 == "长安传送万胜兵器铺" then
			当前地图 = 1020
			角色坐标.x = 15
			角色坐标.y = 21
		elseif 切换 == "万胜兵器铺传送长安" then
			当前地图 = 1001
			角色坐标.x = 472
			角色坐标.y = 242
		elseif 切换 == "长安传送锦绣饰品店" then
			当前地图 = 1017
			角色坐标.x = 35
			角色坐标.y = 27
		elseif 切换 == "锦绣饰品店传送长安" then
			当前地图 = 1001
			角色坐标.x = 396
			角色坐标.y = 269
		elseif 切换 == "长安传送张记布庄" then
			当前地图 = 1022
			角色坐标.x = 31
			角色坐标.y = 23
		elseif 切换 == "张记布庄传送长安" then
			当前地图 = 1001
			角色坐标.x = 373
			角色坐标.y = 246
		elseif 切换 == "长安传送云来酒店" then
			当前地图 = 1030
			角色坐标.x = 12
			角色坐标.y = 22
		elseif 切换 == "云来酒店传送长安" then
			当前地图 = 1001
			角色坐标.x = 431
			角色坐标.y = 225
		elseif 切换 == "长安传送回春堂" then
			当前地图 = 1016
			角色坐标.x = 14
			角色坐标.y = 25
		elseif 切换 == "回春堂传送长安" then
			当前地图 = 1001
			角色坐标.x = 484
			角色坐标.y = 127
		elseif 切换 == "长安传送留香阁" then
			当前地图 = 1033
			角色坐标.x = 47
			角色坐标.y = 42
		elseif 切换 == "留香阁传送长安" then
			当前地图 = 1001
			角色坐标.x = 222
			角色坐标.y = 250
		elseif 切换 == "长安传送长风镖局" then
			当前地图 = 1024
			角色坐标.x = 22
			角色坐标.y = 28
		elseif 切换 == "长风镖局传送长安" then
			当前地图 = 1001
			角色坐标.x = 524
			角色坐标.y = 125
		elseif 切换 == "长安传送国子监" then
			当前地图 = 1026
			角色坐标.x = 49
			角色坐标.y = 36
		elseif 切换 == "国子监传送长安" then
			当前地图 = 1001
			角色坐标.x = 282
			角色坐标.y = 82
		elseif 切换 == "长安传送金銮殿" then
			当前地图 = 1044
			角色坐标.x = 97
			角色坐标.y = 76
		elseif 切换 == "金銮殿传送长安" then
			当前地图 = 1001
			角色坐标.x = 104
			角色坐标.y = 51
		elseif 切换 == "长安传送大雁塔一层路口1" then
			当前地图 = 1004
			角色坐标.x = 34
			角色坐标.y = 58
		elseif 切换 == "长安传送大雁塔一层路口2" then
			当前地图 = 1004
			角色坐标.x = 103
			角色坐标.y = 58
		elseif 切换 == "长安传送大唐官府" then
			当前地图 = 1198
			角色坐标.x = 153
			角色坐标.y = 94
		elseif 切换 == "大唐官府传送长安" then
			当前地图 = 1001
			角色坐标.x = 314
			角色坐标.y = 10
		elseif 切换 == "大唐官府传送程咬金府" then
			当前地图 = 1054
			角色坐标.x = 35
			角色坐标.y = 27.5
		elseif 切换 == "程咬金府传送大唐官府" then
			当前地图 = 1198
			角色坐标.x = 82
			角色坐标.y = 60
		elseif 切换 == "大雁塔一层路口1传送长安" then
			当前地图 = 1001
			角色坐标.x = 442
			角色坐标.y = 37
		elseif 切换 == "大雁塔一层路口2传送长安" then
			当前地图 = 1001
			角色坐标.x = 480
			角色坐标.y = 37
		elseif 切换 == "大雁塔一层传送大雁塔二层" then
			当前地图 = 1005
			角色坐标.x = 61
			角色坐标.y = 20
		elseif 切换 == "大雁塔二层传送大雁塔一层" then
			当前地图 = 1004
			角色坐标.x = 73
			角色坐标.y = 10
		elseif 切换 == "大雁塔二层传送大雁塔三层" then
			当前地图 = 1006
			角色坐标.x = 63
			角色坐标.y = 64
		elseif 切换 == "大雁塔三层传送大雁塔二层" then
			当前地图 = 1005
			角色坐标.x = 75
			角色坐标.y = 67
		elseif 切换 == "大雁塔三层传送大雁塔四层" then
			当前地图 = 1007
			角色坐标.x = 64
			角色坐标.y = 21
		elseif 切换 == "大雁塔四层传送大雁塔三层" then
			当前地图 = 1006
			角色坐标.x = 62
			角色坐标.y = 15
		elseif 切换 == "大雁塔四层传送大雁塔五层" then
			当前地图 = 1008
			角色坐标.x = 88
			角色坐标.y = 33
		elseif 切换 == "大雁塔五层传送大雁塔四层" then
			当前地图 = 1007
			角色坐标.x = 103
			角色坐标.y = 29
		elseif 切换 == "大雁塔五层传送大雁塔六层" then
			当前地图 = 1090
			角色坐标.x = 19
			角色坐标.y = 37
		elseif 切换 == "大雁塔六层传送大雁塔五层" then
			当前地图 = 1008
			角色坐标.x = 21
			角色坐标.y = 45
		elseif 切换 == "大雁塔六层传送大雁塔七层" then
			当前地图 = 1009
			角色坐标.x = 34
			角色坐标.y = 38
		elseif 切换 == "大雁塔七层传送大雁塔六层" then
			当前地图 = 1090
			角色坐标.x = 67
			角色坐标.y = 43
		elseif 切换 == "长安传送大唐国境" then
			当前地图 = 1110
			角色坐标.x = 332
			角色坐标.y = 191
		elseif 切换 == "大唐国境传送长安" then
			当前地图 = 1001
			角色坐标.x = 10
			角色坐标.y = 275
		elseif 切换 == "长安传送广源钱庄" then
			当前地图 = 1013
			角色坐标.x = 21
			角色坐标.y = 29
		elseif 切换 == "广源钱庄传送长安" then
			当前地图 = 1001
			角色坐标.x = 510
			角色坐标.y = 87
		elseif 切换 == "大唐国境传送大唐境外" then
			当前地图 = 1173
			角色坐标.x = 626
			角色坐标.y = 23
		elseif 切换 == "傲来国传送女儿村" then
			当前地图 = 1142
			角色坐标.x = 118
			角色坐标.y = 131
		elseif 切换 == "傲来国传送傲来武器店" then
			当前地图 = 1101
			角色坐标.x = 13
			角色坐标.y = 21
      	elseif 切换 == "傲来国传送傲来国药店" then
			当前地图 = 1104
			角色坐标.x = 38
			角色坐标.y = 32
        elseif 切换 == "傲来国传送傲来国杂货店" then
			当前地图 = 1105
			角色坐标.x = 29
			角色坐标.y = 25
        elseif 切换 == "傲来国传送傲来国客栈" then
			当前地图 = 1093
			角色坐标.x = 39
			角色坐标.y = 32
     	elseif 切换 == "傲来国客栈传送傲来国" then
			当前地图 = 1092
			角色坐标.x = 184
			角色坐标.y = 123

      	elseif 切换 == "傲来国药店传送傲来国" then
			当前地图 = 1092
			角色坐标.x = 60
			角色坐标.y = 113
      	elseif 切换 == "傲来国杂货店传送傲来国" then
			当前地图 = 1092
			角色坐标.x = 99
			角色坐标.y = 135

		elseif 切换 == "傲来国传送花果山" then
			当前地图 = 1514
			角色坐标.x = 12
			角色坐标.y = 108
		elseif 切换 == "傲来国传送傲来国服饰店" then
			当前地图 = 1095
			角色坐标.x = 35
			角色坐标.y = 28
		elseif 切换 == "傲来国服饰店传送傲来国" then
			当前地图 = 1092
			角色坐标.x = 33.2
			角色坐标.y = 82.5
		-- 花果山
		elseif 切换 == "花果山传送傲来国" then
			当前地图 = 1092
			角色坐标.x = 209
			角色坐标.y = 14
		-- 北俱芦洲
		elseif 切换 == "花果山传送北俱芦洲" then
			当前地图 = 1174
			角色坐标.x = 191
			角色坐标.y = 63
		elseif 切换 == "花果山传送海底迷宫1层" then
			当前地图 = 1118
			角色坐标.x = 9
			角色坐标.y = 41
		elseif 切换 == "北俱芦洲传送花果山" then
			当前地图 = 1514
			角色坐标.x = 26
			角色坐标.y = 19
		elseif 切换 == "花果山传送水帘洞" then
			当前地图 = 1103
			角色坐标.x = 11
			角色坐标.y = 48
		elseif 切换 == "水帘洞传送花果山" then
			当前地图 = 1514
			角色坐标.x = 65
			角色坐标.y = 55
		-- 北具庐州
		elseif 切换 == "北俱芦洲传送龙窟" then
			当前地图 = 1177
			角色坐标.x = 149
			角色坐标.y = 80
		elseif 切换 == "北俱芦洲传送凤巢" then
			当前地图 = 1186
			角色坐标.x = 70
			角色坐标.y = 10
		-- 龙窟
		elseif 切换 == "龙窟一层传送北俱芦洲" then
			当前地图 = 1174
			角色坐标.x = 16
			角色坐标.y = 95
		elseif 切换 == "龙窟一层传送龙窟二层" then
			当前地图 = 1178
			角色坐标.x = 126
			角色坐标.y = 49
		elseif 切换 == "龙窟二层传送龙窟一层" then
			当前地图 = 1177
			角色坐标.x = 21
			角色坐标.y = 30
		elseif 切换 == "龙窟二层传送龙窟三层" then
			当前地图 = 1179
			角色坐标.x = 11
			角色坐标.y = 12
		elseif 切换 == "龙窟三层传送龙窟二层" then
			当前地图 = 1178
			角色坐标.x = 29
			角色坐标.y = 63
		elseif 切换 == "龙窟三层传送龙窟四层" then
			当前地图 = 1180
			角色坐标.x = 14
			角色坐标.y = 64
		elseif 切换 == "龙窟四层传送龙窟三层" then
			当前地图 = 1179
			角色坐标.x = 127
			角色坐标.y = 54
		elseif 切换 == "龙窟四层传送龙窟五层" then
			当前地图 = 1181
			角色坐标.x = 121
			角色坐标.y = 12
		elseif 切换 == "龙窟五层传送龙窟四层" then
			当前地图 = 1180
			角色坐标.x = 128
			角色坐标.y = 48
		elseif 切换 == "龙窟五层传送龙窟六层" then
			当前地图 = 1182
			角色坐标.x = 88
			角色坐标.y = 66
		elseif 切换 == "龙窟六层传送龙窟五层" then
			当前地图 = 1181
			角色坐标.x = 44
			角色坐标.y = 60
		elseif 切换 == "龙窟六层传送龙窟七层" then
			当前地图 = 1183
			角色坐标.x = 12
			角色坐标.y = 15
		elseif 切换 == "龙窟七层传送龙窟六层" then
			当前地图 = 1182
			角色坐标.x = 113
			角色坐标.y = 18
		-- 凤巢
		elseif 切换 == "凤巢一层传送北俱芦洲" then
			当前地图 = 1174
			角色坐标.x = 84
			角色坐标.y = 26
		elseif 切换 == "凤巢一层传送凤巢二层" then
			当前地图 = 1187
			角色坐标.x = 36
			角色坐标.y = 12
		elseif 切换 == "凤巢二层传送凤巢一层" then
			当前地图 = 1186
			角色坐标.x = 49
			角色坐标.y = 59
		elseif 切换 == "凤巢二层传送凤巢三层" then
			当前地图 = 1188
			角色坐标.x = 18
			角色坐标.y = 17
		elseif 切换 == "凤巢三层传送凤巢二层" then
			当前地图 = 1187
			角色坐标.x = 115
			角色坐标.y = 21
		elseif 切换 == "凤巢三层传送凤巢四层" then
			当前地图 = 1189
			角色坐标.x = 23
			角色坐标.y = 20
		elseif 切换 == "凤巢四层传送凤巢三层" then
			当前地图 = 1188
			角色坐标.x = 114
			角色坐标.y = 61
		elseif 切换 == "凤巢四层传送凤巢五层" then
			当前地图 = 1190
			角色坐标.x = 76
			角色坐标.y = 65
		elseif 切换 == "凤巢五层传送凤巢四层" then
			当前地图 = 1189
			角色坐标.x = 70
			角色坐标.y = 10
		elseif 切换 == "凤巢五层传送凤巢六层" then
			当前地图 = 1191
			角色坐标.x = 6
			角色坐标.y = 64
		elseif 切换 == "凤巢六层传送凤巢五层" then
			当前地图 = 1190
			角色坐标.x = 111
			角色坐标.y = 8
		elseif 切换 == "凤巢六层传送凤巢七层" then
			当前地图 = 1192
			角色坐标.x = 12
			角色坐标.y = 31
		elseif 切换 == "凤巢七层传送凤巢六层" then
			当前地图 = 1191
			角色坐标.x = 120
			角色坐标.y = 31
		--
		elseif 切换 == "傲来武器店传送傲来国" then
			当前地图 = 1092
			角色坐标.x = 124
			角色坐标.y = 113
		-- 女儿村
		elseif 切换 == "女儿村传送傲来国" then
			当前地图 = 1092
			角色坐标.x = 13
			角色坐标.y = 18
		elseif 切换 == "女儿村传送女儿村村长家" then
			当前地图 = 1143
			角色坐标.x = 31
			角色坐标.y = 25
		elseif 切换 == "女儿村村长家传送女儿村" then
			当前地图 = 1142
			角色坐标.x = 18
			角色坐标.y = 22
		-- 国境
		elseif 切换 == "大唐国境传送阴曹地府" then
			当前地图 = 1122
			角色坐标.x = 137
			角色坐标.y = 113
		-- 国境
		elseif 切换 == "凌波城传送大唐国境" then
			当前地图 = 1110
			角色坐标.x = 181
			角色坐标.y = 77
		elseif 切换 == "大唐国境传送金山寺" then
			当前地图 = 1153
			角色坐标.x = 40
			角色坐标.y = 28
		elseif 切换 == "金山寺传送大唐国境" then
			当前地图 = 1110
			角色坐标.x = 123
			角色坐标.y = 150
		elseif 切换 == "大唐国境传送江州民居" then
			当前地图 = 1167
			角色坐标.x = 26
			角色坐标.y = 20
		elseif 切换 == "江州民居传送大唐国境" then
			当前地图 = 1110
			角色坐标.x = 232
			角色坐标.y = 53
		elseif 切换 == "大唐国境传送江州衙门" then
			当前地图 = 1168
			角色坐标.x = 17
			角色坐标.y = 25
		elseif 切换 == "江州衙门传送大唐国境" then
			当前地图 = 1110
			角色坐标.x = 312
			角色坐标.y = 38
		-- 普陀山
		elseif 切换 == "普陀山传送大唐国境" then
			当前地图 = 1110
			角色坐标.x = 234
			角色坐标.y = 277
		elseif 切换 == "普陀山传送潮音洞" then
			当前地图 = 1141
			角色坐标.x = 46
			角色坐标.y = 36
		elseif 切换 == "潮音洞传送普陀山" then
			当前地图 = 1140
			角色坐标.x = 11
			角色坐标.y = 13
		-- 地府
		elseif 切换 == "阴曹地府传送大唐国境" then
			当前地图 = 1110
			角色坐标.x = 43
			角色坐标.y = 13
		elseif 切换 == "阴曹地府传送森罗殿" then
			当前地图 = 1123
			角色坐标.x = 40
			角色坐标.y = 32
		elseif 切换 == "森罗殿传送阴曹地府" then
			当前地图 = 1122
			角色坐标.x = 34
			角色坐标.y = 57
		elseif 切换 == "森罗殿传送地藏王府" then
			当前地图 = 1124
			角色坐标.x = 35
			角色坐标.y = 27
		elseif 切换 == "地藏王府传送森罗殿" then
			当前地图 = 1123
			角色坐标.x = 29
			角色坐标.y = 14
       	elseif 切换 == "阴曹地府传送轮回司" then
			当前地图 = 1125
			角色坐标.x = 29
			角色坐标.y = 28
		 elseif 切换 == "轮回司传送阴曹地府" then
			当前地图 = 1122
			角色坐标.x = 104
			角色坐标.y = 71

		-- 迷宫
		elseif 切换 == "阴曹地府传送地狱迷宫一层" then
			当前地图 = 1127
			角色坐标.x = 6
			角色坐标.y = 21
		elseif 切换 == "地狱迷宫一层传送阴曹地府" then
			当前地图 = 1122
			角色坐标.x = 29
			角色坐标.y = 14
		elseif 切换 == "地狱迷宫一层传送地狱迷宫二层" then
			当前地图 = 1128
			角色坐标.x = 99
			角色坐标.y = 16
		elseif 切换 == "地狱迷宫二层传送地狱迷宫一层" then
			当前地图 = 1127
			角色坐标.x = 17
			角色坐标.y = 72
		elseif 切换 == "地狱迷宫二层传送地狱迷宫三层" then
			当前地图 = 1129
			角色坐标.x = 12
			角色坐标.y = 69
		elseif 切换 == "地狱迷宫二层传送地狱迷宫三层2" then
			当前地图 = 1129
			角色坐标.x = 14
			角色坐标.y = 24
		elseif 切换 == "地狱迷宫三层传送地狱迷宫二层1" then
			当前地图 = 1128
			角色坐标.x = 105
			角色坐标.y = 53
		elseif 切换 == "地狱迷宫三层传送地狱迷宫二层2" then
			当前地图 = 1128
			角色坐标.x = 102
			角色坐标.y = 79
		elseif 切换 == "地狱迷宫三层传送地狱迷宫四层" then
			当前地图 = 1130
			角色坐标.x = 15
			角色坐标.y = 11
		elseif 切换 == "地狱迷宫四层传送地狱迷宫三层" then
			当前地图 = 1129
			角色坐标.x = 106
			角色坐标.y = 83
		-- elseif 切换 == "地狱迷宫四层传送无名鬼城" then
		-- 	当前地图 = 1202
		-- 	角色坐标.x = 16
		-- 	角色坐标.y = 113
		elseif 切换 == "无名鬼城传送地狱迷宫四层" then
			当前地图 = 1130
			角色坐标.x = 91
			角色坐标.y = 31
		-- 长寿
		elseif 切换 == "长寿村传送长寿郊外" then
			当前地图 = 1091
			角色坐标.x = 151
			角色坐标.y = 18
		elseif 切换 == "长寿村传送方寸山" then
			当前地图 = 1135
			角色坐标.x = 10
			角色坐标.y = 134
		elseif 切换 == "长寿村传送长寿村武器店" then
			当前地图 = 1085
			角色坐标.x = 24
			角色坐标.y = 21
		elseif 切换 == "长寿村传送长寿村服装店" then
			当前地图 = 1083
			角色坐标.x = 12
			角色坐标.y = 19
		elseif 切换 == "长寿村服装店传送长寿村" then
			当前地图 = 1070
			角色坐标.x = 87
			角色坐标.y = 139
		elseif 切换 == "长寿村武器店传送长寿村" then
			当前地图 = 1070
			角色坐标.x = 69.5
			角色坐标.y = 106
		elseif 切换 == "长寿村传送长寿钱庄" then
			当前地图 = 1081
			角色坐标.x = 22
			角色坐标.y = 18
		elseif 切换 == "长寿钱庄传送长寿村" then
			当前地图 = 1070
			角色坐标.x = 146
			角色坐标.y = 118
		-- 郊外
		elseif 切换 == "长寿郊外传送长寿村" then
			当前地图 = 1070
			角色坐标.x = 139
			角色坐标.y = 199
		-- 方寸山
		elseif 切换 == "方寸山传送长寿村" then
			当前地图 = 1070
			角色坐标.x = 106
			角色坐标.y = 12
		elseif 切换 == "方寸山传送灵台宫" then
			当前地图 = 1137
			角色坐标.x = 21
			角色坐标.y = 41
		elseif 切换 == "灵台宫传送方寸山" then
			当前地图 = 1135
			角色坐标.x = 124
			角色坐标.y = 35
		-- 天宫
		elseif 切换 == "天宫传送凌霄宝殿" then
			当前地图 = 1112
			角色坐标.x = 75
			角色坐标.y = 57
		elseif 切换 == "天宫传送蟠桃园" then
			当前地图 = 1231
			角色坐标.x = 143
			角色坐标.y = 89
		elseif 切换 == "天宫传送月宫" then
			当前地图 = 1114
			角色坐标.x = 116
			角色坐标.y = 85
		elseif 切换 == "天宫传送兜率宫" then
			当前地图 = 1113
			角色坐标.x = 40
			角色坐标.y = 26
		elseif 切换 == "凌霄宝殿传送天宫" then
			当前地图 = 1111
			角色坐标.x = 148
			角色坐标.y = 108
		elseif 切换 == "月宫传送天宫" then
			当前地图 = 1111
			角色坐标.x = 50
			角色坐标.y = 9
		elseif 切换 == "蟠桃园传送天宫" then
			当前地图 = 1111
			角色坐标.x = 12
			角色坐标.y = 97
		elseif 切换 == "兜率宫传送天宫" then
			当前地图 = 1111
			角色坐标.x = 26
			角色坐标.y = 147
		-- 境外
		elseif 切换 == "大唐境外传送大唐国境" then
			当前地图 = 1110
			角色坐标.x = 14
			角色坐标.y = 263
		elseif 切换 == "大唐境外传送魔王寨" then
			当前地图 = 1512
			角色坐标.x = 12
			角色坐标.y = 79
		elseif 切换 == "大唐境外传送五庄观" then
			当前地图 = 1146
			角色坐标.x = 10
			角色坐标.y = 64
		elseif 切换 == "大唐境外传送狮驼岭" then
			当前地图 = 1131
			角色坐标.x = 112
			角色坐标.y = 14
		elseif 切换 == "大唐境外传送朱紫国" then
			当前地图 = 1208
			角色坐标.x = 10
			角色坐标.y = 114
		elseif 切换 == "大唐境外传送小西天" then
			当前地图 = 1203
			角色坐标.x = 102
			角色坐标.y = 233
		elseif 切换 == "大唐境外传送墨家村" then
			当前地图 = 1218
			角色坐标.x = 77
			角色坐标.y = 165
		-- 魔王
		elseif 切换 == "魔王寨传送大唐境外" then
			当前地图 = 1173
			角色坐标.x = 60
			角色坐标.y = 12
		elseif 切换 == "魔王寨传送魔王居" then
			当前地图 = 1145
			角色坐标.x = 19
			角色坐标.y = 27
		elseif 切换 == "魔王居传送魔王寨" then
			当前地图 = 1512
			角色坐标.x = 88
			角色坐标.y = 21
		-- 五庄
		elseif 切换 == "五庄观传送大唐境外" then
			当前地图 = 1173
			角色坐标.x = 628
			角色坐标.y = 45
		elseif 切换 == "五庄观传送乾坤殿" then
			当前地图 = 1147
			角色坐标.x = 20
			角色坐标.y = 24
		elseif 切换 == "乾坤殿传送五庄观" then
			当前地图 = 1146
			角色坐标.x = 54
			角色坐标.y = 40
		-- 狮驼
		elseif 切换 == "狮驼岭传送大唐境外" then
			当前地图 = 1173
			角色坐标.x = 13
			角色坐标.y = 68
		elseif 切换 == "狮驼岭传送狮王洞" then
			当前地图 = 1134
			角色坐标.x = 20
			角色坐标.y = 25
		elseif 切换 == "狮驼岭传送大象洞" then
			当前地图 = 1132
			角色坐标.x = 20
			角色坐标.y = 24
		elseif 切换 == "大象洞传送狮驼岭" then
			当前地图 = 1131
			角色坐标.x = 23
			角色坐标.y = 18
		elseif 切换 == "狮驼岭传送老雕洞" then
			当前地图 = 1133
			角色坐标.x = 9
			角色坐标.y = 24
		elseif 切换 == "老雕洞传送狮驼岭" then
			当前地图 = 1131
			角色坐标.x = 17
			角色坐标.y = 63
		elseif 切换 == "狮王洞传送狮驼岭" then
			当前地图 = 1131
			角色坐标.x = 112
			角色坐标.y = 77
		-- 盘丝
		elseif 切换 == "大唐境外传送盘丝岭" then
			当前地图 = 1513
			角色坐标.x = 187
			角色坐标.y = 140
		elseif 切换 == "盘丝岭传送大唐境外" then
			当前地图 = 1173
			角色坐标.x = 533
			角色坐标.y = 11
		elseif 切换 == "盘丝岭传送盘丝洞" then
			当前地图 = 1144
			角色坐标.x = 15
			角色坐标.y = 52
		elseif 切换 == "盘丝洞传送盘丝岭" then
			当前地图 = 1513
			角色坐标.x = 187
			角色坐标.y = 24
		elseif 切换 == "战神山传送长安" then
			当前地图 = 1001
			角色坐标.x = 340
			角色坐标.y = 215
		elseif 切换 == "战神山传送神木林" then
			当前地图 = 1138
			角色坐标.x = 61
			角色坐标.y = 153
		elseif 切换 == "神木林传送神木屋" then
			当前地图 = 1154
			角色坐标.x = 45.5
			角色坐标.y = 38
		elseif 切换 == "神木屋传送神木林" then
			当前地图 = 1138
			角色坐标.x = 49
			角色坐标.y = 96
		elseif 切换 == "神木林传送战神山" then
			当前地图 = 1205
			角色坐标.x = 16
			角色坐标.y = 99
		-- 碗子山
		elseif 切换 == "碗子山传送大唐境外" then
			当前地图 = 1173
			角色坐标.x = 21
			角色坐标.y = 97
		elseif 切换 == "碗子山传送宝象国" then
			当前地图 = 1226
			角色坐标.x = 148
			角色坐标.y = 110
		elseif 切换 == "碗子山传送波月洞" then
			当前地图 = 1229
			角色坐标.x = 13
			角色坐标.y = 16
		-- 波月洞
		elseif 切换 == "波月洞传送碗子山" then
			当前地图 = 1228
			角色坐标.x = 64
			角色坐标.y = 19
		-- 无底洞
		elseif 切换 == "无底洞传送碗子山" then
			当前地图 = 1228
			角色坐标.x = 28
			角色坐标.y = 180
		elseif 切换 == "无底洞传送琉璃殿" then
			当前地图 = 1156
			角色坐标.x = 9
			角色坐标.y = 48
		elseif 切换 == "琉璃殿传送无底洞" then
			当前地图 = 1139
			角色坐标.x = 59
			角色坐标.y = 122
		-- 宝象国
		elseif 切换 == "宝象国传送丝绸之路" then
			当前地图 = 1235
			角色坐标.x = 393
			角色坐标.y = 10
		elseif 切换 == "宝象国传送宝象国皇宫" then
			当前地图 = 1227
			角色坐标.x = 69
			角色坐标.y = 49
		elseif 切换 == "宝象国皇宫传送宝象国" then
			当前地图 = 1226
			角色坐标.x = 8
			角色坐标.y = 15
		elseif 切换 == "宝象国传送解阳山" then
			当前地图 = 1042
			角色坐标.x = 104
			角色坐标.y = 91
		elseif 切换 == "宝象国传送麒麟山" then
			当前地图 = 1210
			角色坐标.x = 54
			角色坐标.y = 139
		elseif 切换 == "宝象国传送碗子山" then
			当前地图 = 1228
			角色坐标.x = 9
			角色坐标.y = 184
		-- 解阳山
		elseif 切换 == "解阳山传送宝象国" then
			当前地图 = 1226
			角色坐标.x = 122
			角色坐标.y = 8
		elseif 切换 == "解阳山传送子母河底" then
			当前地图 = 1041
			角色坐标.x = 73
			角色坐标.y = 12
		-- 子母河
		elseif 切换 == "子母河底传送解阳山" then
			当前地图 = 1042
			角色坐标.x = 13
			角色坐标.y = 90
		elseif 切换 == "子母河底传送西梁女国" then
			当前地图 = 1040
			角色坐标.x = 153
			角色坐标.y = 109
		-- 西梁女国
		elseif 切换 == "西梁女国传送子母河底" then
			当前地图 = 1041
			角色坐标.x = 19
			角色坐标.y = 85
		-- 麒麟山
		elseif 切换 == "麒麟山传送太岁府" then
			当前地图 = 1211
			角色坐标.x = 52
			角色坐标.y = 90
		elseif 切换 == "麒麟山传送朱紫国" then
			当前地图 = 1208
			角色坐标.x = 7
			角色坐标.y = 13
		elseif 切换 == "太岁府传送麒麟山" then
			当前地图 = 1210
			角色坐标.x = 23
			角色坐标.y = 24
		-- 丝绸之路
		elseif 切换 == "丝绸之路传送须弥东界" then
			当前地图 = 1242
			角色坐标.x = 84
			角色坐标.y = 193
		elseif 切换 == "丝绸之路传送比丘国" then
			当前地图 = 1232
			角色坐标.x = 10
			角色坐标.y = 26
		elseif 切换 == "丝绸之路传送凌云渡" then
			当前地图 = 1920
			角色坐标.x = 111
			角色坐标.y = 214
		elseif 切换 == "丝绸之路传送朱紫国" then
			当前地图 = 1208
			角色坐标.x = 152
			角色坐标.y = 106
		-- 比丘国
		elseif 切换 == "比丘国传送丝绸之路" then
			当前地图 = 1235
			角色坐标.x = 348
			角色坐标.y = 88
		elseif 切换 == "比丘国传送柳林坡" then
			当前地图 = 1233
			角色坐标.x = 17
			角色坐标.y = 101
		-- 柳林坡
		elseif 切换 == "柳林坡传送比丘国" then
			当前地图 = 1232
			角色坐标.x = 38
			角色坐标.y = 10
		-- 朱紫国
		elseif 切换 == "朱紫国传送大唐境外" then
			当前地图 = 1173
			角色坐标.x = 9
			角色坐标.y = 60
		elseif 切换 == "朱紫国传送麒麟山" then
			当前地图 = 1210
			角色坐标.x = 176
			角色坐标.y = 139
		elseif 切换 == "朱紫国传送丝绸之路" then
			当前地图 = 1235
			角色坐标.x = 305
			角色坐标.y = 7
     	elseif 切换 == "朱紫国传送朱紫国皇宫" then
			当前地图 = 1209
			角色坐标.x = 29
			角色坐标.y = 56
		elseif 切换 == "朱紫国皇宫传送朱紫国" then
			当前地图 = 1208
			角色坐标.x = 143
			角色坐标.y = 24

		-- 墨家村
		elseif 切换 == "墨家村传送大唐境外" then
			当前地图 = 1173
			角色坐标.x = 229
			角色坐标.y = 17
		elseif 切换 == "墨家村传送墨家禁地" then
			当前地图 = 1221
			角色坐标.x = 21
			角色坐标.y = 10
		elseif 切换 == "墨家禁地传送墨家村" then
			当前地图 = 1218
			角色坐标.x = 48
			角色坐标.y = 11
		-- 小西天
		elseif 切换 == "小西天传送大唐境外" then
			当前地图 = 1173
			角色坐标.x = 16
			角色坐标.y = 25
		elseif 切换 == "小西天传送小雷音寺" then
			当前地图 = 1204
			角色坐标.x = 169
			角色坐标.y = 131
		elseif 切换 == "小雷音寺传送小西天" then
			当前地图 = 1203
			角色坐标.x = 26
			角色坐标.y = 23
		-- 女娲神迹
		elseif 切换 == "女娲神迹传送北俱芦洲" then
			当前地图 = 1174
			角色坐标.x = 20
			角色坐标.y = 21
		end
	end
	if 角色坐标.x ==nil and 角色坐标.y ==nil then
	    return 单机版切换场景(切换)
	end
	return {[1]=当前地图,[2]=角色坐标}
end

function 单机版切换场景(切换)
	local 当前地图
	local 角色坐标
	角色坐标 = {x=nil,y=nil}
	if 切换 ~= nil and 切换 ~= "" and 切换 ~= 0 then
		if 切换 == "建邺城进建邺杂货铺" then
			当前地图 = 1505
			角色坐标.x = 27
			角色坐标.y = 33
		elseif 切换 == "建邺城进建邺衙门" then
			当前地图 = 1537
			角色坐标.x = 14
			角色坐标.y = 29
		elseif 切换 == "建邺城进建邺合生记" then
			当前地图 = 1523
			角色坐标.x = 14
			角色坐标.y = 24
		elseif 切换 == "建邺城进建邺兵铁铺" then
			当前地图 = 1502
			角色坐标.x = 11
			角色坐标.y = 19
		elseif 切换 == "建邺城进建邺布庄" then
			当前地图 = 1503
			角色坐标.x = 14
			角色坐标.y = 21
		elseif 切换 == "建邺城进建邺回春堂" then
			当前地图 = 1504
			角色坐标.x = 22
			角色坐标.y = 25
		elseif 切换 == "建邺城进建邺钱庄" then
			当前地图 = 1524
			角色坐标.x = 24
			角色坐标.y = 27
		elseif 切换 == "建邺城进建邺周猎户家" then
			当前地图 = 1526
			角色坐标.x = 26
			角色坐标.y = 27
		elseif 切换 == "建邺城进东海湾新" then
			当前地图 = 1506
			角色坐标.x = 10
			角色坐标.y = 111
		elseif 切换 == "建邺城进东海湾旧" then
			当前地图 = 1506
			角色坐标.x = 11
			角色坐标.y = 37
		elseif 切换 == "建邺城进建邺普通民居" then
			当前地图 = 1525
			角色坐标.x = 15
			角色坐标.y = 18
		elseif 切换 == "建邺城进建邺李府" then
			当前地图 = 1527
			角色坐标.x = 29
			角色坐标.y = 27
		elseif 切换 == "建邺李府进建邺李善人家" then
			当前地图 = 1534
			角色坐标.x = 38
			角色坐标.y = 19
		elseif 切换 == "建邺杂货铺出建邺城" then
			当前地图 = 1501
			角色坐标.x = 118
			角色坐标.y = 18
		elseif 切换 == "建邺衙门出建邺城" then
			当前地图 = 1501
			角色坐标.x = 144
			角色坐标.y = 64
		elseif 切换 == "建邺合生记出建邺城" then
			当前地图 = 1501
			角色坐标.x = 125
			角色坐标.y = 106
		elseif 切换 == "建邺兵铁铺出建邺城" then
			当前地图 = 1501
			角色坐标.x = 74
			角色坐标.y = 134
		elseif 切换 == "建邺布庄出建邺城" then
			当前地图 = 1501
			角色坐标.x = 170
			角色坐标.y = 111
		elseif 切换 == "建邺回春堂出建邺城" then
			当前地图 = 1501
			角色坐标.x = 223
			角色坐标.y = 141
		elseif 切换 == "建邺钱庄出建邺城" then
			当前地图 = 1501
			角色坐标.x = 235
			角色坐标.y = 68
		elseif 切换 == "建邺周猎户家出建邺城" then
			当前地图 = 1501
			角色坐标.x = 247
			角色坐标.y = 126
		elseif 切换 == "建邺普通民居出建邺城" then
			当前地图 = 1501
			角色坐标.x = 255
			角色坐标.y = 58
		elseif 切换 == "建邺李府出建邺城" then
			当前地图 = 1501
			角色坐标.x = 8
			角色坐标.y = 64
		elseif 切换 == "建邺李善人家出建邺李府" then
			当前地图 = 1527
			角色坐标.x = 10
			角色坐标.y = 26
		-- 东海湾
		elseif 切换 == "东海湾进建邺城旧" then
			当前地图 = 1501
			角色坐标.x = 237
			角色坐标.y = 17
		elseif 切换 == "东海湾进建邺城新" then
			当前地图 = 1501
			角色坐标.x = 268
			角色坐标.y = 114
		-- 海底
		elseif 切换 == "东海岩洞出东海湾" then
			当前地图 = 1506
			角色坐标.x = 86
			角色坐标.y = 89
		elseif 切换 == "东海湾进东海海底" then
			当前地图 = 1507
			角色坐标.x = 11
			角色坐标.y = 19
		elseif 切换 == "东海海底进东海湾" then
			当前地图 = 1506
			角色坐标.x = 85
			角色坐标.y = 107
		elseif 切换 == "东海海底进沉船" then
			当前地图 = 1508
			角色坐标.x = 27
			角色坐标.y = 14
		-- 龙宫
		elseif 切换 == "龙宫进水晶宫" then--########################################################?自己修改?##########################################
			当前地图 = 1117
			角色坐标.x = 24
			角色坐标.y = 32
		elseif 切换 == "龙宫进水晶宫1" then
			当前地图 = 1117
			角色坐标.x = 47
			角色坐标.y = 32
		elseif 切换 == "水晶宫出龙宫" then
			当前地图 = 1116
			角色坐标.x = 109
			角色坐标.y = 57
		elseif 切换 == "水晶宫出龙宫1" then
			当前地图 = 1116
			角色坐标.x = 137
			角色坐标.y = 56
		elseif 切换 == "龙宫进海底迷宫一层" then
			当前地图 = 1118
			角色坐标.x = 10
			角色坐标.y = 39
		-- 海底
		elseif 切换 == "海底迷宫一层进龙宫" then
			当前地图 = 1116
			角色坐标.x = 199
			角色坐标.y = 9
		elseif 切换 == "海底迷宫一层进海底迷宫二层" then
			当前地图 = 1119
			角色坐标.x = 11
			角色坐标.y = 40
		elseif 切换 == "海底迷宫一层进海底迷宫三层" then
			当前地图 = 1120
			角色坐标.x = 53
			角色坐标.y = 36
		elseif 切换 == "海底迷宫二层进海底迷宫五层" then
			当前地图 = 1532
			角色坐标.x = 22
			角色坐标.y = 40
		elseif 切换 == "海底迷宫二层进海底迷宫一层" then
			当前地图 = 1118
			角色坐标.x = 53
			角色坐标.y = 12
		elseif 切换 == "海底迷宫三层进海底迷宫一层" then
			当前地图 = 1118
			角色坐标.x = 12
			角色坐标.y = 14
		elseif 切换 == "海底迷宫三层进海底迷宫四层" then
			当前地图 = 1121
			角色坐标.x = 11
			角色坐标.y = 36
		elseif 切换 == "海底迷宫四层进海底迷宫三层" then
			当前地图 = 1120
			角色坐标.x = 52
			角色坐标.y = 10
		elseif 切换 == "海底迷宫四层进海底迷宫五层" then
			当前地图 = 1532
			角色坐标.x = 10
			角色坐标.y = 10
		elseif 切换 == "海底迷宫五层进海底迷宫二层" then
			当前地图 = 1119
			角色坐标.x = 47
			角色坐标.y = 11
		elseif 切换 == "海底迷宫五层进海底迷宫四层" then
			当前地图 = 1121
			角色坐标.x = 50
			角色坐标.y = 37
		-- 沉船
		elseif 切换 == "沉船出东海海底" then
			当前地图 = 1507
			角色坐标.x = 85
			角色坐标.y = 10
		elseif 切换 == "沉船进沉船内室" then
			当前地图 = 1509
			角色坐标.x = 14
			角色坐标.y = 18
		elseif 切换 == "沉船内室出沉船" then
			当前地图 = 1508
			角色坐标.x = 70
			角色坐标.y = 65
		-- 野外
		elseif 切换 == "江南野外传送建邺城" then
			当前地图 = 1501
			角色坐标.x = 9
			角色坐标.y = 141
		elseif 切换 == "江南野外传送长安" then
			当前地图 = 1001
			角色坐标.x = 508
			角色坐标.y = 275
		-- 长安
		elseif 切换 == "长安传送江南野外" then
			当前地图 = 1193
			角色坐标.x = 22
			角色坐标.y = 16
		elseif 切换 == "长安传送长安酒店一楼" then
			当前地图 = 1028
			角色坐标.x = 17
			角色坐标.y = 38
		elseif 切换 == "长安酒店一楼传送长安" then
			当前地图 = 1001
			角色坐标.x = 458
			角色坐标.y = 116
		elseif 切换 == "长安酒店一楼传送长安酒店二楼" then
			当前地图 = 1029
			角色坐标.x = 41
			角色坐标.y = 18
		elseif 切换 == "长安酒店二楼传送长安酒店一楼" then
			当前地图 = 1028
			角色坐标.x = 29
			角色坐标.y = 20
		elseif 切换 == "长安传送化生寺" then
			当前地图 = 1002
			角色坐标.x = 10
			角色坐标.y = 88
		elseif 切换 == "化生寺传送长安" then
			当前地图 = 1001
			角色坐标.x = 492
			角色坐标.y = 14
		elseif 切换 == "化生寺传送光华殿" then
			当前地图 = 1528
			角色坐标.x = 18
			角色坐标.y = 26
		elseif 切换 == "光华殿传送化生寺" then
			当前地图 = 1002
			角色坐标.x = 61
			角色坐标.y = 61
		elseif 切换 == "化生寺传送藏经阁" then
			当前地图 = 1043
			角色坐标.x = 7
			角色坐标.y = 14
		elseif 切换 == "藏经阁传送化生寺" then
			当前地图 = 1002
			角色坐标.x = 88
			角色坐标.y = 45
		elseif 切换 == "长安传送万胜兵器铺" then
			当前地图 = 1020
			角色坐标.x = 15
			角色坐标.y = 21
		elseif 切换 == "万胜兵器铺传送长安" then
			当前地图 = 1001
			角色坐标.x = 472
			角色坐标.y = 242
		elseif 切换 == "长安传送锦绣饰品店" then
			当前地图 = 1017
			角色坐标.x = 35
			角色坐标.y = 27
		elseif 切换 == "锦绣饰品店传送长安" then
			当前地图 = 1001
			角色坐标.x = 396
			角色坐标.y = 269
		elseif 切换 == "长安传送张记布庄" then
			当前地图 = 1022
			角色坐标.x = 31
			角色坐标.y = 23
		elseif 切换 == "张记布庄传送长安" then
			当前地图 = 1001
			角色坐标.x = 373
			角色坐标.y = 246
		elseif 切换 == "长安传送云来酒店" then
			当前地图 = 1030
			角色坐标.x = 12
			角色坐标.y = 22
		elseif 切换 == "云来酒店传送长安" then
			当前地图 = 1001
			角色坐标.x = 431
			角色坐标.y = 225
		elseif 切换 == "长安传送回春堂" then
			当前地图 = 1016
			角色坐标.x = 14
			角色坐标.y = 25
		elseif 切换 == "回春堂传送长安" then
			当前地图 = 1001
			角色坐标.x = 484
			角色坐标.y = 127
		elseif 切换 == "长安传送留香阁" then
			当前地图 = 1033
			角色坐标.x = 47
			角色坐标.y = 42
		elseif 切换 == "留香阁传送长安" then
			当前地图 = 1001
			角色坐标.x = 222
			角色坐标.y = 250
		elseif 切换 == "长安传送长风镖局" then
			当前地图 = 1024
			角色坐标.x = 22
			角色坐标.y = 28
		elseif 切换 == "长风镖局传送长安" then
			当前地图 = 1001
			角色坐标.x = 522
			角色坐标.y = 129
		elseif 切换 == "长安传送国子监" then
			当前地图 = 1026
			角色坐标.x = 49
			角色坐标.y = 36
		elseif 切换 == "国子监传送长安" then
			当前地图 = 1001
			角色坐标.x = 282
			角色坐标.y = 82
		elseif 切换 == "长安传送金銮殿" then
			当前地图 = 1044
			角色坐标.x = 97
			角色坐标.y = 76
		elseif 切换 == "金銮殿传送长安" then
			当前地图 = 1001
			角色坐标.x = 104
			角色坐标.y = 51
		elseif 切换 == "长安传送大雁塔一层路口1" then
			当前地图 = 1004
			角色坐标.x = 34
			角色坐标.y = 58
		elseif 切换 == "长安传送大雁塔一层路口2" then
			当前地图 = 1004
			角色坐标.x = 103
			角色坐标.y = 58
		elseif 切换 == "长安传送大唐官府" then
			当前地图 = 1198
			角色坐标.x = 153
			角色坐标.y = 94
		elseif 切换 == "大唐官府传送长安" then
			当前地图 = 1001
			角色坐标.x = 314
			角色坐标.y = 10
		elseif 切换 == "大唐官府传送程咬金府" then
			当前地图 = 1054
			角色坐标.x = 35
			角色坐标.y = 27.5
		elseif 切换 == "程咬金府传送大唐官府" then
			当前地图 = 1198
			角色坐标.x = 82
			角色坐标.y = 60
		elseif 切换 == "大雁塔一层路口1传送长安" then
			当前地图 = 1001
			角色坐标.x = 442
			角色坐标.y = 37
		elseif 切换 == "大雁塔一层路口2传送长安" then
			当前地图 = 1001
			角色坐标.x = 480
			角色坐标.y = 37
		elseif 切换 == "大雁塔一层传送大雁塔二层" then
			当前地图 = 1005
			角色坐标.x = 65
			角色坐标.y = 22
		elseif 切换 == "大雁塔二层传送大雁塔一层" then
			当前地图 = 1004
			角色坐标.x = 73
			角色坐标.y = 10
		elseif 切换 == "大雁塔二层传送大雁塔三层" then
			当前地图 = 1006
			角色坐标.x = 65
			角色坐标.y = 67
		elseif 切换 == "大雁塔三层传送大雁塔二层" then
			当前地图 = 1005
			角色坐标.x = 70
			角色坐标.y = 73
		elseif 切换 == "大雁塔三层传送大雁塔四层" then
			当前地图 = 1007
			角色坐标.x = 64
			角色坐标.y = 21
		elseif 切换 == "大雁塔四层传送大雁塔三层" then
			当前地图 = 1006
			角色坐标.x = 69
			角色坐标.y = 13
		elseif 切换 == "大雁塔四层传送大雁塔五层" then
			当前地图 = 1008
			角色坐标.x = 88
			角色坐标.y = 33
		elseif 切换 == "大雁塔五层传送大雁塔四层" then
			当前地图 = 1007
			角色坐标.x = 103
			角色坐标.y = 29
		elseif 切换 == "大雁塔五层传送大雁塔六层" then
			当前地图 = 1090
			角色坐标.x = 19
			角色坐标.y = 37
		elseif 切换 == "大雁塔六层传送大雁塔五层" then
			当前地图 = 1008
			角色坐标.x = 21
			角色坐标.y = 45
		elseif 切换 == "大雁塔六层传送大雁塔七层" then
			当前地图 = 1009
			角色坐标.x = 34
			角色坐标.y = 38
		elseif 切换 == "大雁塔七层传送大雁塔六层" then
			当前地图 = 1090
			角色坐标.x = 67
			角色坐标.y = 43
		elseif 切换 == "长安传送大唐国境" then
			当前地图 = 1110
			角色坐标.x = 332
			角色坐标.y = 191
		elseif 切换 == "大唐国境传送长安" then
			当前地图 = 1001
			角色坐标.x = 10
			角色坐标.y = 275
		elseif 切换 == "大唐国境传送大唐境外" then
			当前地图 = 1173
			角色坐标.x = 626
			角色坐标.y = 23
		elseif 切换 == "傲来国传送女儿村" then
			当前地图 = 1142
			角色坐标.x = 118
			角色坐标.y = 131
		elseif 切换 == "傲来国传送傲来武器店" then
			当前地图 = 1101
			角色坐标.x = 13
			角色坐标.y = 21
		elseif 切换 == "傲来国传送花果山" then
			当前地图 = 1514
			角色坐标.x = 12
			角色坐标.y = 108
		elseif 切换 == "傲来国传送傲来国服饰店" then
			当前地图 = 1095
			角色坐标.x = 35
			角色坐标.y = 28
		elseif 切换 == "傲来国服饰店传送傲来国" then
			当前地图 = 1092
			角色坐标.x = 33.2
			角色坐标.y = 82.5
		elseif 切换 == "傲来国传送傲来钱庄" then
			当前地图 = 1099
			角色坐标.x = 44
			角色坐标.y = 33
		elseif 切换 == "傲来钱庄传送傲来国" then
			当前地图 = 1092
			角色坐标.x = 106
			角色坐标.y = 92
		-- 花果山
		elseif 切换 == "花果山传送傲来国" then
			当前地图 = 1092
			角色坐标.x = 209
			角色坐标.y = 14
		-- 北俱芦洲
		elseif 切换 == "花果山传送北俱芦洲" then
			当前地图 = 1174
			角色坐标.x = 209
			角色坐标.y = 39
		elseif 切换 == "花果山传送海底迷宫1层" then
			当前地图 = 1118
			角色坐标.x = 9
			角色坐标.y = 41
		elseif 切换 == "北俱芦洲传送花果山" then
			当前地图 = 1514
			角色坐标.x = 26
			角色坐标.y = 19
		elseif 切换 == "花果山传送水帘洞" then
			当前地图 = 1103
			角色坐标.x = 11
			角色坐标.y = 48
		elseif 切换 == "水帘洞传送花果山" then
			当前地图 = 1514
			角色坐标.x = 65
			角色坐标.y = 55
		-- 北具庐州
		elseif 切换 == "北俱芦洲传送龙窟" then
			当前地图 = 1177
			角色坐标.x = 149
			角色坐标.y = 80
		elseif 切换 == "北俱芦洲传送凤巢" then
			当前地图 = 1186
			角色坐标.x = 70
			角色坐标.y = 10
		-- 龙窟
		elseif 切换 == "龙窟一层传送北俱芦洲" then
			当前地图 = 1174
			角色坐标.x = 16
			角色坐标.y = 95
		elseif 切换 == "龙窟一层传送龙窟二层" then
			当前地图 = 1178
			角色坐标.x = 126
			角色坐标.y = 49
		elseif 切换 == "龙窟二层传送龙窟一层" then
			当前地图 = 1177
			角色坐标.x = 21
			角色坐标.y = 30
		elseif 切换 == "龙窟二层传送龙窟三层" then
			当前地图 = 1179
			角色坐标.x = 11
			角色坐标.y = 12
		elseif 切换 == "龙窟三层传送龙窟二层" then
			当前地图 = 1178
			角色坐标.x = 29
			角色坐标.y = 63
		elseif 切换 == "龙窟三层传送龙窟四层" then
			当前地图 = 1180
			角色坐标.x = 14
			角色坐标.y = 64
		elseif 切换 == "龙窟四层传送龙窟三层" then
			当前地图 = 1179
			角色坐标.x = 127
			角色坐标.y = 54
		elseif 切换 == "龙窟四层传送龙窟五层" then
			当前地图 = 1181
			角色坐标.x = 121
			角色坐标.y = 12
		elseif 切换 == "龙窟五层传送龙窟四层" then
			当前地图 = 1180
			角色坐标.x = 128
			角色坐标.y = 48
		elseif 切换 == "龙窟五层传送龙窟六层" then
			当前地图 = 1182
			角色坐标.x = 88
			角色坐标.y = 66
		elseif 切换 == "龙窟六层传送龙窟五层" then
			当前地图 = 1181
			角色坐标.x = 44
			角色坐标.y = 60
		elseif 切换 == "龙窟六层传送龙窟七层" then
			当前地图 = 1183
			角色坐标.x = 12
			角色坐标.y = 15
		elseif 切换 == "龙窟七层传送龙窟六层" then
			当前地图 = 1182
			角色坐标.x = 113
			角色坐标.y = 18
		-- 凤巢
		elseif 切换 == "凤巢一层传送北俱芦洲" then
			当前地图 = 1174
			角色坐标.x = 84
			角色坐标.y = 26
		elseif 切换 == "凤巢一层传送凤巢二层" then
			当前地图 = 1187
			角色坐标.x = 36
			角色坐标.y = 12
		elseif 切换 == "凤巢二层传送凤巢一层" then
			当前地图 = 1186
			角色坐标.x = 49
			角色坐标.y = 59
		elseif 切换 == "凤巢二层传送凤巢三层" then
			当前地图 = 1188
			角色坐标.x = 18
			角色坐标.y = 17
		elseif 切换 == "凤巢三层传送凤巢二层" then
			当前地图 = 1187
			角色坐标.x = 115
			角色坐标.y = 21
		elseif 切换 == "凤巢三层传送凤巢四层" then
			当前地图 = 1189
			角色坐标.x = 23
			角色坐标.y = 20
		elseif 切换 == "凤巢四层传送凤巢三层" then
			当前地图 = 1188
			角色坐标.x = 114
			角色坐标.y = 61
		elseif 切换 == "凤巢四层传送凤巢五层" then
			当前地图 = 1190
			角色坐标.x = 76
			角色坐标.y = 65
		elseif 切换 == "凤巢五层传送凤巢四层" then
			当前地图 = 1189
			角色坐标.x = 70
			角色坐标.y = 10
		elseif 切换 == "凤巢五层传送凤巢六层" then
			当前地图 = 1191
			角色坐标.x = 6
			角色坐标.y = 64
		elseif 切换 == "凤巢六层传送凤巢五层" then
			当前地图 = 1190
			角色坐标.x = 111
			角色坐标.y = 8
		elseif 切换 == "凤巢六层传送凤巢七层" then
			当前地图 = 1192
			角色坐标.x = 12
			角色坐标.y = 31
		elseif 切换 == "凤巢七层传送凤巢六层" then
			当前地图 = 1191
			角色坐标.x = 120
			角色坐标.y = 31
		--
		elseif 切换 == "傲来武器店传送傲来国" then
			当前地图 = 1092
			角色坐标.x = 124
			角色坐标.y = 113
		-- 女儿村
		elseif 切换 == "女儿村传送傲来国" then
			当前地图 = 1092
			角色坐标.x = 13
			角色坐标.y = 18
		elseif 切换 == "女儿村传送女儿村村长家" then
			当前地图 = 1143
			角色坐标.x = 31
			角色坐标.y = 25
		elseif 切换 == "女儿村村长家传送女儿村" then
			当前地图 = 1142
			角色坐标.x = 18
			角色坐标.y = 22
		-- 国境
		elseif 切换 == "大唐国境传送阴曹地府" then
			当前地图 = 1122
			角色坐标.x = 137
			角色坐标.y = 113
		-- 国境
		elseif 切换 == "凌波城传送大唐国境" then
			当前地图 = 1110
			角色坐标.x = 181
			角色坐标.y = 77
		-- 普陀山
		elseif 切换 == "普陀山传送大唐国境" then
			当前地图 = 1110
			角色坐标.x = 234
			角色坐标.y = 277
		elseif 切换 == "普陀山传送潮音洞" then
			当前地图 = 1141
			角色坐标.x = 46
			角色坐标.y = 36
		elseif 切换 == "潮音洞传送普陀山" then
			当前地图 = 1140
			角色坐标.x = 11
			角色坐标.y = 13
		elseif 切换 == "潮音洞传送天鸣洞天" then
			当前地图 = 16050
			角色坐标.x = 12
			角色坐标.y = 87
		elseif 切换 == "天鸣洞天传送潮音洞" then
			当前地图 = 1141
			角色坐标.x = 37
			角色坐标.y = 16
		-- 地府
		elseif 切换 == "阴曹地府传送大唐国境" then
			当前地图 = 1110
			角色坐标.x = 43
			角色坐标.y = 13
		elseif 切换 == "阴曹地府传送森罗殿" then
			当前地图 = 1123
			角色坐标.x = 40
			角色坐标.y = 32
		elseif 切换 == "森罗殿传送阴曹地府" then
			当前地图 = 1122
			角色坐标.x = 34
			角色坐标.y = 57
		elseif 切换 == "森罗殿传送地藏王府" then
			当前地图 = 1124
			角色坐标.x = 35
			角色坐标.y = 27
		elseif 切换 == "阴曹地府传送轮回司" then
			当前地图 = 1125
			角色坐标.x = 24
			角色坐标.y = 27
		elseif 切换 == "地藏王府传送森罗殿" then
			当前地图 = 1123
			角色坐标.x = 29
			角色坐标.y = 14
		elseif 切换 == "轮回司传送阴曹地府" then
			当前地图 = 1122
			角色坐标.x = 104
			角色坐标.y = 72
		-- 迷宫
		elseif 切换 == "阴曹地府传送地狱迷宫一层" then
			当前地图 = 1127
			角色坐标.x = 6
			角色坐标.y = 21
		elseif 切换 == "地狱迷宫一层传送阴曹地府" then
			当前地图 = 1122
			角色坐标.x = 29
			角色坐标.y = 14
		elseif 切换 == "地狱迷宫一层传送地狱迷宫二层" then
			当前地图 = 1128
			角色坐标.x = 99
			角色坐标.y = 16
		elseif 切换 == "地狱迷宫二层传送地狱迷宫一层" then
			当前地图 = 1127
			角色坐标.x = 17
			角色坐标.y = 72
		elseif 切换 == "地狱迷宫二层传送地狱迷宫三层" then
			当前地图 = 1129
			角色坐标.x = 12
			角色坐标.y = 69
		elseif 切换 == "地狱迷宫二层传送地狱迷宫三层2" then
			当前地图 = 1129
			角色坐标.x = 14
			角色坐标.y = 24
		elseif 切换 == "地狱迷宫三层传送地狱迷宫二层1" then
			当前地图 = 1128
			角色坐标.x = 105
			角色坐标.y = 53
		elseif 切换 == "地狱迷宫三层传送地狱迷宫二层2" then
			当前地图 = 1128
			角色坐标.x = 102
			角色坐标.y = 79
		elseif 切换 == "地狱迷宫三层传送地狱迷宫四层" then
			当前地图 = 1130
			角色坐标.x = 15
			角色坐标.y = 11
		elseif 切换 == "地狱迷宫四层传送地狱迷宫三层" then
			当前地图 = 1129
			角色坐标.x = 106
			角色坐标.y = 83
		elseif 切换 == "地狱迷宫四层传送无名鬼城" then
			当前地图 = 1202
			角色坐标.x = 16
			角色坐标.y = 113
		elseif 切换 == "无名鬼城传送地狱迷宫四层" then
			当前地图 = 1130
			角色坐标.x = 91
			角色坐标.y = 31
		-- 长寿
		elseif 切换 == "长寿村传送长寿郊外" then
			当前地图 = 1091
			角色坐标.x = 151
			角色坐标.y = 18
		elseif 切换 == "长寿村传送方寸山" then
			当前地图 = 1135
			角色坐标.x = 10
			角色坐标.y = 134
		elseif 切换 == "长寿村传送长寿村武器店" then
			当前地图 = 1085
			角色坐标.x = 24
			角色坐标.y = 21
		elseif 切换 == "长寿村传送长寿村服装店" then
			当前地图 = 1083
			角色坐标.x = 12
			角色坐标.y = 19
		elseif 切换 == "长寿村服装店传送长寿村" then
			当前地图 = 1070
			角色坐标.x = 87
			角色坐标.y = 139
		elseif 切换 == "长寿村武器店传送长寿村" then
			当前地图 = 1070
			角色坐标.x = 69.5
			角色坐标.y = 106
		-- 郊外
		elseif 切换 == "长寿郊外传送长寿村" then
			当前地图 = 1070
			角色坐标.x = 139
			角色坐标.y = 199
		-- 方寸山
		elseif 切换 == "方寸山传送长寿村" then
			当前地图 = 1070
			角色坐标.x = 106
			角色坐标.y = 12
		elseif 切换 == "方寸山传送灵台宫" then
			当前地图 = 1137
			角色坐标.x = 21
			角色坐标.y = 41
		elseif 切换 == "灵台宫传送方寸山" then
			当前地图 = 1135
			角色坐标.x = 124
			角色坐标.y = 35
		-- 天宫
		elseif 切换 == "天宫传送凌霄宝殿" then
			当前地图 = 1112
			角色坐标.x = 75
			角色坐标.y = 57
		elseif 切换 == "天宫传送蟠桃园" then
			当前地图 = 1231
			角色坐标.x = 143
			角色坐标.y = 89
		elseif 切换 == "天宫传送月宫" then
			当前地图 = 1114
			角色坐标.x = 116
			角色坐标.y = 85
		elseif 切换 == "天宫传送兜率宫" then
			当前地图 = 1113
			角色坐标.x = 40
			角色坐标.y = 26
		elseif 切换 == "凌霄宝殿传送天宫" then
			当前地图 = 1111
			角色坐标.x = 148
			角色坐标.y = 108
		elseif 切换 == "月宫传送天宫" then
			当前地图 = 1111
			角色坐标.x = 50
			角色坐标.y = 9
		elseif 切换 == "蟠桃园传送天宫" then
			当前地图 = 1111
			角色坐标.x = 12
			角色坐标.y = 97
		elseif 切换 == "兜率宫传送天宫" then
			当前地图 = 1111
			角色坐标.x = 26
			角色坐标.y = 147
		-- 境外
		elseif 切换 == "大唐境外传送大唐国境" then
			当前地图 = 1110
			角色坐标.x = 14
			角色坐标.y = 263
		elseif 切换 == "大唐境外传送魔王寨" then
			当前地图 = 1512
			角色坐标.x = 12
			角色坐标.y = 79
		elseif 切换 == "大唐境外传送五庄观" then
			当前地图 = 1146
			角色坐标.x = 10
			角色坐标.y = 64
		elseif 切换 == "大唐境外传送狮驼岭" then
			当前地图 = 1131
			角色坐标.x = 112
			角色坐标.y = 14
		elseif 切换 == "大唐境外传送朱紫国" then
			当前地图 = 1208
			角色坐标.x = 10
			角色坐标.y = 114
		elseif 切换 == "大唐境外传送小西天" then
			当前地图 = 1203
			角色坐标.x = 102
			角色坐标.y = 233
		elseif 切换 == "大唐境外传送墨家村" then
			当前地图 = 1218
			角色坐标.x = 77
			角色坐标.y = 165
		-- 魔王
		elseif 切换 == "魔王寨传送大唐境外" then
			当前地图 = 1173
			角色坐标.x = 60
			角色坐标.y = 12
		elseif 切换 == "魔王寨传送魔王居" then
			当前地图 = 1145
			角色坐标.x = 19
			角色坐标.y = 27
		elseif 切换 == "魔王居传送魔王寨" then
			当前地图 = 1512
			角色坐标.x = 88
			角色坐标.y = 21
		-- 五庄
		elseif 切换 == "五庄观传送大唐境外" then
			当前地图 = 1173
			角色坐标.x = 628
			角色坐标.y = 45
		elseif 切换 == "五庄观传送乾坤殿" then
			当前地图 = 1147
			角色坐标.x = 20
			角色坐标.y = 24
		elseif 切换 == "乾坤殿传送五庄观" then
			当前地图 = 1146
			角色坐标.x = 54
			角色坐标.y = 40
		-- 狮驼
		elseif 切换 == "狮驼岭传送大唐境外" then
			当前地图 = 1173
			角色坐标.x = 13
			角色坐标.y = 68
		elseif 切换 == "狮驼岭传送狮王洞" then
			当前地图 = 1134
			角色坐标.x = 20
			角色坐标.y = 25
		elseif 切换 == "狮驼岭传送大象洞" then
			当前地图 = 1132
			角色坐标.x = 20
			角色坐标.y = 24
		elseif 切换 == "大象洞传送狮驼岭" then
			当前地图 = 1131
			角色坐标.x = 23
			角色坐标.y = 18
		elseif 切换 == "狮驼岭传送老雕洞" then
			当前地图 = 1133
			角色坐标.x = 9
			角色坐标.y = 24
		elseif 切换 == "老雕洞传送狮驼岭" then
			当前地图 = 1131
			角色坐标.x = 17
			角色坐标.y = 63
		elseif 切换 == "狮王洞传送狮驼岭" then
			当前地图 = 1131
			角色坐标.x = 112
			角色坐标.y = 77
		-- 盘丝
		elseif 切换 == "大唐境外传送盘丝岭" then
			当前地图 = 1513
			角色坐标.x = 187
			角色坐标.y = 140
		elseif 切换 == "盘丝岭传送大唐境外" then
			当前地图 = 1173
			角色坐标.x = 533
			角色坐标.y = 11
		elseif 切换 == "盘丝岭传送盘丝洞" then
			当前地图 = 1144
			角色坐标.x = 15
			角色坐标.y = 52
		elseif 切换 == "盘丝洞传送盘丝岭" then
			当前地图 = 1513
			角色坐标.x = 187
			角色坐标.y = 24
		elseif 切换 == "战神山传送长安" then
			当前地图 = 1001
			角色坐标.x = 340
			角色坐标.y = 215
		elseif 切换 == "战神山传送神木林" then
			当前地图 = 1138
			角色坐标.x = 61
			角色坐标.y = 153
		elseif 切换 == "神木林传送神木屋" then
			当前地图 = 1154
			角色坐标.x = 45.5
			角色坐标.y = 38
		elseif 切换 == "神木屋传送神木林" then
			当前地图 = 1138
			角色坐标.x = 49
			角色坐标.y = 96
		elseif 切换 == "神木林传送战神山" then
			当前地图 = 1205
			角色坐标.x = 16
			角色坐标.y = 99
		-- 碗子山
		elseif 切换 == "碗子山传送大唐境外" then
			当前地图 = 1173
			角色坐标.x = 21
			角色坐标.y = 97
		elseif 切换 == "碗子山传送宝象国" then
			当前地图 = 1226
			角色坐标.x = 148
			角色坐标.y = 110
		elseif 切换 == "碗子山传送波月洞" then
			当前地图 = 1229
			角色坐标.x = 13
			角色坐标.y = 16
		-- 波月洞
		elseif 切换 == "波月洞传送碗子山" then
			当前地图 = 1228
			角色坐标.x = 64
			角色坐标.y = 19
		-- 无底洞
		elseif 切换 == "无底洞传送碗子山" then
			当前地图 = 1228
			角色坐标.x = 28
			角色坐标.y = 180
		elseif 切换 == "无底洞传送琉璃殿" then
			当前地图 = 1156
			角色坐标.x = 9
			角色坐标.y = 48
		elseif 切换 == "琉璃殿传送无底洞" then
			当前地图 = 1139
			角色坐标.x = 59
			角色坐标.y = 122
		-- 宝象国
		elseif 切换 == "宝象国传送丝绸之路" then
			当前地图 = 1235
			角色坐标.x = 393
			角色坐标.y = 14
		elseif 切换 == "宝象国传送宝象国皇宫" then
			当前地图 = 1227
			角色坐标.x = 69
			角色坐标.y = 49
		elseif 切换 == "宝象国皇宫传送宝象国" then
			当前地图 = 1226
			角色坐标.x = 8
			角色坐标.y = 15
		elseif 切换 == "宝象国传送解阳山" then
			当前地图 = 1042
			角色坐标.x = 104
			角色坐标.y = 91
		elseif 切换 == "宝象国传送麒麟山" then
			当前地图 = 1210
			角色坐标.x = 54
			角色坐标.y = 139
		elseif 切换 == "宝象国传送碗子山" then
			当前地图 = 1228
			角色坐标.x = 9
			角色坐标.y = 184
		-- 解阳山
		elseif 切换 == "解阳山传送宝象国" then
			当前地图 = 1226
			角色坐标.x = 122
			角色坐标.y = 8
		elseif 切换 == "解阳山传送子母河底" then
			当前地图 = 1041
			角色坐标.x = 73
			角色坐标.y = 12
		-- 子母河
		elseif 切换 == "子母河底传送解阳山" then
			当前地图 = 1042
			角色坐标.x = 13
			角色坐标.y = 90
		elseif 切换 == "子母河底传送西梁女国" then
			当前地图 = 1040
			角色坐标.x = 153
			角色坐标.y = 109
		-- 西梁女国
		elseif 切换 == "西梁女国传送子母河底" then
			当前地图 = 1041
			角色坐标.x = 19
			角色坐标.y = 85
		-- 麒麟山
		elseif 切换 == "麒麟山传送太岁府" then
			当前地图 = 1211
			角色坐标.x = 52
			角色坐标.y = 90
		elseif 切换 == "麒麟山传送朱紫国" then
			当前地图 = 1208
			角色坐标.x = 7
			角色坐标.y = 13
		elseif 切换 == "太岁府传送麒麟山" then
			当前地图 = 1210
			角色坐标.x = 23
			角色坐标.y = 24
		-- 须弥东界--########################################################?自己修改?##########################################
		elseif 切换 == "须弥东界传送丝绸之路" then
			当前地图 = 1235
			角色坐标.x = 214
			角色坐标.y = 14
		-- 凌云渡--########################################################?自己修改?##########################################
		elseif 切换 == "凌云渡传送丝绸之路" then
			当前地图 = 1235
			角色坐标.x = 12
			角色坐标.y = 91
		-- 丝绸之路--########################################################?自己修改?##########################################
		elseif 切换 == "丝绸之路传送须弥东界" then
			当前地图 = 1242
			角色坐标.x = 74
			角色坐标.y = 195
		elseif 切换 == "丝绸之路传送比丘国" then
			当前地图 = 1232
			角色坐标.x = 10
			角色坐标.y = 26
		elseif 切换 == "丝绸之路传送凌云渡" then
			当前地图 = 1920
			角色坐标.x = 109
			角色坐标.y = 213
		elseif 切换 == "丝绸之路传送朱紫国" then
			当前地图 = 1208
			角色坐标.x = 152
			角色坐标.y = 106
		elseif 切换 == "丝绸之路传送宝象国" then
			当前地图 = 1226
			角色坐标.x = 9
			角色坐标.y = 53
		elseif 切换 == "丝绸之路传长寿郊外" then
			当前地图 = 1091
			角色坐标.x = 28
			角色坐标.y = 138
		-- 比丘国--########################################################?自己修改?##########################################
		elseif 切换 == "比丘国传送丝绸之路" then
			当前地图 = 1235
			角色坐标.x = 348
			角色坐标.y = 88
		elseif 切换 == "比丘国传送柳林坡" then
			当前地图 = 1233
			角色坐标.x = 17
			角色坐标.y = 101
		-- 柳林坡--########################################################?自己修改?##########################################
		elseif 切换 == "柳林坡传送比丘国" then
			当前地图 = 1232
			角色坐标.x = 38
			角色坐标.y = 10
		-- 朱紫国
		elseif 切换 == "朱紫国传送大唐境外" then
			当前地图 = 1173
			角色坐标.x = 11
			角色坐标.y = 46
		elseif 切换 == "朱紫国传送麒麟山" then
			当前地图 = 1210
			角色坐标.x = 176
			角色坐标.y = 139
		elseif 切换 == "朱紫国传送丝绸之路" then
			当前地图 = 1235
			角色坐标.x = 305
			角色坐标.y = 7
		-- 墨家村
		elseif 切换 == "墨家村传送大唐境外" then
			当前地图 = 1173
			角色坐标.x = 229
			角色坐标.y = 17
		elseif 切换 == "墨家村传送墨家禁地" then
			当前地图 = 1221
			角色坐标.x = 21
			角色坐标.y = 10
		elseif 切换 == "墨家禁地传送墨家村" then
			当前地图 = 1218
			角色坐标.x = 48
			角色坐标.y = 11
		-- 小西天
		elseif 切换 == "小西天传送大唐境外" then
			当前地图 = 1173
			角色坐标.x = 16
			角色坐标.y = 25
		elseif 切换 == "小西天传送小雷音寺" then
			当前地图 = 1204
			角色坐标.x = 169
			角色坐标.y = 131
		elseif 切换 == "小雷音寺传送小西天" then
			当前地图 = 1203
			角色坐标.x = 26
			角色坐标.y = 23
		-- 女娲神迹
		elseif 切换 == "女娲神迹传送北俱芦洲" then
			当前地图 = 1174
			角色坐标.x = 20
			角色坐标.y = 21
		elseif 切换 == "东海湾到桃源镇" then
			当前地图 = 1003
			角色坐标.x = 26
			角色坐标.y = 92
		elseif 切换 == "桃源镇到东海湾" then
			当前地图 = 1506
			角色坐标.x = 26
			角色坐标.y = 10
		elseif 切换 == "柳林坡传送长寿郊外" then
			当前地图 = 1091
			角色坐标.x = 25
			角色坐标.y = 64
		elseif 切换 == "长寿郊外传送柳林坡" then
			当前地图 = 1233
			角色坐标.x = 137
			角色坐标.y = 85
		elseif 切换 == "长寿郊外传送丝绸之路" then
			当前地图 = 1235
			角色坐标.x = 591
			角色坐标.y = 15
		elseif 切换 == "长安传送书香斋" then
			当前地图 = 1019
			角色坐标.x = 21
			角色坐标.y = 26
		elseif 切换 == "长安传送冯记铁铺" then
			当前地图 = 1025
			角色坐标.x = 23
			角色坐标.y = 23
		elseif 切换 == "书香斋传送长安" then
			当前地图 = 1001
			角色坐标.x = 510
			角色坐标.y = 210
		elseif 切换 == "冯记铁铺传送长安" then
			当前地图 = 1001
			角色坐标.x = 482
			角色坐标.y = 188
		elseif 切换 == "丞相府传送长安" then
			当前地图 = 1001
			角色坐标.x = 164
			角色坐标.y = 142
		elseif 切换 == "长安传送丞相府" then
			当前地图 = 1049
			角色坐标.x = 54
			角色坐标.y = 40
		elseif 切换 == "仙缘洞天到朱紫国" then
			当前地图 = 1208
			角色坐标.x = 77
			角色坐标.y = 110
		elseif 切换 == "朱紫国传送朱紫国皇宫" then
			当前地图 = 1209
			角色坐标.x = 30
			角色坐标.y = 56
		elseif 切换 == "朱紫国皇宫传送朱紫国" then
			当前地图 = 1208
			角色坐标.x = 143
			角色坐标.y = 25
		elseif 切换 == "傲来国传送傲来圣殿" then
			当前地图 = 1100
			角色坐标.x = 21
			角色坐标.y = 29
		elseif 切换 == "傲来圣殿传送傲来国" then
			当前地图 = 1092
			角色坐标.x = 134
			角色坐标.y = 48
		elseif 切换 == "长寿村传送长寿神庙" then
			当前地图 = 1082
			角色坐标.x = 12
			角色坐标.y = 16
		elseif 切换 == "长寿神庙传送长寿村" then
			当前地图 = 1070
			角色坐标.x = 132
			角色坐标.y = 31
		elseif 切换 == "方寸山传送观星台" then
			当前地图 = 1223
			角色坐标.x = 50
			角色坐标.y = 10
		elseif 切换 == "观星台传送方寸山" then
			当前地图 = 1135
			角色坐标.x = 154
			角色坐标.y = 147
		elseif 切换 == "南岭山传送四方城" then
			当前地图 = 1237
			角色坐标.x = 235
			角色坐标.y = 8
		elseif 切换 == "四方城传送南岭山" then
			当前地图 = 1876
			角色坐标.x = 12
			角色坐标.y = 97
		elseif 切换 == "南岭山传送江南野外" then
			当前地图 = 1193
			角色坐标.x = 102
			角色坐标.y = 13
		elseif 切换 == "江南野外传送南岭山" then
			当前地图 = 1876
			角色坐标.x = 136
			角色坐标.y = 71
		elseif 切换 == "天机城传送天机堂" then
			当前地图 = 1253
			角色坐标.x = 52
			角色坐标.y = 130
		elseif 切换 == "天机堂传送天机城" then
			当前地图 = 1250
			角色坐标.x = 132
			角色坐标.y = 42
		elseif 切换 == "女魃墓室内传送女魃墓" then
			当前地图 = 1249
			角色坐标.x = 76
			角色坐标.y = 29
		elseif 切换 == "女魃墓传送女魃墓室内" then
			当前地图 = 1252
			角色坐标.x = 25
			角色坐标.y = 25
	 --=============
		end
	end
	return {[1]=当前地图,[2]=角色坐标}
end