--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2020-10-09 20:00:41
-- 梦幻西游游戏资源破解 baidwwy@vip.qq.com(313738139) 老毕   和 C++PrimerPlus 717535046 这俩位大神破解所以资源
--======================================================================--
function 取传送点(地图ID)
	local 传送 = {}
	--国境
	if 地图ID == 1501 then
		传送[1] = {x=115,y=13,切换="建邺城进建邺杂货铺"}
	    传送[2] = {x=147,y=59,切换="建邺城进建邺衙门"}
	    传送[3] = {x=128,y=102,切换="建邺城进建邺合生记"}
	    传送[4] = {x=75.7,y=131.3,切换="建邺城进建邺兵铁铺"}
	    传送[5] = {x=172,y=108,切换="建邺城进建邺布庄"}
	    传送[6] = {x=219.7,y=136.2,切换="建邺城进建邺回春堂"}
	    传送[7] = {x=242,y=12,切换="建邺城进东海湾旧"}
	    传送[8] = {x=272,y=113,切换="建邺城进东海湾新"}
	    传送[9] = {x=237,y=63,切换="建邺城进建邺钱庄"}
	    传送[10] = {x=4,y=59,切换="建邺城进建邺李府"}
	    传送[11] = {x=244,y=121,切换="建邺城进建邺周猎户家"}
	    传送[12] = {x=258,y=55,切换="建邺城进建邺普通民居"}
	-- 建邺城入口完毕，出口开始
	elseif 地图ID == 1505 then
	    传送[1] = {x=29,y=33,切换="建邺杂货铺出建邺城"}
	elseif 地图ID == 1537 then
	    传送[1] = {x=9,y=29,切换="建邺衙门出建邺城"}
	elseif 地图ID == 1523 then
	    传送[1] = {x=10,y=25,切换="建邺合生记出建邺城"}
	elseif 地图ID == 1502 then
	    传送[1] = {x=9,y=20,切换="建邺兵铁铺出建邺城"}
	elseif 地图ID == 1503 then
	    传送[1] = {x=11,y=22,切换="建邺布庄出建邺城"}
	elseif 地图ID == 1504 then
	    传送[1] = {x=28.4,y=24.3,切换="建邺回春堂出建邺城"}
	elseif 地图ID == 1524 then
	    传送[1] = {x=17,y=25,切换="建邺钱庄出建邺城"}
	elseif 地图ID == 1526 then
	    传送[1] = {x=31,y=29,切换="建邺周猎户家出建邺城"}
	elseif 地图ID == 1525  then
	    传送[1] = {x=11,y=19,切换="建邺普通民居出建邺城"}
	elseif 地图ID == 1527 then
	    传送[1] = {x=32.3,y=27.8,切换="建邺李府出建邺城"}
	    传送[2] = {x=5,y=20,切换="建邺李府进建邺李善人家"}
	elseif 地图ID == 1534 then
	    传送[1] = {x=41,y=19,切换="建邺李善人家出建邺李府"}
	-- 桃源镇
	elseif 地图ID == 1003 then
	    传送[1] = {x=17,y=95,切换="桃源镇到东海湾"}
	-- 东海湾
	elseif 地图ID == 1506 then
		传送[1] = {x=4,y=36,切换="东海湾进建邺城旧"}
		传送[2] = {x=5,y=112,切换="东海湾进建邺城新"}
		传送[3] = {x=89,y=109,切换="东海湾进东海海底"}
		传送[4] = {x=31,y=8,切换="东海湾到桃源镇"}
	elseif 地图ID == 1126 then
		传送[1] = {x=10,y=72,切换="东海岩洞出东海湾"}
	-- 龙宫
	elseif 地图ID == 1116 then
		传送[1] = {x=114,y=52,切换="龙宫进水晶宫"}
		传送[2] = {x=206,y=6,切换="龙宫进海底迷宫一层"}
		传送[3] = {x=132,y=52,切换="龙宫进水晶宫1"}
	elseif 地图ID == 1117 then
		传送[1] = {x=16.4,y=34.6,切换="水晶宫出龙宫"}
		传送[2] = {x=50.4,y=33,切换="水晶宫出龙宫1"}
	-- 海底
	elseif 地图ID == 1118 then
		传送[1] = {x=5,y=42,切换="海底迷宫一层进龙宫"}
		传送[2] = {x=58,y=8,切换="海底迷宫一层进海底迷宫二层"}
		传送[3] = {x=14,y=7,切换="海底迷宫一层进海底迷宫三层"}
	elseif 地图ID == 1119 then
		传送[1] = {x=6,y=43,切换="海底迷宫二层进海底迷宫一层"}
		传送[2] = {x=53,y=6,切换="海底迷宫二层进海底迷宫五层"}
	elseif 地图ID == 1120 then
		传送[1] = {x=56,y=40,切换="海底迷宫三层进海底迷宫一层"}
		传送[2] = {x=57,y=5,切换="海底迷宫三层进海底迷宫四层"}
	elseif 地图ID == 1121 then
		传送[1] = {x=4,y=43,切换="海底迷宫四层进海底迷宫三层"}
		传送[2] = {x=55,y=42,切换="海底迷宫四层进海底迷宫五层"}
	elseif 地图ID == 1532 then
		传送[1] = {x=20,y=42,切换="海底迷宫五层进海底迷宫二层"}
		传送[2] = {x=4,y=5,切换="海底迷宫五层进海底迷宫四层"}
	-- 东海
	elseif 地图ID == 1507 then
		传送[1] = {x=11,y=12.2,切换="东海海底进东海湾"}
		传送[2] = {x=89,y=13.8,切换="东海海底进沉船"}
	elseif 地图ID == 1508 then
		传送[1] = {x=22,y=6,切换="沉船出东海海底"}
		传送[2] = {x=75,y=69,切换="沉船进沉船内室"}
	elseif 地图ID == 1509 then
		传送[1] = {x=11,y=14,切换="沉船内室出沉船"}
	-- 野外
	elseif 地图ID == 1193 then
		传送[1] = {x=156,y=64,切换="江南野外传送建邺城"}
		传送[2] = {x=20,y=10,切换="江南野外传送长安"}
		传送[3] = {x=106,y=10,切换="江南野外传送南岭山"}
	-- 长安
	elseif 地图ID == 1001 then
		传送[1] = {x=540,y=277,切换="长安传送江南野外"}
		传送[2] = {x=461,y=112,切换="长安传送长安酒店一楼"}
		传送[3] = {x=502,y=8,切换="长安传送化生寺"}
		传送[4] = {x=475.6,y=238,切换="长安传送万胜兵器铺"}
		传送[5] = {x=394,y=265,切换="长安传送锦绣饰品店"}
		传送[6] = {x=368,y=240,切换="长安传送张记布庄"}
		传送[7] = {x=436,y=219,切换="长安传送云来酒店"}
		传送[8] = {x=447,y=33,切换="长安传送大雁塔一层路口1"}
		传送[9] = {x=475,y=33,切换="长安传送大雁塔一层路口2"}
		传送[10] = {x=308,y=4,切换="长安传送大唐官府"}
		传送[11] = {x=5,y=276,切换="长安传送大唐国境"}
		传送[12] = {x=487,y=120.7,切换="长安传送回春堂"}
		传送[13] = {x=218,y=244.5,切换="长安传送留香阁"}
		传送[14] = {x=529,y=125.5,切换="长安传送长风镖局"}
		传送[15] = {x=281.2,y=77.6,切换="长安传送国子监"}
		传送[16] = {x=100.5,y=46.8,切换="长安传送金銮殿"}
		传送[17] = {x=518,y=206,切换="长安传送书香斋"}
		传送[18] = {x=485,y=182,切换="长安传送冯记铁铺"}
		传送[19] = {x=513,y=82,切换="长安传送广源钱庄"}
		传送[20] = {x=158,y=138,切换="长安传送丞相府"}
	elseif 地图ID == 1049 then
		传送[1] = {x=59,y=42,切换="丞相府传送长安"}
	elseif 地图ID == 1013 then
    	传送[1] = {x=17,y=31,切换="广源钱庄传送长安"}
    elseif 地图ID == 1019 then
    	传送[1] = {x=15,y=29,切换="书香斋传送长安"}
    elseif 地图ID == 1025 then
        传送[1] = {x=16,y=24,切换="冯记铁铺传送长安"}
	elseif 地图ID == 1044 then
		传送[1] = {x=102.5,y=78,切换="金銮殿传送长安"}
	elseif 地图ID == 1028 then
		传送[1] = {x=14,y=39,切换="长安酒店一楼传送长安"}
		传送[2] = {x=31.2,y=14.9,切换="长安酒店一楼传送长安酒店二楼"}
	elseif 地图ID == 1029 then
		传送[1] = {x=36,y=15,切换="长安酒店二楼传送长安酒店一楼"}
	elseif 地图ID == 1198 then
		传送[1] = {x=162,y=97.5,切换="大唐官府传送长安"}
		传送[2] = {x=77.3,y=56,切换="大唐官府传送程咬金府"}
	elseif 地图ID == 1054 then
		传送[1] = {x=38.5,y=29,切换="程咬金府传送大唐官府"}
	elseif 地图ID == 1002 then
		传送[1] = {x=4,y=92,切换="化生寺传送长安"}
		传送[2] = {x=58,y=56,切换="化生寺传送光华殿"}
		传送[3] = {x=91,y=40,切换="化生寺传送藏经阁"}
	elseif 地图ID == 1043 then
		传送[1] = {x=9.9,y=16.4,切换="藏经阁传送化生寺"}
	elseif 地图ID == 1528 then
		传送[1] = {x=12,y=26,切换="光华殿传送化生寺"}
	elseif 地图ID == 1004 then
		传送[1] = {x=30.2,y=59.8,切换="大雁塔一层路口1传送长安"}
		传送[2] = {x=108,y=60,切换="大雁塔一层路口2传送长安"}
		传送[3] = {x=69,y=4,切换="大雁塔一层传送大雁塔二层"}
	elseif 地图ID == 1005 then
		传送[1] = {x=65,y=16,切换="大雁塔二层传送大雁塔一层"}
		传送[2] = {x=78,y=62,切换="大雁塔二层传送大雁塔三层"}
	elseif 地图ID == 1006 then
		传送[1] = {x=67,y=66,切换="大雁塔三层传送大雁塔二层"}
		传送[2] = {x=67,y=9,切换="大雁塔三层传送大雁塔四层"}
	elseif 地图ID == 1007 then
		传送[1] = {x=60,y=24,切换="大雁塔四层传送大雁塔三层"}
		传送[2] = {x=100,y=23,切换="大雁塔四层传送大雁塔五层"}
	elseif 地图ID == 1008 then
		传送[1] = {x=93,y=29,切换="大雁塔五层传送大雁塔四层"}
		传送[2] = {x=16,y=38,切换="大雁塔五层传送大雁塔六层"}
	elseif 地图ID == 1090 then
		传送[1] = {x=15,y=40,切换="大雁塔六层传送大雁塔五层"}
		传送[2] = {x=62,y=36,切换="大雁塔六层传送大雁塔七层"}
	elseif 地图ID == 1009 then
		传送[1] = {x=38,y=34,切换="大雁塔七层传送大雁塔六层"}
	elseif 地图ID == 1020 then
		传送[1] = {x=11.8,y=22.1,切换="万胜兵器铺传送长安"}
	elseif 地图ID == 1017 then
		传送[1] = {x=38,y=28,切换="锦绣饰品店传送长安"}
	elseif 地图ID == 1022 then
		传送[1] = {x=33,y=24,切换="张记布庄传送长安"}
	elseif 地图ID == 1030 then
		传送[1] = {x=9,y=23,切换="云来酒店传送长安"}
	elseif 地图ID == 1016 then
		传送[1] = {x=10,y=27,切换="回春堂传送长安"}
	elseif 地图ID == 1033 then
		传送[1] = {x=51,y=43.3,切换="留香阁传送长安"}
	elseif 地图ID == 1024 then
		传送[1] = {x=8,y=25,切换="长风镖局传送长安"}
		传送[2] = {x=29,y=36,切换="长风镖局传送长安"}
	elseif 地图ID == 1026 then
		传送[1] = {x=58.5,y=39.8,切换="国子监传送长安"}
	-- 傲来国
	elseif 地图ID == 1092 then
		传送[1] = {x=6,y=11,切换="傲来国传送女儿村"}
		传送[2] = {x=130,y=109,切换="傲来国传送傲来武器店"}
		传送[3] = {x=216,y=9,切换="傲来国传送花果山"}
		传送[4] = {x=180.2,y=120.3,切换="傲来国传送傲来国客栈"}
		传送[5] = {x=98.1,y=131.8,切换="傲来国传送傲来国杂货店"}
		传送[6] = {x=56,y=110.2,切换="傲来国传送傲来国药店"}
		传送[7] = {x=30.7,y=78.6,切换="傲来国传送傲来国服饰店"}
		传送[8] = {x=138,y=44,切换="傲来国传送傲来圣殿"}
		传送[9] = {x=103,y=91,切换="傲来国传送傲来钱庄"}
	--傲来钱庄
	elseif 地图ID == 1099 then
		传送[1] = {x=52,y=37,切换="傲来钱庄传送傲来国"}
	elseif 地图ID == 1100 then
		传送[1] = {x=15,y=33,切换="傲来圣殿传送傲来国"}
	--傲来国服饰店
  	elseif 地图ID == 1093 then
		传送[1] = {x=43,y=34,切换="傲来国客栈传送傲来国"}
	elseif 地图ID == 1104 then
		传送[1] = {x=42,y=35,切换="傲来国药店传送傲来国"}
   	elseif 地图ID == 1105 then
		传送[1] = {x=33,y=28,切换="傲来国杂货店传送傲来国"}

	elseif 地图ID == 1095 then
		传送[1] = {x=39.3,y=29.7,切换="傲来国服饰店传送傲来国"}
	-- 花果山
	elseif 地图ID == 1514 then
		传送[1] = {x=5,y=110,切换="花果山传送傲来国"}
		传送[2] = {x=20,y=15,切换="花果山传送北俱芦洲"}
		传送[3] = {x=65.5,y=48.4,切换="花果山传送水帘洞"}
		传送[4] = {x=103,y=112,切换="花果山传送海底迷宫1层"}
	elseif 地图ID == 1103 then
		传送[1] = {x=3,y=47,切换="水帘洞传送花果山"}
	-- 北俱芦洲
	elseif 地图ID == 1174 then
		传送[1] = {x=197,y=64,切换="北俱芦洲传送花果山"}
		传送[2] = {x=10,y=89,切换="北俱芦洲传送龙窟"}
		传送[3] = {x=86,y=19,切换="北俱芦洲传送凤巢"}
	-- 龙窟
	elseif 地图ID == 1177 then
		传送[1] = {x=152,y=87,切换="龙窟一层传送北俱芦洲"}
		传送[2] = {x=17,y=24,切换="龙窟一层传送龙窟二层"}
	elseif 地图ID == 1178 then
		传送[1] = {x=130,y=49,切换="龙窟二层传送龙窟一层"}
		传送[2] = {x=21,y=65,切换="龙窟二层传送龙窟三层"}
	elseif 地图ID == 1179 then
		传送[1] = {x=10,y=5,切换="龙窟三层传送龙窟二层"}
		传送[2] = {x=133,y=59,切换="龙窟三层传送龙窟四层"}
	elseif 地图ID == 1180 then
		传送[1] = {x=4,y=63,切换="龙窟四层传送龙窟三层"}
		传送[2] = {x=124,y=44,切换="龙窟四层传送龙窟五层"}
	elseif 地图ID == 1181 then
		传送[1] = {x=131,y=8,切换="龙窟五层传送龙窟四层"}
		传送[2] = {x=51,y=61,切换="龙窟五层传送龙窟六层"}
	elseif 地图ID == 1182 then
		传送[1] = {x=120,y=18,切换="龙窟六层传送龙窟七层"}
		传送[2] = {x=81,y=65,切换="龙窟六层传送龙窟五层"}
	elseif 地图ID == 1183 then
		传送[1] = {x=6,y=9,切换="龙窟七层传送龙窟六层"}
	-- 凤巢
	elseif 地图ID == 1186 then
		传送[1] = {x=75,y=6.8,切换="凤巢一层传送北俱芦洲"}
		传送[2] = {x=52,y=62,切换="凤巢一层传送凤巢二层"}
	elseif 地图ID == 1187 then
		传送[1] = {x=43.5,y=3,切换="凤巢二层传送凤巢一层"}
		传送[2] = {x=121,y=24,切换="凤巢二层传送凤巢三层"}
	elseif 地图ID == 1188 then
		传送[1] = {x=11,y=13,切换="凤巢三层传送凤巢二层"}
		传送[2] = {x=123,y=65.5,切换="凤巢三层传送凤巢四层"}
	elseif 地图ID == 1189 then
		传送[1] = {x=11,y=11,切换="凤巢四层传送凤巢三层"}
		传送[2] = {x=73.6,y=4,切换="凤巢四层传送凤巢五层"}
	elseif 地图ID == 1190 then
		传送[1] = {x=74,y=68,切换="凤巢五层传送凤巢四层"}
		传送[2] = {x=114,y=4,切换="凤巢五层传送凤巢六层"}
	elseif 地图ID == 1191 then
		传送[1] = {x=3.8,y=67,切换="凤巢六层传送凤巢五层"}
		传送[2] = {x=122.7,y=27,切换="凤巢六层传送凤巢七层"}
	elseif 地图ID == 1192 then
		传送[1] = {x=4,y=32,切换="凤巢七层传送凤巢六层"}
	-- 傲来国
	elseif 地图ID == 1101 then
		传送[1] = {x=8,y=21,切换="傲来武器店传送傲来国"}
	elseif 地图ID == 1142 then
		传送[1] = {x=124,y=134,切换="女儿村传送傲来国"}
		传送[2] = {x=14.8,y=18.7,切换="女儿村传送女儿村村长家"}
	elseif 地图ID == 1143 then
		传送[1] = {x=34.5,y=26,切换="女儿村村长家传送女儿村"}
	-- 国境
	elseif 地图ID == 1110 then
		传送[1] = {x=340,y=186,切换="大唐国境传送长安"}
		传送[2] = {x=51,y=9,切换="大唐国境传送阴曹地府"}
		传送[3] = {x=4,y=259,切换="大唐国境传送大唐境外"}
		传送[4] = {x=120,y=148,切换="大唐国境传送金山寺"}
		传送[5] = {x=229,y=51,切换="大唐国境传送江州民居"}
		传送[6] = {x=315,y=35,切换="大唐国境传送江州衙门"}
	elseif 地图ID == 1168 then
		传送[1] = {x=13,y=26,切换="江州衙门传送大唐国境"}
	-- 凌波城
	elseif 地图ID == 1150 then
		传送[1] = {x=3,y=93,切换="凌波城传送大唐国境"}
	elseif 地图ID == 1153 then
		传送[1] = {x=43,y=30,切换="金山寺传送大唐国境"}
	elseif 地图ID == 1167 then
		传送[1] = {x=29,y=22,切换="江州民居传送大唐国境"}
	-- 普陀山
	elseif 地图ID == 1140 then
		传送[1] = {x=88,y=67,切换="普陀山传送大唐国境"}
		传送[2] = {x=3,y=5,切换="普陀山传送潮音洞"}
	-- 潮音洞
	elseif 地图ID == 1141 then
		传送[1] = {x=58,y=43,切换="潮音洞传送普陀山"}
		传送[2] = {x=38.6,y=9.2,切换="潮音洞传送天鸣洞天"}
	--天鸣洞天
	elseif 地图ID == 16050 then
		传送[1] = {x=4,y=92,切换="天鸣洞天传送潮音洞"}
	-- 阴曹地府
	elseif 地图ID == 1122 then
		传送[1] = {x=146,y=116,切换="阴曹地府传送大唐国境"}
		传送[2] = {x=34,y=9,切换="阴曹地府传送地狱迷宫一层"}
		传送[3] = {x=30.2,y=51.7,切换="阴曹地府传送森罗殿"}
		传送[4] = {x=105,y=66,切换="阴曹地府传送轮回司"}
	-- 森罗殿
	elseif 地图ID == 1123 then
		传送[1] = {x=25.9,y=11.5,切换="森罗殿传送地藏王府"}
		传送[2] = {x=47,y=33,切换="森罗殿传送阴曹地府"}
	elseif 地图ID == 1124 then
		传送[1] = {x=41,y=29,切换="地藏王府传送森罗殿"}
   elseif 地图ID == 1125 then
		传送[1] = {x=29,y=31,切换="轮回司传送阴曹地府"}
	-- 迷宫
	elseif 地图ID == 1127 then
		传送[1] = {x=7,y=13,切换="地狱迷宫一层传送阴曹地府"}
		传送[2] = {x=18,y=75,切换="地狱迷宫一层传送地狱迷宫二层"}
	elseif 地图ID == 1128 then
		传送[1] = {x=100,y=11,切换="地狱迷宫二层传送地狱迷宫一层"}
		传送[2] = {x=112,y=82,切换="地狱迷宫二层传送地狱迷宫三层"}
		传送[3] = {x=114,y=53,切换="地狱迷宫二层传送地狱迷宫三层2"}
	elseif 地图ID == 1129 then
		传送[1] = {x=6,y=70,切换="地狱迷宫三层传送地狱迷宫二层2"}
		传送[2] = {x=114,y=83,切换="地狱迷宫三层传送地狱迷宫四层"}
		传送[3] = {x=5,y=24,切换="地狱迷宫三层传送地狱迷宫二层1"}
	elseif 地图ID == 1130 then
		传送[1] = {x=6,y=7,切换="地狱迷宫四层传送地狱迷宫三层"}
		-- 传送[2] = {x=85,y=33,切换="地狱迷宫四层传送无名鬼城"}
	elseif 地图ID == 1202 then
		传送[1] = {x=16,y=107,切换="无名鬼城传送地狱迷宫四层"}
	-- 长寿村
	elseif 地图ID == 1070 then
		传送[1] = {x=153,y=205,切换="长寿村传送长寿郊外"}
		传送[2] = {x=109,y=5,切换="长寿村传送方寸山"}
		传送[3] = {x=74,y=103,切换="长寿村传送长寿村武器店"}
		传送[4] = {x=83.8,y=136.8,切换="长寿村传送长寿村服装店"}
		传送[5] = {x=128,y=27,切换="长寿村传送长寿神庙"}
		传送[6] = {x=144,y=114,切换="长寿村传送长寿钱庄"}
	--长寿钱庄
	elseif 地图ID == 1081 then
		传送[1] = {x=19,y=20,切换="长寿钱庄传送长寿村"}
	--长寿神庙
	elseif 地图ID == 1082 then
		传送[1] = {x=9,y=19,切换="长寿神庙传送长寿村"}
	elseif 地图ID == 1083 then
		传送[1] = {x=9.9,y=20.7,切换="长寿村服装店传送长寿村"}
	elseif 地图ID == 1085 then
		传送[1] = {x=27,y=22.4,切换="长寿村武器店传送长寿村"}
	elseif 地图ID == 1091 then
		传送[1] = {x=155,y=9,切换="长寿郊外传送长寿村"}
		传送[2] = {x=18,y=57,切换="长寿郊外传送柳林坡"}
		传送[3] = {x=19,y=140,切换="长寿郊外传送丝绸之路"}
	-- 方寸山
	elseif 地图ID == 1135 then
		传送[1] = {x=5,y=132,切换="方寸山传送长寿村"}
		传送[2] = {x=130,y=30,切换="方寸山传送灵台宫"}
		传送[3] = {x=164.5,y=149,切换="方寸山传送观星台"}
	elseif 地图ID == 1137 then
		传送[1] = {x=17.3,y=42.7,切换="灵台宫传送方寸山"}
	elseif 地图ID == 1223 then--观星台
		传送[1] = {x=51,y=4,切换="观星台传送方寸山"}
	-- 天宫
	elseif 地图ID == 1111 then
		传送[1] = {x=146,y=104,切换="天宫传送凌霄宝殿"}
		传送[2] = {x=5,y=99,切换="天宫传送蟠桃园"}
		传送[3] = {x=44,y=5,切换="天宫传送月宫"}
		传送[4] = {x=27,y=142,切换="天宫传送兜率宫"}
	elseif 地图ID == 1112 then
		传送[1] = {x=79.3,y=58.4,切换="凌霄宝殿传送天宫"}
	elseif 地图ID == 1114 then
		传送[1] = {x=124,y=87,切换="月宫传送天宫"}
	elseif 地图ID == 1231 then
		传送[1] = {x=148,y=90,切换="蟠桃园传送天宫"}
	elseif 地图ID == 1113 then
		传送[1] = {x=43,y=30,切换="兜率宫传送天宫"}
	-- 境外
	elseif 地图ID == 1173 then
		传送[1] = {x=57,y=5,切换="大唐境外传送魔王寨"}
		传送[2] = {x=635,y=41,切换="大唐境外传送五庄观"}
		传送[3] = {x=4,y=72,切换="大唐境外传送狮驼岭"}
		传送[4] = {x=636,y=17,切换="大唐境外传送大唐国境"}
		传送[5] = {x=528.5,y=4,切换="大唐境外传送盘丝岭"}
		传送[6] = {x=6,y=54,切换="大唐境外传送朱紫国"}
		传送[7] = {x=10,y=21,切换="大唐境外传送小西天"}
		传送[8] = {x=236,y=13,切换="大唐境外传送墨家村"}
	-- 魔王
	elseif 地图ID == 1512 then
		传送[1] = {x=13,y=86,切换="魔王寨传送大唐境外"}
		传送[2] = {x=94,y=15,切换="魔王寨传送魔王居"}
	elseif 地图ID == 1145 then
		传送[1] = {x=15,y=29,切换="魔王居传送魔王寨"}
	-- 五庄
	elseif 地图ID == 1146 then
		传送[1] = {x=4,y=71,切换="五庄观传送大唐境外"}
		传送[2] = {x=59,y=35.5,切换="五庄观传送乾坤殿"}
	elseif 地图ID == 1147 then
		传送[1] = {x=16,y=25,切换="乾坤殿传送五庄观"}
	-- 狮驼
	elseif 地图ID == 1131 then
		传送[1] = {x=125,y=4,切换="狮驼岭传送大唐境外"}
		传送[2] = {x=118,y=68,切换="狮驼岭传送狮王洞"}
		传送[3] = {x=28,y=11,切换="狮驼岭传送大象洞"}
		传送[4] = {x=15,y=56,切换="狮驼岭传送老雕洞"}
	elseif 地图ID == 1132 then
		传送[1] = {x=20.80,y=26.2,切换="大象洞传送狮驼岭"}
	elseif 地图ID == 1133 then
		传送[1] = {x=6,y=24,切换="老雕洞传送狮驼岭"}
	elseif 地图ID == 1134 then
		传送[1] = {x=15,y=26,切换="狮王洞传送狮驼岭"}
	-- 盘丝
	elseif 地图ID == 1513 then
		传送[1] = {x=188.5,y=145.55,切换="盘丝岭传送大唐境外"}
		传送[2] = {x=192,y=19,切换="盘丝岭传送盘丝洞"}
	elseif 地图ID == 1144 then
		传送[1] = {x=11,y=55,切换="盘丝洞传送盘丝岭"}
	-- 战神山
	elseif 地图ID == 1205 then
		传送[1] = {x=125,y=101,切换="战神山传送长安"}
		传送[2] = {x=9,y=100,切换="战神山传送神木林"}
	-- 神木林
	elseif 地图ID == 1138 then
		传送[1] = {x=77,y=163,切换="神木林传送战神山"}
		传送[2] = {x=47.8,y=93,切换="神木林传送神木屋"}
	elseif 地图ID == 1154 then
		传送[1] = {x=48,y=38.5,切换="神木屋传送神木林"}
	-- 碗子山
	elseif 地图ID == 1228 then
		传送[1] = {x=92,y=184,切换="碗子山传送大唐境外"}
		传送[2] = {x=3,y=183.2,切换="碗子山传送宝象国"}
		传送[3] = {x=69.7,y=12,切换="碗子山传送波月洞"}
	-- 波月洞
	elseif 地图ID == 1229 then
		传送[1] = {x=7.8,y=11,切换="波月洞传送碗子山"}
	-- 无底洞
	elseif 地图ID == 1139 then
		传送[1] = {x=87,y=39.5,切换="无底洞传送碗子山"}
		传送[2] = {x=60,y=116,切换="无底洞传送琉璃殿"}
	-- 琉璃殿
	elseif 地图ID == 1156 then
		传送[1] = {x=5,y=49,切换="琉璃殿传送无底洞"}
	-- 宝象国
	elseif 地图ID == 1226 then
		传送[1] = {x=4,y=55,切换="宝象国传送丝绸之路"}
		传送[2] = {x=4,y=10,切换="宝象国传送宝象国皇宫"}
		传送[3] = {x=126,y=3,切换="宝象国传送解阳山"}
		传送[4] = {x=4.75,y=113.3,切换="宝象国传送麒麟山"}
		传送[5] = {x=153,y=112.3,切换="宝象国传送碗子山"}
	elseif 地图ID == 1227 then
		传送[1] = {x=72.5,y=51,切换="宝象国皇宫传送宝象国"}
	-- 解阳山
	elseif 地图ID == 1042 then
		传送[1] = {x=7,y=85.9,切换="解阳山传送子母河底"}
		传送[2] = {x=113,y=90,切换="解阳山传送宝象国"}
	-- 子母河底
	elseif 地图ID == 1041 then
		传送[1] = {x=72.5,y=4.5,切换="子母河底传送解阳山"}
		传送[2] = {x=15.2,y=86.2,切换="子母河底传送西梁女国"}
	-- 西梁女国
	elseif 地图ID == 1040 then
		传送[1] = {x=156.4,y=111.1,切换="西梁女国传送子母河底"}
	-- 麒麟山
	elseif 地图ID == 1210 then
		传送[1] = {x=16,y=17,切换="麒麟山传送太岁府"}
		传送[2] = {x=181,y=139,切换="麒麟山传送朱紫国"}
	elseif 地图ID == 1211 then
		传送[1] = {x=57.5,y=91.3,切换="太岁府传送麒麟山"}
	-- 丝绸之路
	elseif 地图ID == 1235 then
		传送[1] = {x=214,y=6.5,切换="丝绸之路传送须弥东界"}
		传送[2] = {x=348.4,y=92.5,切换="丝绸之路传送比丘国"}
		传送[3] = {x=5,y=92,切换="丝绸之路传送凌云渡"}
		传送[4] = {x=308,y=3,切换="丝绸之路传送朱紫国"}
		传送[5] = {x=391,y=5,切换="丝绸之路传送宝象国"}
		传送[6] = {x=596,y=9,切换="丝绸之路传长寿郊外"}
	-- 比丘国
	elseif 地图ID == 1232 then
		传送[1] = {x=3,y=26,切换="比丘国传送丝绸之路"}
		传送[2] = {x=36.5,y=3.5,切换="比丘国传送柳林坡"}
	-- 柳林坡
	elseif 地图ID == 1233 then
		传送[1] = {x=8,y=102,切换="柳林坡传送比丘国"}
		传送[2] = {x=147,y=93,切换="柳林坡传送长寿郊外"}
	-- 朱紫国
	elseif 地图ID == 1208 then
		传送[1] = {x=5,y=115.5,切换="朱紫国传送大唐境外"}
		传送[2] = {x=3,y=8,切换="朱紫国传送麒麟山"}
		传送[3] = {x=148,y=20,切换="朱紫国传送朱紫国皇宫"}
		传送[4] = {x=159,y=107,切换="朱紫国传送丝绸之路"}
	elseif 地图ID == 1209 then
		传送[1] = {x=23,y=61,切换="朱紫国皇宫传送朱紫国"}
	-- 墨家村
	elseif 地图ID == 1218 then
		传送[1] = {x=86,y=163,切换="墨家村传送大唐境外"}
		传送[2] = {x=52,y=7,切换="墨家村传送墨家禁地"}
	elseif 地图ID == 1221 then
		传送[1] = {x=25,y=4,切换="墨家禁地传送墨家村"}
	-- 小西天
	elseif 地图ID == 1203 then
		传送[1] = {x=104,y=235,切换="小西天传送大唐境外"}
		传送[2] = {x=21,y=19,切换="小西天传送小雷音寺"}
	elseif 地图ID == 1204 then
		传送[1] = {x=174.4,y=133.4,切换="小雷音寺传送小西天"}
	-- 女娲神迹
	elseif 地图ID == 1201 then
		传送[1] = {x=40,y=111.5,切换="女娲神迹传送北俱芦洲"}
	elseif 地图ID == 1242 then
		传送[1] = {x=82,y=196,切换="须弥东界传送丝绸之路"}
	--凌云渡
	elseif 地图ID == 1920 then
		传送[1] = {x=114,y=218,切换="凌云渡传送丝绸之路"}
	-- 朱紫国皇宫
	elseif 地图ID == 1209 then
		传送[1] = {x=24,y=59,切换="朱紫国皇宫传送朱紫国"}
	--仙缘洞天
	elseif 地图ID == 1216 then
		传送[1] = {x=213,y=46,切换="仙缘洞天到朱紫国"}
	elseif 地图ID == 1237 then--四方城
		传送[1] = {x=242,y=5,切换="四方城传送南岭山"}
	elseif 地图ID == 1876 then--南岭山
		传送[1] = {x=4,y=99,切换="南岭山传送四方城"}
		传送[2] = {x=145,y=72,切换="南岭山传送江南野外"}
	elseif 地图ID == 1249 then--女魃墓
		传送[1] = {x=82,y=25,切换="女魃墓传送女魃墓室内"}
		传送[2] = {x=2,y=74,切换="女魃墓传送东海岩洞"}
	elseif 地图ID == 1252 then--女魃墓室内
		传送[1] = {x=18,y=28,切换="女魃墓室内传送女魃墓"}
	elseif 地图ID == 1250 then--天机城
		传送[1] = {x=137,y=38,切换="天机城传送天机堂"}
		传送[2] = {x=17,y=140,切换="天机城传送大唐境外"}
	elseif 地图ID == 1253 then--天机堂
		传送[1] = {x=44,y=133,切换="天机堂传送天机城"}
	end
	return 传送
end