--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2020-05-08 15:27:57
-- 梦幻西游游戏资源破解 baidwwy@vip.qq.com(313738139) 老毕   和 C++PrimerPlus 717535046 这俩位大神破解所以资源
--======================================================================--
Q_乾坤袋={
	人={"中原一点红","草上飞前帽","水上飘李达","无影神偷刘欢"}
	,魔={"千年老妖","南海不死怪","百年小妖","魔眼吸精妖"}
	,仙={"无上真人","通广上仙","紫金洞大仙","南部大仙"}
}

Q_随机人物={
{地图=1001,人物={"陈员外","张老财","刘副将","御林军右统领",}},
{地图=1033,人物={"罗百万","陈妈妈","小桃红"}},
{地图=1070,人物={"海老先生","许姑娘","钟书生","蝴蝶女","慧觉和尚",}},
{地图=1135,人物={"觉明","灵儿",}},
{地图=1208,人物={"朱紫校尉","端木娘子","紫阳药师","朱紫侍卫"}},
{地图=1173,人物={"山贼头子","牛将军","白衣人","云游僧","姚太尉","阿紫","玉面狐狸","白鹿精","野猪王","冤魂","偷尸鬼","李彪","刘洪",}},
{地图=1513,人物={"女妖","金琉璃","栗栗儿",}},
{地图=1092,人物={"蝴蝶妹妹",}},
{地图=1093,人物={"慕容先生",}},
{地图=1506,人物={"楚依恋",}},
{地图=1116,人物={"万圣公主","龟太尉","虾将军","蛤蟆勇士","龟千岁","小龙女",}},
{地图=1142,人物={"柳飞絮","栗栗娘","绿儿","翠花",}},
{地图=1174,人物={"青琉璃","莽汉","龙女妹妹",}},
{地图=1111,人物={"守门天兵","顺风耳","天牢守卫","水兵统领",}},
{地图=1114,人物={"吴刚","嫦娥","康太尉",}},
{地图=1110,人物={"山神","白琉璃","小二","者释和尚","业释和尚","海释和尚","虾兵",}},
{地图=1122,人物={"孟婆","追梦鬼","马面",}},
{地图=1127,人物={"幽冥鬼",}},
{地图=1173,人物={"山贼头子","牛将军","白衣人","云游僧","姚太尉","阿紫","玉面狐狸","白鹿精","野猪王","冤魂","偷尸鬼","李彪","刘洪",}},
{地图=1110,人物={"山神","白琉璃","小二","者释和尚","业释和尚","海释和尚","虾兵",}},
{地图=1116,人物={"万圣公主","龟太尉","虾将军","蛤蟆勇士","龟千岁","小龙女",}},
{地图=1114,人物={"吴刚","嫦娥","康太尉",}},
}

Q_随机模型={"剑侠客","逍遥生","飞燕女","英女侠","巫蛮儿","神天兵","龙太子","舞天姬","玄彩娥","桃夭夭","虎头怪","巨魔王","狐美人","骨精灵","杀破狼","羽灵神","偃无师","鬼潇潇"}

Q_星宿名称={
	[1]="角木蛟"
	,[2]="亢金龙"
	,[3]="氐土貉"
	,[4]="房日兔"
	,[5]="心月狐"
	,[6]="尾火虎"
	,[7]="箕水豹"
	,[8]="井木犴"
	,[9]="鬼金羊"
	,[10]="柳土獐"
	,[11]="星日马"
	,[12]="张月鹿"
	,[13]="翼火蛇"
	,[14]="轸水蚓"
	,[15]="奎木狼"
	,[16]="娄金狗"
	,[17]="胃土雉"
	,[18]="昴日鸡"
	,[19]="毕月乌"
	,[20]="觜火猴"
	,[21]="参水猿"
	,[22]="斗木獬"
	,[23]="牛金牛"
	,[24]="女土蝠"
	,[25]="虚日鼠"
	,[26]="危月燕"
	,[27]="室火猪"
	,[28]="壁水貐"
}