--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2020-05-26 15:14:44
-- 梦幻西游游戏资源破解 baidwwy@vip.qq.com(313738139) 老毕   和 C++PrimerPlus 717535046 这俩位大神破解所以资源
--======================================================================--
装备特技={}

装备特技.弱点击破={}
装备特技.弱点击破.说明="以临时提高伤害力攻击对手,适于对付防御高者"
装备特技.弱点击破.消耗=50
装备特技.弱点击破.编号=37
装备特技.弱点击破.对象=3

装备特技.破血狂攻={}
装备特技.破血狂攻.说明="狂性大发，可以连续攻击两次 "
装备特技.破血狂攻.消耗=80
装备特技.破血狂攻.编号=36
装备特技.破血狂攻.对象=3
制造装备={}
制造装备.戒指={[60]="枫华戒",[80]="芙蓉戒",[100]="金麟绕",[120]="悦碧水",[140]="九曜光华"}
制造装备.手镯={[60]="香木镯",[80]="翡玉镯",[100]="墨影扣",[120]="花映月",[140]="金水菩提"}
制造装备.耳饰={[60]="翠叶环",[80]="明月珰",[100]="玉蝶翩",[120]="点星芒",[140]="凤羽流苏"}
制造装备.佩饰={[60]="芝兰佩",[80]="逸云佩",[100]="莲音玦",[120]="相思染",[140]="玄龙苍珀"}



装备特技.心疗术={}
装备特技.心疗术.说明="狂性大发，可以连续攻击两次 "
装备特技.心疗术.消耗=60

装备特技.凝气诀={}
装备特技.凝气诀.说明="狂性大发，可以连续攻击两次 "
装备特技.凝气诀.消耗=60

装备特技.凝神诀={}
装备特技.凝神诀.说明="狂性大发，可以连续攻击两次 "
装备特技.凝神诀.消耗=90





装备特技.破碎无双={}
装备特技.破碎无双.说明="物理攻击敌人，并减少对方和hp损失相同的mp "
装备特技.破碎无双.消耗=80
装备特技.破碎无双.编号=36
装备特技.破碎无双.对象=3




装备特技.冥王暴杀={}
装备特技.冥王暴杀.说明="减少对方HP，最小伤害为50 "
装备特技.冥王暴杀.消耗=60
装备特技.冥王暴杀.编号=40
装备特技.冥王暴杀.对象=3

装备特技.诅咒之伤={}
装备特技.诅咒之伤.说明="减少敌方单人当前20%的HP "
装备特技.诅咒之伤.消耗=40
装备特技.诅咒之伤.编号=16
装备特技.诅咒之伤.对象=3

装备特技.太极护法={}
装备特技.太极护法.说明="受到的法术伤害减半，效果为3回合"
装备特技.太极护法.消耗=90
装备特技.太极护法.编号=26
装备特技.太极护法.对象=2

装备特技.罗汉金钟={}
装备特技.罗汉金钟.说明="全体队友受到的法术伤害减半，效果为3回合"
装备特技.罗汉金钟.消耗=150
装备特技.罗汉金钟.编号=27
装备特技.罗汉金钟.对象=1

装备特技.慈航普渡={}
装备特技.慈航普渡.说明="复活我方全体队友"
装备特技.慈航普渡.消耗=150
装备特技.慈航普渡.编号=28
装备特技.慈航普渡.对象=1




装备特技.放下屠刀={}
装备特技.放下屠刀.说明="降低敌人的物理伤害力，效果持续到战斗结束 "
装备特技.放下屠刀.消耗=30
装备特技.放下屠刀.编号=30
装备特技.放下屠刀.对象=3

装备特技.笑里藏刀={}
装备特技.笑里藏刀.说明="减少敌方单体目标70点愤怒 "
装备特技.笑里藏刀.消耗=40
装备特技.笑里藏刀.编号=30
装备特技.笑里藏刀.对象=3

装备特技.碎甲术 ={}
装备特技.碎甲术.说明="降低敌方全体的物理防御力，效果持续到战斗结束 "
装备特技.碎甲术.消耗=30
装备特技.碎甲术.编号=30
装备特技.碎甲术.对象=3

装备特技.命归术={}
装备特技.命归术.说明="恢复自身1/2的气血（最高不超过人物等级*20） "
装备特技.命归术.消耗=130
装备特技.命归术.编号=7
装备特技.命归术.对象=1

装备特技.气归术={}
装备特技.气归术.说明="恢复自身1/4的气血（最高不超过人物等级*12） "
装备特技.气归术.消耗=60
装备特技.气归术.编号=6
装备特技.气归术.对象=1

装备特技.凝气决 ={}
装备特技.凝气决.说明="恢复自身魔法(魔法上限*10%+150) "
装备特技.凝气决 .消耗=60
装备特技.凝气决 .编号=4
装备特技.凝气决 .对象=1

装备特技.凝神诀 ={}
装备特技.凝神诀 .说明="恢复自身魔法(魔法上限*15%+250) "
装备特技.凝神诀 .消耗=90
装备特技.凝神诀 .编号=5
装备特技.凝神诀 .对象=1

装备特技.命疗术 ={}
装备特技.命疗术 .说明="恢复（上限9%+600）的气血，对单人使用 "
装备特技.命疗术 .消耗=90
装备特技.命疗术 .编号=3
装备特技.命疗术 .对象=2

装备特技.流云诀 ={}
装备特技.流云诀 .说明="提升队友的速度，效果持续到战斗结束"
装备特技.流云诀 .消耗=40
装备特技.流云诀 .编号=43
装备特技.流云诀 .对象=2

装备特技.啸风诀 ={}
装备特技.啸风诀 .说明="全体队友速度上升，效果持续到战斗结束"
装备特技.啸风诀 .消耗=80
装备特技.啸风诀 .编号=44
装备特技.啸风诀 .对象=1

装备特技.起死回生={}
装备特技.起死回生 .说明="复活队友并回复其一半气血"
装备特技.起死回生 .消耗=120
装备特技.起死回生 .编号=45
装备特技.起死回生 .对象=2
装备特技.回魂咒={}
装备特技.回魂咒 .说明="复活队友并回复其一半气血"
装备特技.回魂咒 .消耗=100
装备特技.回魂咒 .编号=45
装备特技.回魂咒 .对象=2

装备特技.气疗术 ={}
装备特技.气疗术 .说明="恢复（上限3%+200）的气血，对单人使用 "
装备特技.气疗术 .消耗=30
装备特技.气疗术 .编号=1
装备特技.气疗术 .对象=2

装备特技.野兽之力 ={}
装备特技.野兽之力 .说明="提升队友的伤害力，效果持续到战斗结束 "
装备特技.野兽之力 .消耗=40
装备特技.野兽之力 .编号=20
装备特技.野兽之力 .对象=2

装备特技.魔兽之印 ={}
装备特技.魔兽之印 .说明="提升我方全体的伤害力，效果持续到战斗结束 "
装备特技.魔兽之印 .消耗=70
装备特技.魔兽之印 .编号=21
装备特技.魔兽之印 .对象=1

装备特技.光辉之甲 ={}
装备特技.光辉之甲 .说明="提升队友的防御，效果持续到战斗结束 "
装备特技.光辉之甲 .消耗=40
装备特技.光辉之甲 .编号=22
装备特技.光辉之甲 .对象=2

装备特技.圣灵之甲 ={}
装备特技.圣灵之甲 .说明="提升我方全体的防御，效果持续到战斗结束 "
装备特技.圣灵之甲 .消耗=80
装备特技.圣灵之甲 .编号=23
装备特技.圣灵之甲 .对象=1

装备特技.四海升平 ={}
装备特技.四海升平 .说明="恢复全体队友1/4的气血（最高不超过被恢复目标的等级*12） "
装备特技.四海升平 .消耗=135
装备特技.四海升平 .编号=8
装备特技.四海升平 .对象=1

装备特技.水清诀 ={}
装备特技.水清诀 .说明="解除目标异常状态 "
装备特技.水清诀 .消耗=50
装备特技.水清诀 .编号=12
装备特技.水清诀 .对象=2

装备特技.玉清诀 ={}
装备特技.玉清诀 .说明="解除全体队员异常状态 "
装备特技.玉清诀 .消耗=125
装备特技.玉清诀 .编号=14
装备特技.玉清诀 .对象=2

装备特技.冰清诀 ={}
装备特技.冰清诀 .说明="解除目标当前异常状态并恢复目标1/4的气血 "
装备特技.冰清诀 .消耗=100
装备特技.冰清诀 .编号=13
装备特技.冰清诀 .对象=2

装备特技.晶清诀 ={}
装备特技.晶清诀 .说明="解除全体队员异常状态并恢复全体队员15%的气血 "
装备特技.晶清诀 .消耗=150
装备特技.晶清诀 .编号=15
装备特技.晶清诀 .对象=2